{"title":"If You Can't Fail, It Doesn't Count","uid":8314070,"size":254609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0004b271063a8fab3d573b626d9857093a44c35d&amp;dn=If+You+Can%27t+Fail%2C+It+Doesn%27t+Count&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1364542049,"description":" Dave Guymon, &quot;If You Can't Fail, It Doesn't Count&quot;\n2013 | ISBN-10: 0615772552 | EPUB,\n\nIT'S TIME TO MAKE YOUR IDEAS COUNT! They do, don't they? &quot;If You Can't Fail, It Doesn't Count&quot; explains why your ideas count more than ever right now and why you have the responsibility of taking chances. In &quot;If You Can't Fail, It Doesn't Count&quot; you will meet people who have failed until they didn't anymore; people like J.K. Rowling, Tony Hsieh, Mister Rogers, and Steve Jobs. &quot;If You Can't Fail, It Doesn't Count&quot; tells their inspirational stories and focuses on the success principles of their innovation and entrepreneurship that led them from being good to great. Whether you are an artist, an executive, a teacher, or just someone with a passion for life, &quot;If You Can't Fail, It Doesn't Count&quot; will inspire you to launch your ideas, whether they are funding a start-up, writing a bestseller, creating a campaign, or lifestyle design. &quot;If You Can't Fail, It Doesn't Count&quot;isn't about the secret to success. The secret to success is that there are no secrets. &quot;If You Can't Fail, It Doesn't Count&quot; is about creativity, innovation, the power of habit, and facing the fear of uncertainty and failure. Perhaps there is one secret. It's that failure isn't actually a bad thing. Instead of being the termination of goals, failure is a confirmation that what you're doing is meaningful and worthwhile. Failure doesn't mean stop. It means keep going. Are you afraid of failure actually failing? Then &quot;If You Can't Fail, It Doesn't Count&quot; is just the book for you. ","torrent":{"xt":"urn:btih:0004b271063a8fab3d573b626d9857093a44c35d","amp;dn":"If+You+Can%27t+Fail%2C+It+Doesn%27t+Count","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0004b271063a8fab3d573b626d9857093a44c35d","infoHashBuffer":{"type":"Buffer","data":[0,4,178,113,6,58,143,171,61,87,59,98,109,152,87,9,58,68,195,93]},"announce":[],"urlList":[]}}