{"title":"Windows.Firewall.Control.v3.8.2.2.Incl.Keygen","uid":8071630,"size":1149966,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:007567544bc6d1aed854d1f6b4a6ad7bb57cb3b7&amp;dn=Windows.Firewall.Control.v3.8.2.2.Incl.Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Purplebeanz","files":4,"time":1359247528,"description":"Windows Firewall Control is a nifty little application which extends the functionality of the Windows Firewall and provides quick access to the most frequent options of Windows Firewall. It runs in the system tray and allows user to control the native firewall easily without having to waste time by navigating to the specific part of the firewall. This is the best tool to manage the native firewall from Windows 8, Windows 7 and Windows Vista. Windows Firewall Control offers four filtering modes which can be switched with just a mouse click:\n\nHigh Filtering - All outbound and inbound connections are blocked. This setting blocks all attempts to connect to and from your computer.\nMedium Filtering - Outbound connections that do not match a rule are blocked. Only programs you allow can initiate outbound connections.\nLow Filtering - Outbound connections that do not match a rule are allowed. The user can block the programs he don't want to initiate outbound connections.\nNo Filtering - Windows Firewall is turned off. Avoid using this setting unless you have another firewall running on your computer. \n\n\nProgram Features\n Just one small executable file. All features are packed in the same file.\n Intuitive and easy accessible interface in the system tray.\n Full support with standard user accounts.\n Possibility to create temporary rules.\n Disable the ability of other programs to add Windows Firewall rules.\n Multiple and easier ways of creating new rules in Windows Firewall.\n Full support of creating, modifying and deleting Window Firewall rules.\n Lock feature which can disable the access to the settings of the program.\n Shell integration into the right click context menu of the executable files.\n Search for invalid rules with the possibility to delete them.\n Search for executable files through folders and create new rules in seconds.\n Choose if you want the program to start at user logon.\n Import and export the settings of the program.\n Protection to unauthorized uninstallation.\n Possibility to restore previous settings at uninstallation.\n And many more. Just try it out.\n\nRegistered Users Features\n\n\nLearning Mode which provides notifications for outgoing blocked connections. Four modes are available:\nHigh - Display notifications for all outgoing connections that were blocked by Windows Firewall, including System and Svchost.exe.\nMedium - Display notifications only for regular programs, without notifications for System and Svchost.exe.\nLow - Automatically allow digitally signed programs without notifications, but show notifications for unsigned programs.\nDisabled - Notifications are disabled.\n\n\nSystem Requirements :\n\n Microsoft .NET Framework version 4.0\n Compatible with all 32bit and 64bit versions of Windows 8, Windows 7, Windows Vista, Windows Server 2008. Windows XP is not supported.\n Windows Firewall service is required to be enabled for Windows Firewall Control to run.\n DNS Client service is required to be enabled for the notifications to work properly. \n\n\nInstructions :\n\n1. Install Windows Firewall Control 3.8.0.4 Old version first\n\n2. Use Keymaker. Enter installation id to get a valid key.\n\n3. Type/Copy The key from DOS prompt and Activate it\n\n4. Now Exit from taskbar and Install The New version 3.8.2.2 over it\n\n5. Your new version will be automatically activated\n\nTested on Windows 7 Ultimate SP1 X64 Working !\n\nProof : http://i.imgur.com/9wKUDIz.png\n","torrent":{"xt":"urn:btih:007567544bc6d1aed854d1f6b4a6ad7bb57cb3b7","amp;dn":"Windows.Firewall.Control.v3.8.2.2.Incl.Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"007567544bc6d1aed854d1f6b4a6ad7bb57cb3b7","infoHashBuffer":{"type":"Buffer","data":[0,117,103,84,75,198,209,174,216,84,209,246,180,166,173,123,181,124,179,183]},"announce":[],"urlList":[]}}