{"title":"Extreme Movie Manager 8.0.4.9-2010kaiser","uid":8198909,"size":147743441,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:027cc7e90b937033be4b0eca48397b91dee50344&amp;dn=Extreme+Movie+Manager+8.0.4.9-2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1361977632,"description":"                   Extreme Movie Manager 8.0.4.9-2010kaiser\n                   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n              N.B.: THIS INSTALLER MUST BE RAN AS ADMINISTRATOR\n              =================================================\n\n\n            CLICK ON THE SECOND GREEN ICON FOR INSTALLATION VIDEO\n            =====================================================\n\n\n         CLICK ON THE THIRD GREEN ICON FOR INSTALLATION INSTRUCTIONS\n         ===========================================================\n\n\nEXtreme Movie Manager - is probably the most advanced Movies/TV Series/Actors collection manager around. It can catalog movies stored in your Hard Disk and removable devices in seconds in any video formats such as DivX, XviD, VHS, DVD, VCD, SVHS, DVD-R, or LaserDiscwith all detailed information about codecs, resolutions etc. automatically. XMM import movie information and covers directly from online databases, take a look at supported websites.\n\neXtreme Movie Manager is not just a movie/video collection manager, it's also a movie and actor database and a cover manager. You can record extensive information about your favorite movies and actors. With the exclusive &quot;MagicScript&quot; Technology It allows you to retrieve movie information (especially PICTURES, IMAGES and COVERS) from ALL online movie databases.\neXtreme Movie Manager can also read information DIRECTLY from AVI, OGG, MPEG, RealMedia and IFO (DVD) files ! This means that you can import Video/Audio Codecs info with Just a Click!\n\nKey Features:\n- Organize your Movie/DVD collection automatically, lookup your Hard Disks, CD/DVD, portable devices in search for files, import movies list directly from CSV, TXT files\n- Organize your TV Shows collection automatically, lookup your Hard Disk, CD/DVD in search for Episodes files, download all data from internet, including all episode plot, images, cats with just a click!\n- Read Codec data directly from movie files, like bitrate, audio, channels, codec used, screen resolution...\n- Extract frames directly from your movie files, to have a preview of the video quality, take a look at film scene\n- Download all data, images, trailers automatically from internet from many sources in many languages, including casts, crew, DVD details\n- Browse your Movies and TV Shows collection on screen with a powerful interface, with rich search options\n- Export all your collection in several format, including CSV, TXT, HTML and the exclusive (x)HTML-DATABASE technology\n- Learn how to use eXtreme Movie Manager with a short and concise Video Tutorials, read our Quick Tour of XMM features and get support from our Forum.\n\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n           &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:027cc7e90b937033be4b0eca48397b91dee50344","amp;dn":"Extreme+Movie+Manager+8.0.4.9-2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027cc7e90b937033be4b0eca48397b91dee50344","infoHashBuffer":{"type":"Buffer","data":[2,124,199,233,11,147,112,51,190,75,14,202,72,57,123,145,222,229,3,68]},"announce":[],"urlList":[]}}