{"title":"The Ed Show 1-10-13.mp4","uid":8008259,"size":187080291,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:030b59e55ba4db0954add5a1826ba3e7701e9a26&amp;dn=The+Ed+Show+1-10-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1357944505,"description":"The Ed Show; January 10, 2013.\n\nIt's already legal for teachers to arm themselves at school in some states and the numbers could start growing.\n\nAnd, as we found out on &quot;The Ed Show&quot; last night, teachers in Utah's Alpine School District can have a gun in a classroom without even telling parents!\n\nEd Schultz got the parents' perspective on guns in the classroom from Bill McGee (parent of 4 children enrolled in the Alpine School District). Then he talked with Rhonda Bromley (spokesperson for the Alpine School District).\n\nThen, the National Rifle Association refused any discussion on gun laws. Sandy Phillips and Lonnie Phillips (relatives of Aurora, Colorado, shooting victim Jessica Ghawi), stood up for reform).\n\nKarl Rove and Tim Pawlenty want Republicans to stop playing chicken with the economy by trying to use the debt ceiling as leverage. Ed had the details.\n\nAmericans living in poverty is at an all-time high. Sen. Bernie Sanders (I-VT) was here with the outrage on inequality.\n\nHead injuries plagued Junior Seau's celebrated football career, but will the NFL finally act to protect their players?\n\nAnd in the BIG Finish, the Oscar nominations were announced Thursday. But how heavy will politics weigh with the academy? Ed asked David Edelstein (Chief Film Critic at New York magazine).","torrent":{"xt":"urn:btih:030b59e55ba4db0954add5a1826ba3e7701e9a26","amp;dn":"The+Ed+Show+1-10-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030b59e55ba4db0954add5a1826ba3e7701e9a26","infoHashBuffer":{"type":"Buffer","data":[3,11,89,229,91,164,219,9,84,173,213,161,130,107,163,231,112,30,154,38]},"announce":[],"urlList":[]}}