{"title":"Daniel Yergin The Quest 2011 Retail eBook-BitBook","uid":8192065,"size":6673303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03d2a600f43176f2d52c86841beaf57aef639c2a&amp;dn=Daniel+Yergin+The+Quest+2011+Retail+eBook-BitBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BlackTar","files":3,"time":1361848366,"description":"|                               The Quest                                    |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-05-18  SIZE: 5,06MB   DISKS: 02_______4,77MB      PAGES: 806    |\n |                                                                            |\n | PUBLISHER: Penguin Group                     GENRE: Political Science      |\n |                                                                            |\n | AUTHOR: Daniel Yergin                                                      |\n |                                                                            |\n | FORMAT: PDF    PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL: http://is_gd/2V0UTb                                                   |\n |                                                                            |\n | LANGUAGE: English   ISBN: 978-1-101-56358-8                                |\n :                                                                            :\n : In this gripping account of the quest for the energy that our world needs, :\n : Daniel Yergin continues the riveting story begun in his Pulitzer           :\n : Prize-winning book, The Prize. A master storyteller as well as a leading   :\n : energy expert, Yergin shows us how energy is an engine of global political :\n : and economic change. It is a story that spans the energies on which our    :\n : civilization has been built and the new energies that are competing to     :\n : replace them. From the jammed streets of Beijing to the shores of the      :\n : Caspian Sea, from the conflicts in the Mideast to Capitol Hill and Silicon :\n : Valley, Yergin takes us into the decisions that are shaping our future.    :\n :                                                                            :\n : The drama of oil-the struggle for access, the battle for control, the      :\n : insecurity of supply, the consequences of use, its impact on the global    :\n : economy, and the geopolitics that dominate it-continues to profoundly      :\n : affect our world.. Yergin tells the inside stories of the oil market and   :\n : the surge in oil prices, the race to control the resources of the former   :\n : Soviet empire, and the massive mergers that transformed the landscape of   :\n : world oil. He tackles the toughest questions: Will we run out of oil? Are  :\n : China and the United States destined to come into conflict over oil? How   :\n : will a turbulent Middle East affect the future of oil supply?              :\n :                                                                            :\n : Yergin also reveals the surprising and sometimes tumultuous history of     :\n : nuclear and coal, electricity, and the &quot;shale gale&quot; of natural gas, and how:\n : each fits into the larger marketplace. He brings climate change into unique:\n : perspective by offering an unprecedented history of how the field of       :\n : climate study went from the concern of a handful of nineteenth- century    :\n : scientists preoccupied with a new Ice Age into one of the most significant :\n : issues of our times.                                                       :\n :                                                                            :\n : He leads us through the rebirth of renewable energies and explores the     :\n : distinctive stories of wind, solar, and biofuels. He offers a perspective  :\n : on the return of the electric car, which some are betting will be necessary:\n : for a growing global economy.                                              :\n :                                                                            :\n : The Quest presents an extraordinary range of characters and dramatic       :\n : stories that illustrate the principles that will shape a robust and        :\n : flexible energy security system for the decades to come. Energy is humbling:\n : in its scope, but our future requires that we deeply understand this global:\n : quest that is truly reshaping our world.                                   :","torrent":{"xt":"urn:btih:03d2a600f43176f2d52c86841beaf57aef639c2a","amp;dn":"Daniel+Yergin+The+Quest+2011+Retail+eBook-BitBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03d2a600f43176f2d52c86841beaf57aef639c2a","infoHashBuffer":{"type":"Buffer","data":[3,210,166,0,244,49,118,242,213,44,134,132,27,234,245,122,239,99,156,42]},"announce":[],"urlList":[]}}