{"title":"The Eagles - Hotel California (1976) [DCC Gold GZS-1024]","uid":8149235,"size":268607909,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0464c2fbfcb3624e7e1ceabaeeb608d546cf7214&amp;dn=The+Eagles+-+Hotel+California+%281976%29+%5BDCC+Gold+GZS-1024%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mofie108","files":-1,"time":1361002252,"description":"The Eagles - Hotel California DCC Gold\n\nMastered by Steve Hoffman\n\nEAC Rip | FLAC+cue+log | 256 MB | DCC Gold Disc | Original Recording Remastered 1976-1992 | Art\n\nThe surprise is to hear how fresh this recording sounds on DCC's 24k gold disc version.\n\nA steady growth suddenly mushroomed into a monster as the Eagles, along with Fleetwood Mac, epitomized AOR in the early 70s. This record is supposedly a concept album but most of the purchasers merely enjoyed the accessible songs while driving to the coast in their Volkswagen Caravanettes with 2.4 children. Joe Walsh was added to give gutsy guitar in the wake of the country flavour of Bernie Leaden, while Randy Meisner grew in stature as a writer with 'Try And Love Again' and 'New Kid In Town'. The title track still bites as Henley's voice blends with Walsh's epic solo.\n\nGiven the extraordinary amount of airplay Hotel California garnered in the mid-70s and early '80s, it comes as quite a surprise to hear how fresh this recording sounds on DCC's 24k gold disc version. Familiar tracks benefit from the enhanced soundstage and control room-clarity of this exceptional digital remastering, revealing something of the actual recording studio room sound on many tracks.\n\nThe Eagles, along with Fleetwood Mac, epitomized AOR rock in the 1970s. The Eagles' Masterwork Hotel California is supposedly a concept album, but each song is a little world unto itself, and the record generated a number of hit singles. Ex-James Gang leader Joe Walsh was brought in to replace the departing Bernie Leadon's country flavor with some gutsy guitar, while Randy Meisner grew in stature alongside Don Henley and Glenn Frey as a writer, with &quot;Try And Love Again&quot; and &quot;New Kid In Town.&quot; The title track retains its sardonic bite as Henley's creepy lyrics mesh with Walsh's epic solo, making the tune a quintessential cultural touchstone of its era.\n\nRecorded at Criteria Studios, Miami, Florida and the Record Plant, Los Angeles, California from March to October 1976\n\nDon Felder - acoustic guitar, slide guitar, electric guitar, pedal steel guitar , steel guitar, vocals\nGlenn Frey - electric guitar, acoustic guitar, synthesizer, piano, keyboards, clavinet, vocals\nDon Henley - drums, percussion, synthesizer, vocals\nRandy Meisner - electric bass, acoustic guitar, guitarron, vocals\nJoe Walsh - electric guitar, slide guitar, acoustic guitar, lap steel guitar, keyboard, piano, organ, synthesizer, vocals\n\n1. Hotel California\n2. New Kid in Town\n3. Life in the Fast Lane\n4. Wasted Time\n5. Wasted Time (Reprise)\n6. Victim of Love\n7. Pretty Maids All in a Row\n8. Try and Love Again\n9. The Last Resort\n\n\nP/S : Not my Rip. All credits to the original Uploader/Ripper.\n\n","torrent":{"xt":"urn:btih:0464c2fbfcb3624e7e1ceabaeeb608d546cf7214","amp;dn":"The+Eagles+-+Hotel+California+%281976%29+%5BDCC+Gold+GZS-1024%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0464c2fbfcb3624e7e1ceabaeeb608d546cf7214","infoHashBuffer":{"type":"Buffer","data":[4,100,194,251,252,179,98,78,126,28,234,186,238,182,8,213,70,207,114,20]},"announce":[],"urlList":[]}}