{"title":"Gospel of the Kailedy","uid":8045235,"size":3410849,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:05472c99d44da7e3ab35f3e6b4448559c4c6b6f2&amp;dn=Gospel+of+the+Kailedy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ohfudge","files":-1,"time":1358731762,"description":"There is very little information available about the provenance of this purportedly ancient work or how it attained its current form.  It appears to be a narrative of the life and teachings of Jesus Christ recounted from a point of view completely independent of the canonical Gospel authors.\n\nIn many ways it is a more convincing work than other &quot;new gospels&quot; that have turned up from time to time.  Jesus' sayings are presented in clearer, less-ambiguous words than we find in the New Testament, and the comparative renderings often seem satisfyingly plausible.  There are also many additions to Jesus' teachings and parables, and there is a strong ring of truth in these as well (in this reader's opinion).  Plus this work has no obvious ax to grind as, for example, we find in The Gospel of the Holy Twelve, with its emphasis on vegetarianism and kindness towards animals.\n\nThis much is given out by the group that considers itself the caretaker of this work:\n\nThe word 'Kailedy' originated with the early Christians who came to Britain in 37AD led by Joseph of Arimathea and means 'wise strangers.' However, it should be noted that 'Culdee,' the Celtic form of the word, could also be translated as 'Servant of God.'\n\nThe Culdees, later known as Culdians, were part of the British or Celtic Christian community prior to its romanisation under Augustine, after which it suffered severely through persecution and suppression.\n\nThe last head of the Culdians was Nathaniel Smith, martyred at the beginning of the seventeenth century, and with his death the Culdians ceased to exist in a cohesive form, though steps were taken to preserve the secret spiritual lore.\n","torrent":{"xt":"urn:btih:05472c99d44da7e3ab35f3e6b4448559c4c6b6f2","amp;dn":"Gospel+of+the+Kailedy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05472c99d44da7e3ab35f3e6b4448559c4c6b6f2","infoHashBuffer":{"type":"Buffer","data":[5,71,44,153,212,77,167,227,171,53,243,230,180,68,133,89,196,198,182,242]},"announce":[],"urlList":[]}}