{"title":"Tara MacLean - Wake [2008] [FLAC]","uid":8047831,"size":230408587,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:074f93a2b62e8ae7be46a5d8a803594c14671376&amp;dn=Tara+MacLean+-+Wake+%5B2008%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":12,"time":1358792344,"description":"01. Wait It Out (04:00)\n02. Capsize (03:41)\n03. Things Outstanding (04:00)\n04. Here and Now (04:02)\n05. Got a Light? (04:08)\n06. Over and Out (03:36)\n07. If I Don't Have You (03:12)\n08. Carve (04:13)\n09. Mad World (04:23)\n10. Generation Z (03:07)\n\nWake is more sparsely arranged than Tara's earlier solo recordings and far less instrumental than her work with Shaye. Backing self-harmonies often accompany piano- and light guitar-based arrangements. Tara (acoustic guitar, vocals) is supported by producer Bill Bell who is credited with guitars and &quot;everything else.&quot;\n\nOther artists credited on the release include Kevin Breit (guitars), George Koller (bass, dilruba, cello), Andy Stochanski (drums), Kevin Hearn (piano, synth, accordion, rhodes, wurlitzer), Richard Evans (piano) and Mike White (trumpet). The album was financially supported by the Department of Canadian Heritage (Canda Music Fund) and Canada's Private Radio Broadcasters.\n\nThe album opens with &quot;Wait It Out,&quot; a very accessible number that re-exposes the listener to Tara's dulcet tones. The melody from the track &quot;Here And Now&quot; is very memorable and is certain to catch attention. &quot;Got A Light&quot; is equally catchy. Mike White's trumpet solos during the instrumental breaks are tremendous. The unique chord progressions coupled with Tara's powerful lead and harmony vocals and rich guitar-based arrangements make &quot;Over And Out&quot; an album stand-out. The electric guitar solos during the instrumental bridge are also tremendous.\n\nThe emotionally wrenching &quot;If I Don't Have You&quot; and &quot;Carve&quot; are most illustrative of Tara's skill in creating gentle ballads, perfectly suited for the Sunday Morning Coffee House setting. These are timeless classics that stand today as well as those tracks Nettwerk included on the 1994 Slowbrew-Music For A Cafe Culture compilation. Soft percussion, slide guitar and piano blend perfectly during the instrumental bridges.\n\nIn contrast, &quot;Mad World&quot; is a down tempo but accessible pop-oriented verse chorus tune with Tara's vocal work presented more up front soaring above the instrumentals. The album concludes with radically different tune entitled &quot;Generation Z.&quot; A modern rap-like song, significantly different than everything else on the album, the electronic arrangements and processed vocals alternate with vocal harmonies to show the diversity of Tara's talent. It was brave and thoughtful of Tara to include a track like this on the album.\n\nTara MacLean's busy life as a life partner and mother has retained a spot for song-writing and recording. Her album Wake clearly illustrates professional growth and development. Nettwerk Productions has a knack of identifying and retaining top female singer songwriters. We are going to hear more from Tara MacLean. Count on it.\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/01/10/tara-maclean/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/01/10/tara-maclean/&lt;/a&gt;","torrent":{"xt":"urn:btih:074f93a2b62e8ae7be46a5d8a803594c14671376","amp;dn":"Tara+MacLean+-+Wake+%5B2008%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"074f93a2b62e8ae7be46a5d8a803594c14671376","infoHashBuffer":{"type":"Buffer","data":[7,79,147,162,182,46,138,231,190,70,165,216,168,3,89,76,20,103,19,118]},"announce":[],"urlList":[]}}