{"title":"AmateurAllure - Arial, Erin, Caprice, Mandy, Rosalyn (Pre-Auditi","uid":7975526,"size":821165695,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:09be84abc65ca54ebc3e1754ff7ced9b7c3df465&amp;dn=AmateurAllure+-+Arial%2C+Erin%2C+Caprice%2C+Mandy%2C+Rosalyn+%28Pre-Auditi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kelvin09","files":1,"time":1356972625,"description":"AmateurAllure - Arial, Erin, Caprice, Mandy, Rosalyn (Pre-Auditions 21)\n\n\n &lt;a href=&quot;\nhttp://www.picrak.com/viewer.php?file=81045684756690022387.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picrak.com/viewer.php?file=81045684756690022387.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.picrak.com/viewer.php?file=90143980254875383528.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picrak.com/viewer.php?file=90143980254875383528.jpg&lt;/a&gt;\n\n\n\nThis week, we bring you another hot round of Pre-Audition videos! We have FIVE sexy girls for you to enjoy. First up is a brand new 20 year old in glasses from Georgia named Rosalyn. This &quot;indie&quot; hottie loves her dog, playing vinyl and is a self-described &quot;cum slut&quot;. Rosalyn confesses that this is her first time doing anything naughty on camera. She is super excited to be auditioning for the site! Ray can't even get her into the studio before she's down on her knees giving him a sample of her incredible oral skills. We then break to meet a little blonde cutie from Chicago named Caprice. She too really wants to be on the site. Caprice is super-excited but also a little nervous. Ray fixes that. He brings her to her knees and she is instantly at home, diving down on his dick, sucking and stroking and choking like a pro. Ray fucks her throat then fires a HUGE sticky load all over her hungry tongue! Great girl. Next up is a quickie with an Asian cutie named Arial. She's a little uncertain about giving head on camera, but once she gets Ray's big cock in her mouth, she delivers a suck job to remember. Next we have a familiar face! Our favorite &quot;cum addict&quot; Erin swings by Ray's place for a little oral session. She still has what it takes. Ray lays back and lets Erin go to work, watching as she deep throats and gags on his big dick. She then lays back and lets Ray fuck her mouth until he explodes and glazes her tongue with a nice thick load. Erin swallows every drop. Next we have the never before seen Pre-Audition video by a new member favorite -- Mandy! Many of you wrote in, saying you love this girl because she likes to play EXTRA dirty Mandy visits Ray in bed, pulls out his dick and goes to work. Ray goes hands-free as Mandy expertly sucks and strokes a nice hot load out of him and down her throat. Finally, Ray has our debutante Rosalyn under the studio lights. She sucks and fucks his cock to completion -- taking a nice big load of sperm on the tongue. What a cutie. Nice job Rosalyn!","torrent":{"xt":"urn:btih:09be84abc65ca54ebc3e1754ff7ced9b7c3df465","amp;dn":"AmateurAllure+-+Arial%2C+Erin%2C+Caprice%2C+Mandy%2C+Rosalyn+%28Pre-Auditi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09be84abc65ca54ebc3e1754ff7ced9b7c3df465","infoHashBuffer":{"type":"Buffer","data":[9,190,132,171,198,92,165,78,188,62,23,84,255,124,237,155,124,61,244,101]},"announce":[],"urlList":[]}}