{"title":"Escapology by Dixie Dooley","uid":8315741,"size":2515025337,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0a2654bace232e44270498135f91d14238b2ec74&amp;dn=Escapology+by+Dixie+Dooley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lethal111","files":5,"time":1364582465,"description":"Escapology with Dixie Dooley Volumes 1-3 (+ Bonus Houdini Lives DVD) (4 DVDs) Learn the stunts and escapes that made Houdini famous. Soon you'll be escaping from handcuffs, straight jackets, rope-ties, milk cans, packing crates, and chains! Get booked as an escape artist!\n\nWarning: This DVD set contains feats that require professional expertise and pose a great risk to the performer's safety. Under no circumstances should any of the stunts performed herein be attempted by amateurs. Persons desiring to learn these stunts should only do so under supervision of a trained professional. \n\n&quot;I didn't move to Las Vegas to drive down the back streets. I want to look at the lights. I want to see who's on the marquees. I love show business.&quot; -- Dixie Dooley: born to perform. \n\nVolume 1: Escape from the Ordinary \nJoin Dixie as he takes you on a journey into the world of escape. You'll learn some of the most powerful escapes ever performed--including some ingenious challenge escapes that will make the average magic show audience look more like a stadium full of crazed sports fans. The escapes on this DVD are performed with ordinary objects. You'll be able to perform them in almost any situation, and they're perfect for the streets. \n\nOn this volume you'll learn:\n\nSilk Through Rope\nHoudini Rope Tie\nSpirit Rope Tie\n100 Foot Rope Tie\nKnots\nLock Picking\nHistoric Handcuffs\nThumbcuffs\nEscape from a Rubber Band\nGerman Transport Chain Escape\nVolume 2: Handcuffs, Shackles, and Straight Jackets \nOver hundreds of years locksmiths and handcuff manufacturers have been called upon to produce a fascinating series of restraints--each more cunningly precise than the last. Dixie will teach you the secrets of overcoming each and every one of these manmade tools of imprisonment so you'll be ready for any challenge your spectators dream up. \n\nOn this volume you'll learn:\nEscape from any Handcuff\nKellar Rope Tie\nBamboo Torture Device\nShanghai Shackles\nStraight Jacket Escape\nSuspended Straight Jacket Escape\nGenerating Publicity\nVolume 3: Large Scale Escapes and Publicity Stunts \nEscape artists are the prizefighters of the magic world. Hang (upside down from a crane) with Dixie as he demonstrates and teaches the escapes that get headlines--huge headlines. Dixie doesn't stop with the escape; he takes you one step further by teaching you the secrets of effective escape publicity. You'll learn to write a press release, contact the media, and develop escapes and stunts that garner International press. As a special bonus you'll learn to build your own professional escape box--without breaking the bank. \n\nOn this volume you'll learn:\nTom Horn Transport Belt\nAssistant's Revenge\nMetamorphosis\nBuild Your Own Escape Box\nEscape Stunts and Release Forms\nSteel Straight Jacket\nGiant Milk Can Escape\nBonus 4th DVD: Houdini Lives Again \nThe concept behind the Houdini Lives Again show at the Plaza Hotel and Casino in Las Vegas was to take a nostalgic look at what it would be like to see Houdini perform his magic and death defying escapes live on stage. Through the use of costuming, antique props, and music, the show takes you there, back in time, to see Houdini perform live. \n\nThis 4th DVD is a performance only DVD. You'll see live performances of the following:\nClassic Illusions\nSucker Silk\nAssistant's Revenge (Stocks of Zanibar)\nMetamorphosis\nCrystal Ball Gazing\nSpiritualist Illusions\nMummy Asrah\nShanghai Shackles\nTom Horn Transport Escape\nStraight Jacket Escape\nFloating Cup\nMilk Can Escape\nThe bonus material on this DVD includes performances of the following:\nBurried Alive\nFrozen in Ice\n100' Rope Escape\nStraight Jacket and Crane Escape in Appleton, WI\nHoudini Seance\nEscape from Red Tape\nStraight Jacket and Crane Escape in Las Vegas\n\nEscape Masters Review \n\nDVD Review- Escapology featuring Dixie Dooley \nReview by Tom Carrier-Editor \n\nLas Vegas based escape artist Dixie Dooley and Penguin Magic have put together what is perhaps the most comprehensive collection of information on escapes ever gathered on video or DVD. Dixie has combined his extensive knowledge with his many years of experience as a Vegas headliner to make this information available to escape artists. Rather than concentrating on one type of escape, or its methods, Dixie has created a visual encyclopedia of knowledge into the world of escapes. \n\nVolume 1- Features escapes like Silk through Rope, The Houdini Rope Tie, (the secret of which is worth the price of the entire DVD set), and other great rope ties. It also covers a very unique &quot;escape&quot; form a rubber band that will become one of your favorite walk around bits. Some handcuff and thumbcuff informations also covered in this volume. \n\nVolume 2- This volume focuses on strait jacket escapes, both standing and suspended, and covers other restraint devices such as Shanghai Shackles and the Kellar Rope Tie. The two gems on this volume would be the information on generating publicity, and Dixie's method of escaping from any handcuff. \n\nVolume 3- If you are looking for large stage escapes, this volume is for you. Covered is the Tom Horn Transport Belt, Assistant's Revenge, Metamorphosis, Steel Strait Jacket, Giant Milk Can Escape, how to build your own escape box, and various release forms for the escape artist. \n\nThese tapes are invaluable to the working escape artist, or serious student of the art, and should be in everyone's library. If you purchase the entire 3 volume set from Penguin Magic, they will include a 4th DVD featuring Dixie performing some of his most famous escapes throughout his career. ","torrent":{"xt":"urn:btih:0a2654bace232e44270498135f91d14238b2ec74","amp;dn":"Escapology+by+Dixie+Dooley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2654bace232e44270498135f91d14238b2ec74","infoHashBuffer":{"type":"Buffer","data":[10,38,84,186,206,35,46,68,39,4,152,19,95,145,209,66,56,178,236,116]},"announce":[],"urlList":[]}}