{"title":"Azanyah - The One (flac-jazzman-reissue-2012)","uid":8014721,"size":394768400,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0f0ff08f0debb50dd9b72a799833c2b38d8c1b75&amp;dn=Azanyah+-+The+One+%28flac-jazzman-reissue-2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":16,"time":1358083945,"description":"Azanyah - The One (flac-jazzman-reissue-2012)\n\nLabel: Jazzman Records\n\nThe latest release on the Jazzman Records label is an obscure eighties spiritual jazz recording from Azanyah. Only ever released as a private pressing at the time, original copies have changed hands for over $1,000, the album has been restored for reissue from the master tapes and is now available once more for a new generation of jazz fans to appreciate.\n\nLed by British-born bassist Mamaniji Azanyah, the eight-piece take the listener on a blissful spiritual journey with The One. Following the spiritual jazz path trodden by the likes of John Coltrane, Pharoah Sanders and whole host of other artists recording in the early seventies, Azanyah add their own flavour to the sound with both elements African and folk music. The result is simply stunning ~ from the opening title track through to the closing I Will Surely Come Again, every track is to be savoured. Not a filler in sight.\n\nIn addition to Azanyah's throbbing bass you have Immanuel Zechariah playing some mean sax and flute throughout the set and Theresa Morton providing the vocals, all of which make this album something rather special. \n\nThere are only six tunes on the 52-minute set, but there is still plenty of musical variety to be enjoyed. Guiding Light is the swingingest tune on the set and will no doubt find favour with jazz dancers, while the beautiful Let God Come First has something of an uplifting folky feel to it, and Praise is infused with the sound of west African music.\n\nOut again on vinyl and CD after having been hidden away for so many years, this is an album you simply cannot afford to miss.\n\nTracklist\n1. The One 11:31\t\n2. Let God Come First 8:00\t\n3. In The Beauty Of Holiness 6:16\t\n4. Praise 7:51\t\n5. Guiding Light 7:32\t\n6. I Will Surely Come Again 10:50","torrent":{"xt":"urn:btih:0f0ff08f0debb50dd9b72a799833c2b38d8c1b75","amp;dn":"Azanyah+-+The+One+%28flac-jazzman-reissue-2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f0ff08f0debb50dd9b72a799833c2b38d8c1b75","infoHashBuffer":{"type":"Buffer","data":[15,15,240,143,13,235,181,13,217,183,42,121,152,51,194,179,141,140,27,117]},"announce":[],"urlList":[]}}