{"title":"Ar tonelico: Melody of Elemia [NTSC] PS2","uid":8013826,"size":3146481664,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0f2ee59396c4cd96af824c5e34dc772d7b0b46d0&amp;dn=Ar+tonelico%3A+Melody+of+Elemia+%5BNTSC%5D+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MAllyUni","files":1,"time":1358059310,"description":"PS2 Console-Style RPG\n\n*NOTE*\nI do not know if this will work on a mod ps2, but it does work well on the emulator. Though it does have some small graphic problem that will not affect the game play. Game is in English btw. And one last thing PLEASE SEED THIS\n\n*GAME DESCRIPTION*\nAr Tonelico takes place in the world of Sol Ciel, a small world consisting of nothing more than a tower and a floating continent. This small world is isolated by the Sea of Death below and a deadly sea of plasma above. The game also features a rare group of people called the Reyvateil, which, through the power of Songs, can converse with the world and cast powerful magic. However, in order to cast more powerful magic, they have to take a harmful material called Grathnode into their bodies, through an act called Install. Since the Install is a very painful experience for the Reyvateils, they only let people that they really trust to do it. The story centers on Lyner Barsett, an eighteen-year-old whose father governs Platina, a town located in the top floors of the tower. Lyner is uninterested in politics, and instead seeks adventure in the army. However, when a strange virus appears and they can't defeat it, Lyner is assigned the task to go down to the floating continent and retrieve a mystical artifact to defeat the virus.","torrent":{"xt":"urn:btih:0f2ee59396c4cd96af824c5e34dc772d7b0b46d0","amp;dn":"Ar+tonelico%3A+Melody+of+Elemia+%5BNTSC%5D+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f2ee59396c4cd96af824c5e34dc772d7b0b46d0","infoHashBuffer":{"type":"Buffer","data":[15,46,229,147,150,196,205,150,175,130,76,94,52,220,119,45,123,11,70,208]},"announce":[],"urlList":[]}}