{"title":"Sexually Broken--Isis in the house to help fuck up Anikka Albrit","uid":8080672,"size":1290808849,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:11e76171a44675faa2b51a7cad813ed4ce5b2d76&amp;dn=Sexually+Broken--Isis+in+the+house+to+help+fuck+up+Anikka+Albrit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1359491186,"description":"Isis Love in the house to help fuck up Anikka Albrite, tight bondage, throat fucking and cumming. | Anikka Albrite | Matt Williams | Isis Love\n\nJanuary 28, 2013 \n \n    \nMP4 only.\n\n \nWelcome back Anikka Albrite and Isis Love to the pages of Sexually Broken. Anikka is a former Gymnast, Track Star and still has that hard athletic body. Isis Love is one of the most talented and beautiful female rigger/handler in industry today. \n\nIsis starts by gagging, stripping and abusing our sexy gymnast. She enjoys the helplessness of Anikka's rock hard natural body. We bind Anikk's elbows tightly together and Isis adds clamps to her puffy nipples. Anikka has a huge mouth and takes our biggest ring gag and tongue trap. Isis bends Anikka over and plays with her perfect ass and pussy.\n\nIsis brings Anikka to her knees and commands her to suck the hard cock dancing in front of her face. With her mouth held open by the gag, the hard cock slides easily down her tight throat. Isis grabs a huge hand full of hair and pushes Anikka head deeper and deeper, harder and faster on to the cock. Isis controls the cock sucking and Anikka is at her mercy. We fuck her throat long and hard, challenging Anikka's skills and endurance.\n\nWith Anikka on her knees being skull fucked into next week, Isis gets behind, vibrating her to orgasm after orgasm. Anikka struggles to suck and cum at the same time, but we just make her do both. Her hardest orgasms coming when the cock is jammed ALL the way down her hungry throat.\n\nIsis drags Anikka to a standing position and bends her over. She orders the cock into Anikka's wet cunt. Anikka can do nothing but cum as the cock fucks her deep and hard, rough sex at its best. We spread Anikk's legs bind them and pull her over into a brutal standing inverted strappado. We make Anikka cum with a vibrator until she can barley stand anymore. We leave her in tremendously uncomfortable position unable to move at all, suffering. We look on at her sexy body quivering from the strain, and smile.  \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/01_28aalbrite/SexuallyBroken-Anikka-Albrite-Matt-Williams-Isis-Love-in-the-house-to-help-fuck-up-Anikka-Albrite-tight-bondage-throat-fucking-and-cumming.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/01_28aalbrite/SexuallyBroken-Anikka-Albrite-Matt-Williams-Isis-Love-in-the-house-to-help-fuck-up-Anikka-Albrite-tight-bondage-throat-fucking-and-cumming.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n ","torrent":{"xt":"urn:btih:11e76171a44675faa2b51a7cad813ed4ce5b2d76","amp;dn":"Sexually+Broken--Isis+in+the+house+to+help+fuck+up+Anikka+Albrit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11e76171a44675faa2b51a7cad813ed4ce5b2d76","infoHashBuffer":{"type":"Buffer","data":[17,231,97,113,164,70,117,250,162,181,26,124,173,129,62,212,206,91,45,118]},"announce":[],"urlList":[]}}