{"title":"Tray It Aplication Install","uid":8254846,"size":249344,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:12dec75b04b2402c62605c1d647b39c395b82fb9&amp;dn=Tray+It+Aplication+Install&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"codecking","files":1,"time":1363243794,"description":"TrayIt! saves precious Taskbar space for minimized windows. For each application which applies TrayIt! it creates a small icon in the System Tray. (System Tray area is located near the Clock). When application's window is minimized this icon represents the application on the Taskbar instead of the regular &quot;button&quot; in the Taskbar.\n\nIt is particularly useful for background tasks you typically keep\nrunning on your PC all day long like your favorite E-mail client,\nReal Player, etc.\n\nTrayIt! runs on Windows 95/98/Me, NT/2000/XP and does not require any installation.\nSimply create a new folder and place TrayIt!.exe and TrayIt!.dll there. When started, TrayIt! will show a dialog box with a short explanation how to use it. You may choose to load TrayIt! on system startup by selecting &quot;Option&quot; and checking &quot;Load TrayIt! on StartUp&quot; box. \n\n1. You can temporarily put any window in the system tray by keeping down the  button  when minimizing the window.\n\n2. To always keep window in the system tray when minimized, click with the RIGHT mouse button on the corresponding icon created in the tray in the previous step and  check &quot;Place in System Tray&quot; in the popup menu.\n\n3. Clicking with the right mouse button on the minimize icon will bring TrayIt! context menu for this window. Just check &quot;Place in System Tray&quot; in the popup menu to make window always go to the tray.\n\nPlease note that context menu will work only for the standard minimize icon and will not pop-up if the program use skins like MS Media player.\n\n\nTrayIt! stores setting in the Windows Registry so that you need to configure\nyour applications only once. And, of course, you can put your favorite programs\nin the &quot;Startup&quot; folder and start &quot;minimized&quot;! \n\n\nIf you start TrayIt! manually and would like to suppress the startup dialog box, just create a shortcut and specify /H in the start-up command.\n\nIf you encounter a problem while running TrayIt!, please visit http://www.teamcti.com/TrayIt to obtain the latest version. If you still have problems, please send a short description to: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7138161e033f08023106031805141c145f121e1c5f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n\nTrayIt! is absolutely FREE and if you know of a good site, please upload TrayIt.ZIP!\n\n---------------------\n\nLIABILITY DISCLAIMER -- READ BEFORE INSTALLING \n\nTHE SOFTWARE IS PROVIDED &quot;AS-IS&quot; AND WITHOUT WARRANTY OF ANY KIND, EXPRESSED, IMPLIED OR OTHERWISE, INCLUDING AND WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  IN NO EVENT SHALL THE AUTHOR OR HIS COMPANY BE LIABLE FOR ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, BUSINESS INTERRUPTION, LOSS OF INFORMATION, OR ANY OTHER LOSS) , WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR INABILITY TO USE THIS SOFTWARE.\n\n\n\n","torrent":{"xt":"urn:btih:12dec75b04b2402c62605c1d647b39c395b82fb9","amp;dn":"Tray+It+Aplication+Install","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12dec75b04b2402c62605c1d647b39c395b82fb9","infoHashBuffer":{"type":"Buffer","data":[18,222,199,91,4,178,64,44,98,96,92,29,100,123,57,195,149,184,47,185]},"announce":[],"urlList":[]}}