{"title":"Thieves World","uid":8009410,"size":85581626,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:139416397eea3ce87204acae7d4ca493e529e74a&amp;dn=Thieves+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1357963525,"description":"There are six of these in total, I'm only uploading the first three. I've had volume one and three since the mid 80s when they were first released, but never purchased number two, or three through six. It was great fun to finally read the second one last week some sixteen years later.\n\n'Thieves' World' 1-3\n\nStarblaze Graphics/The Donning Company, 1985-1986\n\nAdapted by Robert Lynn Asprin and Lynn Abbey\n\nIllustrated by Tim Sale\n\n'If you like stories about befuddled magicians, pure-hearted heroes, hobbits and bright-eyes elves... If you're looking for books about 'the sunshine-kind of magic that dwells within all of us..\n\nDon't buy (read) these books!'\n\nThieves' World is a shared world fantasy series created by Robert Lynn Asprin in 1978. The original series comprised twelve anthologies, including stories by such science fiction authors as Poul Anderson, John Brunner, Andrew J. Offutt, C. J. Cherryh, Janet Morris and Chris Morris. The Morrises introduced the Sacred Band of Stepsons in Thieves' World and spun off a series of novels about them and their ancient cavalry commander, Tempus. The first three novels in The Sacred Band of Stepsons saga were authorized Thieves World novels. Marion Zimmer Bradley was an early contributor, but spun off her main character in the novel Lythande (1986) and did not return for later volumes. The series went on hiatus after the twelfth anthology. In addition to the official anthologies, several authors published novels set in the milieu of Thieves World and published short stories in a variety of places.\n\nThieves' World is set in the city of Sanctuary, located at the edge of the Rankan Empire. The city was depicted as a place where many were downtrodden and where the invading Rankan gods and the Ilsigi gods they had ousted begin a struggle for primacy. As the series continued, additional invasions occurred and the city was taken over by the snake-worshipping Beysib as the Rankan empire collapsed. Over time, a number of the characters in the series are revealed either to be the offspring of or otherwise blessed by various figures in the pantheons of the competing cultures, and discover or develop various powers as the series progresses.\n\n","torrent":{"xt":"urn:btih:139416397eea3ce87204acae7d4ca493e529e74a","amp;dn":"Thieves+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"139416397eea3ce87204acae7d4ca493e529e74a","infoHashBuffer":{"type":"Buffer","data":[19,148,22,57,126,234,60,232,114,4,172,174,125,76,164,147,229,41,231,74]},"announce":[],"urlList":[]}}