{"title":"Thunder Over Reno (2008) DVDrip","uid":8026225,"size":734269440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:167fa45bfb70a66e46ac196bbbcdbf3c7e6c23de&amp;dn=Thunder+Over+Reno+%282008%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"V100","files":-1,"time":1358312159,"description":"Not my torrent. Got it years ago from probably from 1337x thru BTJunkie. Bad acting but the aerial sequences are nice. \n\nFrom IMDB-\nThrust into the life-and-death world of Air Racing at Reno, NV, Bandi has his hands full. He has to keep his mind on his flying, while dealing with possible love interest from Marti Jackman (Natasha Yi) and Paige Raider (Izabella St. James). His toughest job might be just staying alive...\n\nPlease help seed\n\nDuration  1 hour 33min \nOverall bit rate  1,048 Kbps \n\nVideo Xvid 624x336 23.976fps, 933 Kbps\nAudio MP3 48,000Hz stereo 102kbps\n\n\n\n\n    This film has footage of Bob Odegaard (Sept. 7, 2012)flying his Super Corsair (Racer 57) and Jimmy Leeward (Sept. 16, 2011)flying his P-51 Mustang (later known as Galloping Ghost). The Super Corsair seen here was one of the last 2 remaining Super Corsairs when this movie was made. Shortly after WWII it and 2 others were purchased by Cook Cleland who finished first in the 1947 Thompson Trophy Race and first in the 1949 Tinnerman Trophy Race. His 1949 pilot, ex-Navy pilot Ben McKillen, chose to keep it almost stock including retaining the sub-rudder, used to offset the torque of the powerful P&amp;W R-4360 engine. Ben also decided on the bright red color scheme with sunburst stripes. The one white propeller blade was painted to give the effect of a slow turning engine.\n\n After a Mustang crashed at the 1949 Cleveland Race all air racing was suspended for about 15y. #57 sat unused going thru 3 owners, who, sadly, all died flying warbirds. After 50y #57 was in bad shape. It was purchased by Bob Odegaard in 1996 and was airworthy in 1999. Sadly, Mr. Odeguaard crashed his F2G Sept 2012.\n\n\nhttpen.wikipedia.orgwikiGoodyear_F2G_Corsair\n\nhttp1337x.org\n","torrent":{"xt":"urn:btih:167fa45bfb70a66e46ac196bbbcdbf3c7e6c23de","amp;dn":"Thunder+Over+Reno+%282008%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"167fa45bfb70a66e46ac196bbbcdbf3c7e6c23de","infoHashBuffer":{"type":"Buffer","data":[22,127,164,91,251,112,166,110,70,172,25,107,187,205,191,60,126,108,35,222]},"announce":[],"urlList":[]}}