{"title":"Coast to Coast AM January 14 2013","uid":8024166,"size":56760126,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:172ee754b07d50b59180e568b5463db8e000cbd0&amp;dn=Coast+to+Coast+AM+January+14+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1358270208,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-14-13\nHost: \tGeorge Noory\nGuests: \tJames D. Stein, James McCanney\n\nProfessor of Mathematics at California State University Long Beach, Dr. James D. Stein, shared his scientific perspective on various phenomena that have been labeled as paranormal or supernatural. &quot;I realized there were a lot of scientists both past and present who had an interest in the paranormal and supernatural,&quot; and many of them had unexplained experiences themselves, he said. Brian Josephson, who won the Nobel Prize for Physics, is a believer in telepathy, and has written papers on the relationship between the paranormal and quantum mechanics, Stein recounted. In a survey of college professors in 1994, he continued, 55% of the natural science professors believed that ESP was already established or very likely.\n\nBack in 1929, Upton Sinclair wrote a book about his wife's experiments with telepathy called Mental Radio, and Albert Einstein penned the foreward. &quot;The results of the telepathic experiments carefully and plainly set forth in this book stand surely far beyond those which a nature investigator holds to be thinkable,&quot; he wrote. Einstein was saying that telepathy operates on forces that science has not yet discovered, in contrast to gravity and electromagnetism which seem to fall off with distance, Stein explained. According to most paranormal researchers, PSI forces seem to be independent of time and distance, &quot;and that's very unlike anything Einstein had encountered in his dealings with physics,&quot; he commented.\n\nStein believes that telepathy is almost certain to be established at some time in the future, via advancing technology in the field of brain imaging, detailing electromagnetic patterns. He also discussed the idea that in an infinite universe, there are certain scientific laws that could play a role in unexplained phenomena, yet be impossible to discover or prove. Such phenomena are legitimately supernatural because they are beyond the scope of science or any intelligence to ascertain, he contended. Stein also touched on such subjects as life-after-death, astrology, numerology, wormhole travel, and parallel universes.\nMcCanney Update\n\nFirst half-hour guest, maverick physicist James McCanney spoke about the coming of Comet ISON in 2013, which is predicted to be 15 times brighter than the full moon by November, and could be immense in size. Though there is no danger it will hit Earth, he noted, it may have some effect on weather. He also addressed water issues, suggested that water melting from ice caps and glaciers could be harvested and used in areas of need.\n\nNews segment guest: Catherine Austin Fitts\nWebsite(s):\n\n    jmccanneyscience.com\n\nBook(s):\n\n    The Paranormal Equation\n    Atlantis to Tesla -- The Kolbrin Connection\n    Planet-X, Comets and Earth Changes\n\n","torrent":{"xt":"urn:btih:172ee754b07d50b59180e568b5463db8e000cbd0","amp;dn":"Coast+to+Coast+AM+January+14+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"172ee754b07d50b59180e568b5463db8e000cbd0","infoHashBuffer":{"type":"Buffer","data":[23,46,231,84,176,125,80,181,145,128,229,104,181,70,61,184,224,0,203,208]},"announce":[],"urlList":[]}}