{"title":"Down To Fuck 3 XXX DVDRiP","uid":8177927,"size":2025341999,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1793d72f29c7e0ac6a8d880454c69b7cf9ab89df&amp;dn=Down+To+Fuck+3+XXX+DVDRiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":4,"time":1361565817,"description":"Release date: January 21, 2013\n\nFeaturing: Laurie Vargas, Christy Mack, AJ Applegate, Melody Jordan, Gia Jakarta\n\nRed headed, Big Natural Breasted &amp; Self Proclaimed Anal Whore Melody Jordan Spreads Her Ass for Eric John and stuffs it with his cock. Eric puts Melody in several Butt Hole Spreading Positions in between gagging her with his Rod. The 21-year-old West Virginia Native really does love getting ass fucked.\n \nI get a call from a local agent telling me he has a Brand Newbie who just started her porn career a few days earlier who is looking to fuck and suck with hopes of being the next big porn star! 21-year-old Indonesian newcomer Gia Jakarta shows up at my door wearing tight jeans a small top displaying Tattoo's, and wow what a smile! Gia is cute and sexy and I could tell by her smile she was Down To Fuck! After some foreplay Gia takes my cock and starts licking and sucking it like a popsicle before climbing on it for a slow deep vaginal penetration. After fingering her Butt Hole while fucking her pussy I decide to put my cock in her Ass and Gia responds nicely getting Ass fucked for the 1st Time.\n \nMack Booty Sensation Christy Mack Has made quite the splash in the porn biz. Christy's insanely Round Booty, big Boobs and Tattoo's give her one of the most unique looks in porn today. After seeing a video clip of Christy I knew I had to film her myself. I book Christy for a scene and I also Book porn stud Alex Gonz for the banging Honors. When interviewing Christy I then realize the 2 have not fucked yet. Alex approaches Christy like a true pervert and starts stroking his cock while eating her ass and pussy before penetrating the Indiana Native. Christy is on Fire with Alex Gonz as they fuck for the 1st time.\n \n\n\n  &lt;a href=&quot;\nhttp://www.forload.net/?v=fbwb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=fbwb.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.forload.net/?v=bpjp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=bpjp.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.forload.net/?v=pldtf3mp4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=pldtf3mp4.jpg&lt;/a&gt;\t","torrent":{"xt":"urn:btih:1793d72f29c7e0ac6a8d880454c69b7cf9ab89df","amp;dn":"Down+To+Fuck+3+XXX+DVDRiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1793d72f29c7e0ac6a8d880454c69b7cf9ab89df","infoHashBuffer":{"type":"Buffer","data":[23,147,215,47,41,199,224,172,106,141,136,4,84,198,155,124,249,171,137,223]},"announce":[],"urlList":[]}}