{"title":"The French - Local Information [2003][EAC,log,cue. FLAC]","uid":8148574,"size":275980188,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17cb31117f5f848ec446a1cc8e76cbb6e6596163&amp;dn=The+French+-+Local+Information+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":11,"time":1360983897,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: The French\nRelease: Local Information\nDiscogs: 1726012\nReleased: 2003\nLabel: Too Pure\nCatalog#: PURE 139CD\nFormat: CD, Album\nCountry: UK\nStyle: Electronic, Rock, Downtempo, Indie Rock\n\nTracklisting:\n\n01. Porn Shoes\n02. The Wu-Tang Clan\n03. The Stars, The Moon, The Sun And The Clouds\n04. When She Leaves Me\n05. Canada Water\n06. The Day You Arrive\n07. The Pines\n08. Nestbuilding\n09. Gabriel In The Airport\n10. Let It Go\n\nIt's so easy to love the French, and it's so easy to hate them. Under a precious new name, two boys from the indefinitely-on-hold Hefner -- bassist John Morrison and vocalist Darren Hayman -- have revamped themselves as the French, or rather Hefner-learns-to-listen-to-the-Magnetic-Fields.\n\nWhy there aren't even more bands stealing moves from the Fields has been a puzzle; maybe it's because Stephen Merritt already has a million wonderful Magnetic-look-alike side projects of his own. The French's sad hipster lollipop songs on their debut Local Information are delectable to the more discerning sweet tooth. But like many things charmed-to-be-not-charmed-which-is-so-charming, Local Information can get quite irritating.\n\nThe pluses to the French: cuteness, wistfulness, wryness. Like people from France, they're vaguely sophisticated and make incomprehensible noises. The minuses: excessive cuteness, excessive wistfulness, excessive wryness, not to mention boringness and bad timing. Sometimes they're like boys who just got their first synthesizers and still like pushing the buttons at random moments.\n\nLocal Information is all about the suburban experience [Annoying Topic No. 1], and the lyrics are often lousy and adolescent. But let's say that's intentional, so yes, it's really authentic. There was a reason I was relieved to leave high school; The French can do good, but forewarned is forearmed.\n\nWhen their highlight is &quot;The Pines,&quot; which is the polite way of referring to what could easily be titled &quot;White Supremacists in Love, Making It in the Forest Like It's 1999,&quot; how does one tactfully proceed? Although, kind reader, pyromania might not be your preferred form of recreational activity, The French is in no way endorsing ideologically challenged assholes. Set in Southern Arkansas, home to many loopy violent evangelicals, the song's lead woman admires her swastika tattoo and swoons and blows up stuff with her boyfriend in the forest. The kindling of love, the burning of the flame of God and the blowing up of things all get muddled and add up backwards to justify each other. Which shows the rationale, um, doesn't work. Anyhow, it's really funny.\n\nWith a few exceptions, the rest of Local Information is rather conspicuously content-free. They say stuff about girls and clouds and relationships, but the music is not something to listen to alone. Instead the songs are like narratives intended to narrate other narratives. So pop it into your stereo, don't listen too hard, clean your room, go to the kitchen, burn toast, arrange things on your desk, go about your life and it will all make sense.\n\nPut another way, The French are angling for a movie soundtrack. Instead of turning down the volume and taking out all the good parts, like Muzak, the French's edited and quiet songs work independently, giving the listener space to think about other things. Sometimes, like how cool it is not to pay attention to a bunch of boys reliving their adolescence. And sometimes, like how cool it is to be the French.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:17cb31117f5f848ec446a1cc8e76cbb6e6596163","amp;dn":"The+French+-+Local+Information+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17cb31117f5f848ec446a1cc8e76cbb6e6596163","infoHashBuffer":{"type":"Buffer","data":[23,203,49,17,127,95,132,142,196,70,161,204,142,118,203,182,230,89,97,99]},"announce":[],"urlList":[]}}