{"title":"Pavement - 2002 - Slanted &amp; Enchanted (Luxe and Reduxe) [fla","uid":8008781,"size":1294484430,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17defee5eb73e1708a3ae08c890c9c0fe077418f&amp;dn=Pavement+-+2002+-+Slanted+%26amp%3B+Enchanted+%28Luxe+and+Reduxe%29+%5Bfla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1357953310,"description":"Slanted and Enchanted is Pavement's critically acclaimed and influential first album. The album regularly appears at the top of lists of most important albums of the 1990s, despite relatively low record sales. The album was distributed to critics as early as 1991 before its original release and when the rest of Pavement joined the band, so when the album was released, the band had a bassist and Gary Young's drumming was so shaky that the band hired Bob Nastanovich to accompany him[citation needed]. In 2003, the album was ranked number 134 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nA two-disc expanded version of the album, Slanted and Enchanted: Luxe &amp; Reduxe, was released in 2002. Along with the original 14 tracks, it includes an additional ten tracks from recording sessions on disc one, and disc two consists of the four-track Watery, Domestic EP, seven other songs from recording sessions, and 13 live tracks (from a show at the Brixton Academy in London on December 14, 1992).\n\nThe album's name is taken from the title of a cartoon made by Silver Jews frontman David Berman. It is also an allusion to a line from Samuel Taylor Coleridge's famous poem Kubla Khan.\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/slanted-and-enchanted-mw0000273394&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/slanted-and-enchanted-mw0000273394&lt;/a&gt;\n\nSlanted and Enchanted is a left-field classic, a record that came out of nowhere to help establish a new subgenre of rock &amp; roll. Pavement had already sketched out their sound, as well as their amateurish lo-fi aesthetic, on a series of indie singles before recording their debut, but Slanted and Enchanted is where they pulled all of their disparate sounds together into a distinctive style. At first, the primitive sound of the record is the most gripping thing about Slanted, but soon the true innovations of the record appear through the songs themselves. Stephen Malkmus and Spiral Stairs subvert conventional pop structures, turning melodies inside out, reinterpreting and reworking older songs, and bending genres together. It's a complex, enthralling record, filled with fractured riffs, strong melodies, and cryptic melodies, and with all the hiss and static, Slanted and Enchanted sounds like listening to a distant college radio station -- melodies and hooks keep floating in and out of the mix, with individual lines instead of full lyrics surfacing through the murk. This unique song structure as much as the sound of the album itself makes Slanted and Enchanted an individual, signature work and one of the most influential records of the '90s.","torrent":{"xt":"urn:btih:17defee5eb73e1708a3ae08c890c9c0fe077418f","amp;dn":"Pavement+-+2002+-+Slanted+%26amp%3B+Enchanted+%28Luxe+and+Reduxe%29+%5Bfla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17defee5eb73e1708a3ae08c890c9c0fe077418f","infoHashBuffer":{"type":"Buffer","data":[23,222,254,229,235,115,225,112,138,58,224,140,137,12,156,15,224,119,65,143]},"announce":[],"urlList":[]}}