{"title":"New Sensations Gang Up XXX 2005 DVDRip mp4","uid":8025036,"size":731219658,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1bc068e8f412c24438353fb8bdbb4dc21f0d4324&amp;dn=New+Sensations+Gang+Up+XXX+2005+DVDRip+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Programsmith","files":-1,"time":1358288107,"description":" &lt;a href=&quot;http://imgload.me/img-50f57d771b21d.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgload.me/img-50f57d771b21d.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-50f57d773cca1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50f57d773cca1.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://imgload.me/img-50f57d775a35f.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50f57d775a35f.html&lt;/a&gt; \n\nDirected by: Denys Defrancesco\nStarring: Claudia Rossi, Wiska, Elinor Gasset, Charlie, Rudy, Nick Lang, Kamil Klein, Choky Ice, Thomas Stone, Joe Monti, George Reno, Cage, Tomas\n\nScene 1 - Claudia Rossi. This scene is already going when we join which is kind of no-no to me especially when we have Claudia who happen to have one of the well tone bodies of the Eurobabes, even while been around for quite some time now, there are four guys with her, she is BJ each at a time while being eaten and fingered up her ass, the bikini start falling as she progress dual BJ and then have the guys fuck their way till they DP her, they go RCA some Doggy anal, then back to DP, she receives the pops all over let 'em spill down to her breast to finish a very good start.\n\nScene 2 - Wiska. Wiska who is very lean and pretty, is trying to clean the beer bottles from the night before, and is trying to warm up the cuasi drunk guy, she succed, they are having a good one on one fun, when join by another guy and then another and another just before this, she is already analyzed, which leads to the classic DP's but she is not done just yet, there while in RCDP the slide the cock in her pussy toward her ass for a hot DAP, after some PTA and ATP and DP's she goes back to the DAP this time in GC, she is keep one cock in her mouth all the time, you'll see some DV as well in the same position, her pretty face is plastered by four counts of cum, to finish a really hot scene.\n\nScene 3 - Elinor Gasset. Elinor is not as pretty as the two previous girls but still have to go through the same treatment, but one guy less, she also have the shorter scene for a gangbang scene roughly about 26 minutes, cum outside her pussy, her left tit and mouth to call it a day very hard to top Wiska.\n\nIssued: New Sensations\nEnglish\nGenre: Gangbang, Anal, Double Penetration, Gonzo, Oral, Facial, PornStars\n\nFormat: MP4\nQuality: DVDRip\nVideo codec: AVC/H.264\nVideo: 640x368, 30fps, 864 kb / s\nSound: 48KHz, AAC, 112 kb / s (2 ch)","torrent":{"xt":"urn:btih:1bc068e8f412c24438353fb8bdbb4dc21f0d4324","amp;dn":"New+Sensations+Gang+Up+XXX+2005+DVDRip+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bc068e8f412c24438353fb8bdbb4dc21f0d4324","infoHashBuffer":{"type":"Buffer","data":[27,192,104,232,244,18,194,68,56,53,63,184,189,187,77,194,31,13,67,36]},"announce":[],"urlList":[]}}