{"title":"The Seven Gifts (All formats)","uid":7979324,"size":5447483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cdceb65c2258d67ebc0ef32106efbea9be68d7f&amp;dn=The+Seven+Gifts+%28All+formats%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7-books","files":-1,"time":1357126712,"description":"The Seven Gifts - that came to Earth\n\n\nA young boy must undertake a rite of passage, the like of which we cannot begin to imagine. The time has come for seven precious gifts bestowed on the Earth by its guardian to be revealed. The boy is charged by an Angel to find and understand them. He must read seven books whose stories hide the gifts.\n\nThe mysterious books defy our earthly sense of normal, and challenge even this boy's perception of reality as he seeks to unveil the secrets of the seven gifts; and the enigma of the Angel; and the reason for himself.\n\nWhen the books close, the gifts will be no longer hidden, the Angel no longer veiled; and the boy no longer a boy.\n\nAnd we no longer the people we were.\n\n\nSome reviewers have said: &quot;.. a great achievement&quot;; &quot;brilliant, wise &amp; funny .. lingers in the head like a piece of music&quot;; &quot;walks that fine line between profound and insane&quot;; &quot;It is really a wonderful, unique book&quot;; &quot;One of those unique and wonderful manuscripts that come one's way all too rarely; a most unusual and beautiful story that lingers in the mind long after one has read it&quot;\n\n\nThis torrent contains an EPUB (for Kobo, Nook etc); a MOBI (for Amazon Kindle); a PDF (for any ereader, tablet or PC; and also a PDF that is a mirror of the paperback book (readable on all ereaders, tablets and PCs)\n\n\nSee my website http://7-books.net for more info, reviews, interviews with me, and to purchase a paperback.","torrent":{"xt":"urn:btih:1cdceb65c2258d67ebc0ef32106efbea9be68d7f","amp;dn":"The+Seven+Gifts+%28All+formats%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cdceb65c2258d67ebc0ef32106efbea9be68d7f","infoHashBuffer":{"type":"Buffer","data":[28,220,235,101,194,37,141,103,235,192,239,50,16,110,251,234,155,230,141,127]},"announce":[],"urlList":[]}}