{"title":"Crosses: Portraits of Clergy Abuse - Carmine Galasso (pdf)","uid":8061504,"size":38610970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20372940c737ab1a587b1a08e397999187a39a3b&amp;dn=Crosses%3A+Portraits+of+Clergy+Abuse+-+Carmine+Galasso+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":3,"time":1359092747,"description":"Crosses: Portraits of Clergy Abuse - Carmine Galasso.\n\nImproved pdf - size reduced from 159 mb to 36 mb. \n\nThe book is a collection of photographs, essays and interviews with victims of sexual abuse by members of the clergy.\n\nWith portraits taken over a period of two to three years, here are also the accounts of children, now as adults themselves and in their own words, of a childhood blighted by the violation and horror of sexual abuse at the hands of a member of the Catholic clergy. From countless interviews, emails and phone conversations they recall their experiences of an abuse of power, be they priest, monk or nun - which has followed them into their adult lives.\n\nAccompanying their words are black and white portraits of the survivors today, in places that for them echo where they are now, or where they were then. Each has a different story to tell, a unique pattern of abuse, though they all share certain similarities. A certain grooming by the perpetrator, a blind trust of the parents in this person to look after their child both spiritually and in all ways their welfare, all systematically overruled by the one person who a community put their faith in.\n\nWhen the sexual abuse would end, then the self-abuse would often start. Drugs, alcohol, violence. Many went to jail for their crimes, this as a direct result of a much worse one that they had been too young to realise. Others, including two cases in the book, committed suicide.\n\nTwo prominent writers have contributed essays:\n\nA.W. Richard Sipe, a psychotherapist and former Benedictine monk and priest now married to a former Maryknoll nun. Well-known in his community, he has written several books, and counts as a speciality the exploration of priestly celibacy. \n\nMichael Kelly is an award winning newspaper journalist and author, who writes focusing not on the overall clergy sexual abuse problem in the Church, but narrows it down to the individual, the person who is hurt for life.\n","torrent":{"xt":"urn:btih:20372940c737ab1a587b1a08e397999187a39a3b","amp;dn":"Crosses%3A+Portraits+of+Clergy+Abuse+-+Carmine+Galasso+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20372940c737ab1a587b1a08e397999187a39a3b","infoHashBuffer":{"type":"Buffer","data":[32,55,41,64,199,55,171,26,88,123,26,8,227,151,153,145,135,163,154,59]},"announce":[],"urlList":[]}}