{"title":"Open Ended 2","uid":8023526,"size":1973736564,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:225d554357d13ee4ce76aa7afa09b5b90f32b2c7&amp;dn=Open+Ended+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Programsmith","files":-1,"time":1358259359,"description":"Country: USA\nGenre: Anal, Gonzo\nDuration: 3:15:31\nEnglish\nDirected by: Jonni Darkko\nStudio: Evil Angel\nStarring: Aleska Nicole, Amber Rayne, Anissa Kate, Chanel Preston, Eva Karera, Jayden Lee, Jonni Darkko, Mia Lelani, Skin Diamond, Winston Burbank\n\nDescription: Glamour perv Jonni Darkko is a XXX director who understands the allure of a sophisticated slut opening herself up to the camera. In &quot;Open Ended 2,&quot; the veteran smutmeister makes his backdoor fascination literal and explicit, with eight of the porn industry's nastiest, sexiest bitches making their elastic buttholes gape widely, either with huge toys or with whichever throbbing cock is at hand! Sultry, stunning, stocking-clad seductress Anissa Kate performs a sensuous solo show with an array of butt-stretching dildos and her vibrating wand; she shoves four fingers in her ass while buzzing her pussy to orgasm. Voluptuous slut Aleksa Nicole reams her rear but good and enjoys a massive, creamy cum facial from stud Winston Burbank. Super-busty French whore Eva Karera expands her derriere and gives the director a wet, POV-style blow job that climaxes with a faceful of jism. Tiny Amber Rayne opens her asshole to its limit in a thoroughly extreme session of rectal hijinks, ass fucking and deep-throat dicksucking. This petite slut's ass fun includes taking the girth of a baseball bat up her bunghole! Feisty Latina Mia Lelani, black punk princess Skin Diamond and Asian cutie Jayden Lee all give Jonni head while punishing their sweet asses with phallic intruders. Foxy brunette Chanel Preston exercises her big, bouncy booty with an inflatable butt plug. Don't try to imitate the intense sphincter tricks of &quot;Open Ended 2&quot; - anal gaping like this is strictly for professionals!\n\nVideo quality: DVDRip\nVideo format: MP4\nVideo: MPEG4 Video (H264) 704x386 29.97fps 1212kbps\nAudio: AAC 48000Hz stereo 129kbps\n &lt;a href=&quot;\nhttp://imgload.me/img-50f5562ca923d.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50f5562ca923d.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:225d554357d13ee4ce76aa7afa09b5b90f32b2c7","amp;dn":"Open+Ended+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"225d554357d13ee4ce76aa7afa09b5b90f32b2c7","infoHashBuffer":{"type":"Buffer","data":[34,93,85,67,87,209,62,228,206,118,170,122,250,9,181,185,15,50,178,199]},"announce":[],"urlList":[]}}