{"title":"free studio","uid":8139794,"size":60127258,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:261fe46a0e78a1f661a85224f5b2861e0972564f&amp;dn=free+studio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hama979","files":1,"time":1360786593,"description":"Free Studio (previously known as Free Studio Manager) is an excellent conversion app that bundles multiple converters into one handy program so that when it comes to converting files from one format to another, you can save time instead of searching around for the right tool each time.\n\nWhether you're listening to music on your iPod, burning home movies to DVD or messing around with videos from YouTube, you'll probably have to change format at least once or twice. It's in situations like this that Free Studio can help you out.\n\nThe Free Studio applications are divided into four sections - Internet, DVD &amp; Video, MP3 &amp; Audio and CD/DVD/BD. Altogether Free Studio contains more than 20 different tools, among them Free Video Dub, Free DVD Video Burner, Free DVD Video Converter and Free YouTube to MP3 Converter. Each tool is simple to use, with a selection of configuration options that correspond to the task it is supposed to perform.\n\nSome conversions are faster than others, but all of the ones we tested worked perfectly. The main Free Studio interface is quite slick, but the interfaces of the individual tools aren't so pretty. With so much functionality packed into one app, though, we're not going to complain.\n\nFree Studio - why make do with just one converter when you can have lots?!\n\nRecent changes\nThus we managed to include all 39 programs in the new interface for easy access to any of our applications, including two new converters: Free Video to Sony PlayStation Converter and Free Video to Nintendo Converter\nAll YouTube downloading programs now download all videos which caused some problems previously, including videos stored with RTMP protocol\nNotes\nFull list of software contained in Free Studio here. This program was previously known as Free Studio Manager.","torrent":{"xt":"urn:btih:261fe46a0e78a1f661a85224f5b2861e0972564f","amp;dn":"free+studio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"261fe46a0e78a1f661a85224f5b2861e0972564f","infoHashBuffer":{"type":"Buffer","data":[38,31,228,106,14,120,161,246,97,168,82,36,245,178,134,30,9,114,86,79]},"announce":[],"urlList":[]}}