{"title":"Cormega - Legal Hustle [2004] [Album] 320","uid":8030984,"size":142006304,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2895f293b89e96222406cda8e02bdc0756f626d4&amp;dn=Cormega+-+Legal+Hustle+%5B2004%5D+%5BAlbum%5D+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"icantstop","files":-1,"time":1358415510,"description":"This is all V0 VBR.\n\n\nCormega - Raw Forever [2011] [Album]\nCormega - Born And Raised [2009] [Album]\nCormega - The Testament [2005] [Album]\nCormega - Legal Hustle [2004] [Album]\nCormega - The True Meaning [2002] [Album]\nCormega - The Realness [2001] [Album]\n\n\n\n\n\n\nLoved by the streets as well as by critics, Cormega was the rare hardcore rapper to win praise from all directions. And while he never quite crossed over like some of his New York City peers, he maintained a respectable independence over the years nonetheless, self-releasing his work on the Legal Hustle label.\n\nBorn Cory McKay, Cormega came up as part of the early-'90s Queensbridge scene that also fostered such name acts as Nas and Mobb Deep, among many others (not to mention the preceding generation of artists affiliated with Marley Marl and the Juice Crew).\n\nHe made his debut in grand fashion, rapping alongside fellow Queensbridge MCs Foxy Brown and AZ on &quot;Affirmative Action&quot;, one of the highlights of Nas' 1996 album It Was Written. This alliance, which billed itself as the Firm, was short-lived for Cormega. He parted ways with the group before it recorded its one album, the largely unsuccessful Album.\n\nIt was no big loss for Cormega, though, as he signed to Def Jam and recorded his debut album, The Testament. That album sat in limbo for years, unfortunately, as did Cormega himself. With the exception of some guest appearances here and there, such as on the How to Be a Player soundtrack (1997), Mobb Deep's Murda Muzik (1999), and Nas' QB Finest compilation, Cormega's recording career was on hold while Def Jam twiddled its thumbs.\n\nIt wasn't until 2001 that Cormega made his album debut, releasing The Realness on his own Legal Hustle label. It didn't benefit from the promotional push that Def Jam could have given it, but The Realness made quite an impact among the hip-hop underground, where it was revered. Subsequent releases on Legal Hustle followed, including the eventual, long-awaited release of The Testament in 2005.","torrent":{"xt":"urn:btih:2895f293b89e96222406cda8e02bdc0756f626d4","amp;dn":"Cormega+-+Legal+Hustle+%5B2004%5D+%5BAlbum%5D+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2895f293b89e96222406cda8e02bdc0756f626d4","infoHashBuffer":{"type":"Buffer","data":[40,149,242,147,184,158,150,34,36,6,205,168,224,43,220,7,86,246,38,212]},"announce":[],"urlList":[]}}