{"title":"Game of Thrones and Philosophy Audio and Pdf","uid":8253485,"size":266767049,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2bf6083424edc257b827b8dc37562af00553c809&amp;dn=Game+of+Thrones+and+Philosophy+Audio+and+Pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hombrep","files":-1,"time":1363206072,"description":"Game of Thrones and Philosophy: Logic Cuts Deeper Than Swords\n\nAn in-depth look at the philosophical issues behind HBO's Game of Thrones television series and the books that inspired it\nGeorge R.R. Martin's New York Times bestselling epic fantasy book series, A Song of Ice and Fire, and the HBO television show adapted from it, have earned critical acclaim and inspired fanatic devotion. This book delves into the many philosophical questions that arise in this complex, character-driven series, including: Is it right for a &quot;good&quot; king to usurp the throne of a &quot;bad&quot; one and murder his family? How far should you go to protect your family and its secrets? In a fantasy universe with medieval mores and ethics, can female characters reflect modern feminist ideals?\n\nTimed for the premiere of the second season of the HBO Game of Thrones series\nGives new perspectives on the characters, storylines, and themes of Game of Thrones\nDraws on great philosophers from ancient Greece to modern America to explore intriguing topics such as the strange creatures of Westeros, the incestuous relationship of Jaime and Cersei Lannister, and what the kings of Westeros can show us about virtue and honor (or the lack thereof) as they play their game of thrones\nEssential reading for fans, Game of Thrones and Philosophy will enrich your experience of your favorite medieval fantasy series.\n\n\nProduct Details\nPaperback: 320 pages\nPublisher: Wiley; 1 edition (March 13, 2012)\nLanguage: English\nISBN-10: 1118161998\nISBN-13: 978-1118161999","torrent":{"xt":"urn:btih:2bf6083424edc257b827b8dc37562af00553c809","amp;dn":"Game+of+Thrones+and+Philosophy+Audio+and+Pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf6083424edc257b827b8dc37562af00553c809","infoHashBuffer":{"type":"Buffer","data":[43,246,8,52,36,237,194,87,184,39,184,220,55,86,42,240,5,83,200,9]},"announce":[],"urlList":[]}}