{"title":"Retreat (2011) DVD9 Retail","uid":8255449,"size":5340818797,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2f83bbc980214c82deac7e153c432c361b106ad1&amp;dn=Retreat+%282011%29+DVD9+Retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmanwf","files":3,"time":1363258353,"description":"Format: NTSC region free all copy protection removed\n\n\nStoryline\n\nIn a last-ditch attempt to save their failing marriage after the stillbirth of their first child, Kate, a journalist, and Martin, an architect, escape London for a retreat to the beautiful, yet remote and unpopulated Blackholme Island, which is off the west coast of Scotland. Fairweather Cottage is a place where they once shared a romantic holiday and the island holds fond memories of happier times. Kate and Martin arrive by boat, it's autumn and the rocky barren moors are blown by freezing winds and the before they've even settled in, the generator and CB radio communication start to fail. Their relationship is already fragile and anxieties are pushed higher when they lose all contact with the mainland and after a heavy storm, an injured man is washed up on the shore. Dressed in military fatigues and carrying a gun, the mysterious stranger regains consciousness and identifies himself as a British soldier called Private Jack Corman and he soon reveals that he carries a deadly message ... \n\n\nDVD9 UNTOUCHED\n\n\nALL MENUS INCLUDED AND ALL SPECIAL FEATURES INCLUDED\n\n\nAspect Ratio: Widescreen 2.35.1\n\n\nRuntime: 1 hour 30 minutes","torrent":{"xt":"urn:btih:2f83bbc980214c82deac7e153c432c361b106ad1","amp;dn":"Retreat+%282011%29+DVD9+Retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f83bbc980214c82deac7e153c432c361b106ad1","infoHashBuffer":{"type":"Buffer","data":[47,131,187,201,128,33,76,130,222,172,126,21,60,67,44,54,27,16,106,209]},"announce":[],"urlList":[]}}