{"title":"J.D. Robb - In Death 37 - Fantasy in Death","uid":8015141,"size":311104711,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:311fe3658f35c579dffb7cb399ee5c7729915aae&amp;dn=J.D.+Robb+-+In+Death+37+-+Fantasy+in+Death&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"metheguy","files":-1,"time":1358091143,"description":"J.D. Robb - Eve Dallas 37 - Fantasy in Death-viny\n\nBart Minnock, founder of the computer-gaming giant U-Play, enters his private playroom, and eagerly can't wait to lose himself in an imaginary world, to play the role of a sword-wielding warrior king, in his company's latest top-secret project, Fantastical.\n\nThe next morning, he is found in the same locked room, in a pool of blood, his head separated from his body. It is the most puzzling case Eve Dallas has ever faced, and it is not a game. . . .\n\nNYPSD Lieutenant Eve Dallas is having as much trouble figuring out how Bart Minnock was murdered as who did the murdering. The victim's girlfriend seems sincerely grief-stricken, and his quirky-but-brilliant partners at U-Play appear equally shocked. No one seemed to have a probÃ‚Â­lem with the enthusiastic, high-spirited millionaire. Of course, success can attract jealousy, and gaming, like any business, has its fierce rivalries and dirty tricks-as Eve's husband, Roarke, one of U- Play's competitors, knows well. But Minnock was not naive, and quite capable of fighting back in the real world as well as the virtual one.\n\nEve and her team are about to enter the next level of police work, in a world where fantasy is the ultimate seduction-and the price of defeat is death. . . . \t","torrent":{"xt":"urn:btih:311fe3658f35c579dffb7cb399ee5c7729915aae","amp;dn":"J.D.+Robb+-+In+Death+37+-+Fantasy+in+Death","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"311fe3658f35c579dffb7cb399ee5c7729915aae","infoHashBuffer":{"type":"Buffer","data":[49,31,227,101,143,53,197,121,223,251,124,179,153,238,92,119,41,145,90,174]},"announce":[],"urlList":[]}}