{"title":"POtHS - Biblical Times - 13 - Nest Family Ent - 12 Animated Old ","uid":8051812,"size":5348323942,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34d4386ef1fc7f1885b19eb4afba6e4f871e9976&amp;dn=POtHS+-+Biblical+Times+-+13+-+Nest+Family+Ent+-+12+Animated+Old+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1358872077,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nBiblical Times\n\n\n\nPOtHS - Biblical Times - 13 - Nest Family Ent - 12 Animated Old Testament Stories\n\n\n\nPOtHS says: This is good for all ages. The Characters are cartoons but the message is true.\n\nDescription:\n\nNest Family Entertainment - 12 Animated Old Testament Stories (DivX):\nAnimated Stories from the Bible (Nest 12 Animated Old Testament Stories) is a video series produced by Nest Family Entertainment in association with Rich Animation Studios.\n\nThe series is non-sectarian and features twelve beloved stories from the Hebrew Bible. The episodes have been reviewed by an Advisory Board including Rabbi Yechiel Eckstein (Founder of the International Fellowship of Christians and Jews), Nathan Hatch (president of Wake Forest University and previously provost of the University of Notre Dame), Reg Grant (professor of pastoral ministries of the Dallas Theological Seminary) and Christian apologist, Ed Decker.\n\nUnlike other animated series based on Bible stories, these programs are not based on modern characters interacting with Biblical figures, but rather provide dramatic retelling of the Bible stories themselves. The series was created to be a non-sectarian informative and educational tool to help parents, caregivers, and educators instill positive spiritual values and character traits to those in their care.\n\nThe individual programs within the series have earned multiple awards and endorsements including the family approved seal from the Dove Foundation, The Parent's Choice Foundation award, the &quot;Award of Excellence&quot; from the Film Advisory Board, the Director's Choice Award from Early Childhood News, KIDS FIRST!, and received the highest rating from the Practical Homeschooling Magazine.\n\nThe series was directed by Richard Rich, the ex-Disney director who also directed The Swan Princess trilogy, and other animated educational programs such as the Animated Hero Classics and the K10C: Kids' Ten Commandments.\n\nEpisodes:\n\nAbraham &amp; Isaac\n\nJoseph in Egypt\n\nSamuel The Boy Prophet\n\nElijah\n\nDaniel\n\nEsther\n\nMoses: From Birth to Burning Bush\n\nElisha: Man of God\n\nThe Story of Ruth\n\nDavid &amp; Goliath\n\nSolomon\n\nJoseph's Reunion\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:34d4386ef1fc7f1885b19eb4afba6e4f871e9976","amp;dn":"POtHS+-+Biblical+Times+-+13+-+Nest+Family+Ent+-+12+Animated+Old+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d4386ef1fc7f1885b19eb4afba6e4f871e9976","infoHashBuffer":{"type":"Buffer","data":[52,212,56,110,241,252,127,24,133,177,158,180,175,186,110,79,135,30,153,118]},"announce":[],"urlList":[]}}