{"title":"Coast to Coast AM February 01 2013","uid":8095819,"size":54904160,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3da25cd42d31b9000e0388132da82721d68a6a9e&amp;dn=Coast+to+Coast+AM+February+01+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1359831837,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-01-13\nHost: \tGeorge Noory\nGuests: \tOpen Lines, Christopher Maloney\n\nIn the first half, George Noory welcomed filmmaker Christopher Maloney for \n\na discussion on his research into cryptids and recent documentary, \n\nCryptotrip. The film examines how sightings of unknown creatures affect \n\nthe lives of those who witness them, Maloney explained. &quot;It changes their \n\nconcept of reality,&quot; he added. Maloney described his interview with Dover \n\nDemon witness William Bartlett, who expressed frustration for being known \n\nalmost exclusively for an 8-second encounter he had with a strange being \n\nwith glowing eyes. He shared a case from Papua New Guinea of a flying \n\ndinosaur-like creature about the size of a small airplane, as well as \n\nspeculated on why there is little physical evidence for cryptids. People \n\nrarely come across bear remains in the wild and it is quite possible that \n\nmembers of the Bigfoot species actually bury their dead, he noted.\n\nTwo witnesses featured in his film joined the conversation to share their \n\nown creature sightings. Robin Swope recalled an unforgettable moment in \n\nJuly 2001, when he watched a giant bird emerge from swamp land next to the \n\ngraveyard where he worked in Erie, Pennsylvania. Swope said the creature \n\nhad black feathers, a 17-ft wingspan, and appeared to be prehistoric-\n\nlooking. He compared it to an extinct condor. Next, Todd Neiss recounted \n\nhis incredible Bigfoot sighting from 1993, when he was working in Oregon \n\nas a combat engineer for the National Guard conducting explosives \n\ntraining. According to Neiss, as he was exiting the blast zone in a Humvee \n\nhe saw &quot;three very large jet black figures&quot; standing upright off in the \n\ndistance. They were covered in hair, wore no clothes, had arms that went \n\npassed their knees, and at least one stood 9-ft tall, he revealed. Neiss \n\nclaimed that other soldiers corroborated his sighting.\n\n-------------------------------------------------\n\nThe latter half of the show was devoted to Open Lines. Claire from San \n\nLuis Obispo, California, told George that she and her father would listen \n\nto Coast to Coast together when he was alive and often talk about making \n\ncontact with each other after death. She claimed to have successfully \n\ncommunicated with her departed father using ordinary table salt poured \n\nonto a plate. According to Claire, she wrote &quot;DAD R U OK?&quot; into the salt \n\nand upon checking it a week later found the &quot;R U&quot; and &quot;?&quot; scratched out to \n\nreveal the message &quot;DAD OK&quot;. James in Gulfport, Mississippi, shared a UFO \n\nsighting he had last August. James said he was outside enjoying a \n\nbeautiful evening when he looked up to see a large boomerang-shaped shadow \n\ncross the light of the moon. The mysterious flying object was silent, \n\nslow-moving, and could execute steep-angled turns that James guessed are \n\nnot possible for any known aircraft. John from New Hampshire reported on \n\nan all white wolf-like creature he spotted near his home, as well as \n\nphotographs his neighbors took of large footprints that may have been made \n\nby a Bigfoot species thought to roam New England.\n\nThe last half hour featured audio from a past interview with Larry Haber, \n\nattorney for the family of alleged time traveler John Titor.\n\nNews segment guest: Richard C. Hoagland\nWebsite(s):\n\n    cryptotrip.com\n\nVideo(s):\n\n    Cryptotrip\n\n","torrent":{"xt":"urn:btih:3da25cd42d31b9000e0388132da82721d68a6a9e","amp;dn":"Coast+to+Coast+AM+February+01+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da25cd42d31b9000e0388132da82721d68a6a9e","infoHashBuffer":{"type":"Buffer","data":[61,162,92,212,45,49,185,0,14,3,136,19,45,168,39,33,214,138,106,158]},"announce":[],"urlList":[]}}