{"title":"The Training of O------ToO-28393 Nikki Darling and Seth Storm W","uid":8178406,"size":669679904,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3f926c0f418538eebda26ac0a5c30aead0543348&amp;dn=The+Training+of+O%5C------ToO-28393+Nikki+Darling+and+Seth+Storm+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1361574478,"description":"The Training of OToO-28393 Nikki Darling and Seth Storm WMV\n\n\nWMV only. MP4 + Pics later.        \n        \nI Diligence\n - relates to principle Diligence\n There is much rope left to coil and she is way too slow. I demonstrate how to handle the lay of the rope and get the job done quickly. Her estimate to finish goes from 48 hours to 1.\n \nII the Infraction\n She chooses to break a rule and not slither in the shooting range. I exact an equitable punishment with a crop.\n \nIII the Wager\n - relates to object perform a slave dance\n She is tied into a bucket yoke, the buckets filled with rocks, and she begins repetitions of squats. It burns. She works on some balance exercises. She squats some more, it burns some more. I bet she cannot do 15 squats in 20 seconds - she wins the chance to re-negotiate a rule.\n \nIV the Principles\n - relates to the principles of her training\n She is ordered to think about the principles behind what she is doing in this basement while swallowing the gimp's hard cock. Punishing whacks to the nipple from the crop guide her in her delivery. Several painful tries later, she articulates three reasonably appropriate principles.\n \nV the Test\n - relates to Homework on the process of pain\n She is ordered to slowly fuck the gimp while a couple dozen clothespins are arranged in a zipper on her torso. She makes a hypothesis about endorphins based on her homework reading. We test her endorphin flow with a rip of the zipper, then order her to bounce her slutty ass on that cock will she comes over and over while reciting a screaming mantra of principles\n \nVI the Fuck\n - relates to Weakness in multi-tasking\n She is put into a painfully strict slave stock and fucked like a beast from behind while reading from a book about leathersex. She is quickly overwhelmed and frustrated. The tears stain the pages.\n \nVII the New Rule\n - relates to objective Slave Dance\n After composing herself, she dances for the cock before sucking it off to orgasm. She presents her ass for the load. She tells us what she has learned to date while the come drips down her thighs. \n\nScreens    &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=28393&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=28393&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:3f926c0f418538eebda26ac0a5c30aead0543348","amp;dn":"The+Training+of+O%5C------ToO-28393+Nikki+Darling+and+Seth+Storm+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f926c0f418538eebda26ac0a5c30aead0543348","infoHashBuffer":{"type":"Buffer","data":[63,146,108,15,65,133,56,238,189,162,106,192,165,195,10,234,208,84,51,72]},"announce":[],"urlList":[]}}