{"title":"Here Come the Black Helicopters: UN Global Governance and the Lo","uid":7974093,"size":1098301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fe8e13eda2eb48e1e18bceb065ec0a9006de9f1&amp;dn=Here+Come+the+Black+Helicopters%3A+UN+Global+Governance+and+the+Lo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mr.festus","files":1,"time":1356941526,"description":"Warning: Our national sovereignty and our freedom are in grave danger.\n \n\nStealthily advancing, the globalists and socialists at the United Nations, and in the United States itself, are trying to dilute our national sovereignty, undermine our democratic values, and mandate massive transfers of our wealth and technology to third world countries. They want to create a &quot;global governance&quot; where binding and critical decisions are made by the UN and international commissions, instead of by our elected officials.\n \n\nThey want to make us citizens of the world, and it means the end of annoying democratic institutions. Economic prosperity will be punished. All countries will be equal, rich and poor, large and tiny, free and enslaved. The Lilliputians will rule the giants.\n \n\nThe globalists dismiss democracy as obsolete and surrender us to rule by civil service experts: bureaucrats who are elected by nobody and accountable to no one. They want Congress to ratify a series of treaties and global initiatives that will give them control of the Internet, the seas, our carbon emission policies, our welfare system, and even outer space. They will hobble our ability to go to war and send our wealth to third world dictatorships.\n \n\nThey'll attack anyone who tries to stop them.\n \n\nTestifying before the Senate Foreign Relations Committee in May 2012, Hillary Clinton mocked those fighting for American sovereignty as &quot;the black helicopter crowd,&quot; belittling those who value freedom and US sovereignty. Ironically, Clinton's sarcastic putdown comes strikingly close to the truth.\n \n\nThey call it &quot;global governance.&quot; We call it the end of freedom. The homogenization of America. The day when the virtual black helicopters land.\n \n\nSo, watch out, the black helicopters are metaphorically on the way\n \n &lt;a href=&quot;\nhttp://thepiratebay.se/user/mr.festus/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/mr.festus/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3fe8e13eda2eb48e1e18bceb065ec0a9006de9f1","amp;dn":"Here+Come+the+Black+Helicopters%3A+UN+Global+Governance+and+the+Lo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fe8e13eda2eb48e1e18bceb065ec0a9006de9f1","infoHashBuffer":{"type":"Buffer","data":[63,232,225,62,218,46,180,142,30,24,188,235,6,94,192,169,0,109,233,241]},"announce":[],"urlList":[]}}