{"title":"Ellsworth Bunker: Global Troubleshooter","uid":8225666,"size":3152849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:410dc9268947c2b90b2eeb430bbcf37b1a65c7f4&amp;dn=Ellsworth+Bunker%3A+Global+Troubleshooter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mdusanjay","files":-1,"time":1362592519,"description":"Ellsworth Bunker: Global Troubleshooter, Vietnam Hawk By Howard B. Schaffer\n2003 | 416 Pages | ISBN: 0807828254 | PDF | 3 MB\n\n\n\nIn this first biography of Ellsworth Bunker (1894-1984), Howard Schaffer traces the life of one of America's foremost diplomats of the postwar era from his formative years as a successful businessman and lobbyist through a long career in international affairs.\nNamed ambassador to Argentina by Harry Truman in 1951, Bunker went on to serve six more presidents as ambassador to Italy, India, Nepal, and Vietnam and on special negotiating missions. A widely recognized &quot;hawk,&quot; Bunker helped shape U.S. policy in Vietnam during his six-year Saigon posting. Using letters Bunker wrote to his wife as well as recently declassified messages he exchanged with Henry Kissinger, Schaffer examines how Bunker promoted the war effort and how he regarded his mission. After leaving Saigon on his seventy-ninth birthday, Bunker became a key figure in the treaty negotiations, spanning three presidencies, that radically changed the operation and defense of the Panama Canal.\nHighlighting Bunker's views on the craft of diplomacy, Schaffer paints a complex picture of a man who devoted three decades to international affairs and sheds new light on post-World War II American diplomacy. ","torrent":{"xt":"urn:btih:410dc9268947c2b90b2eeb430bbcf37b1a65c7f4","amp;dn":"Ellsworth+Bunker%3A+Global+Troubleshooter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"410dc9268947c2b90b2eeb430bbcf37b1a65c7f4","infoHashBuffer":{"type":"Buffer","data":[65,13,201,38,137,71,194,185,11,46,235,67,11,188,243,123,26,101,199,244]},"announce":[],"urlList":[]}}