{"title":"Skyfall 2012 [1080P] BluRay x264 Upload By [Spectre]","uid":8094031,"size":10555752370,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:454f12bba3d2a36437b48c21f4eb351827ea13cd&amp;dn=Skyfall+2012+%5B1080P%5D+BluRay+x264+Upload+By+%5BSpectre%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spectre07","files":1,"time":1359789165,"description":"Skyfall is the twenty-third James Bond film produced by Eon Productions. It was distributed by MGM and Sony Pictures Entertainment in 2012.[2] It features Daniel Craig's third performance as James Bond, and Javier Bardem as Raoul Silva, the film's antagonist. The film was directed by Sam Mendes and written by Neal Purvis, Robert Wade and John Logan.\n\nThe film centres on Bond investigating an attack on MI6; the attack is part of a plot by former MI6 operative Raoul Silva to humiliate, discredit and kill M as revenge against her for betraying him. The film sees the return of two recurring characters to the series after an absence of two films: Q, played by Ben Whishaw, and Eve Moneypenny, played by Naomie Harris. Skyfall is the last film of the series for Judi Dench, who played M, a role that she had played in the previous six films. The position is subsequently filled by Ralph Fiennes' character, Gareth Mallory.\n\nMendes was approached to direct the film after the release of Quantum of Solace in 2008. Development was suspended when MGM encountered financial troubles and did not resume until December 2010; during this time, Mendes remained attached to the project as a consultant. The original screenwriter, Peter Morgan, left the project during the suspension. When production resumed, Logan, Purvis, and Wade continued writing what became the final version of the script. Filming began in November 2011 and primarily took place in the United Kingdom, China and Turkey.\n\nSkyfall premiered in London at the Royal Albert Hall on 23 October 2012 and was released in the United Kingdom on 26 October 2012 and the United States on 9 November 2012. It was the first James Bond film to be screened in IMAX venues, although it was not filmed with IMAX cameras. The film's release coincided with the 50th anniversary of the Bond series, which began with Dr. No in 1962. Skyfall was positively received by critics and at the box office, becoming the 14th film, as well as the first Bond film, to cross the $1 billion mark worldwide. It is thus far the 8th highest grossing film of all time and has become the highest-grossing film in the UK, the highest-grossing film in the Bond series, the highest-grossing film worldwide for both Sony Pictures and MGM and the third highest-grossing film of 2012. The film is currently nominated for five Academy Awards, eight British Academy Film Awards and won the Golden Globe Award for Best Original Song for Adele's theme song. The film also won a Screen Actors Guild Award.","torrent":{"xt":"urn:btih:454f12bba3d2a36437b48c21f4eb351827ea13cd","amp;dn":"Skyfall+2012+%5B1080P%5D+BluRay+x264+Upload+By+%5BSpectre%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"454f12bba3d2a36437b48c21f4eb351827ea13cd","infoHashBuffer":{"type":"Buffer","data":[69,79,18,187,163,210,163,100,55,180,140,33,244,235,53,24,39,234,19,205]},"announce":[],"urlList":[]}}