{"title":"Byzantium Linux v0.3a","uid":8306969,"size":389123968,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:45dc319aac76135ab707dff3b37d101208c39284&amp;dn=Byzantium+Linux+v0.3a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"warehouse23","files":3,"time":1364396818,"description":"ANNOUNCING BYZANTIUM LINUX V0.3a (Beach Cat)\nApproved for: GENERAL RELEASE, DISTRIBUTION UNLIMITED\n\nNOTE: This is Byzantium Linux for x86-compatible laptops and desktops. This release is not compatible with the Raspberry Pi.  We just started work on that port.\n\nProject Byzantium, a working group of HacDC (http://hacdc.org/) is proud to announce the release of v0.3 alpha of Byzantium Linux, a live distribution of Linux which makes it fast and easy to construct an ad-hoc wireless mesh network which can augment or replace the current telecommunications infrastructure in the event that it is knocked offline (for example, due to a natural disaster) or rendered untrustworthy (through widespread surveillance or disconnection by hostile entities).  Byzantium Linux is designed to run on any x86 computer with at least one 802.11 a/b/g/n wireless interface.  Byzantium can be burned to a CD- or DVD-ROM (the .iso image is around 372 megabytes in size), booted from an external hard drive, or can even be installed in parallel with an existing operating system without risk to the user's data and software.  Byzantium Linux will act as a node of the mesh and will automatically connect to other mesh nodes and act as an access point for wifi-enabled mobile devices.\n\nThis release is unique because it is based upon the work we did in New York City in the weeks following Hurricane Sandy in late 2012.  We were asked by FEMA (Federal Emergency Management Agency) to help restore the telecommunications network in the neighborhood of Red Hook, and the design requirements were dictated by the needs of the community as described by leaders and elders.  v0.3a constitutes a formalization of those requirements rather than the ad-hoc build we deployed in Red Hook.\n\nTHIS IS AN ALPHA RELEASE!  Do NOT expect Byzantium to be perfect.  Some features are not ready yet, others need work.  Things are going to break in weird ways and we need to know what those ways are so we can fix them.  Please, for the love of LOLcats, do not deploy Byzantium in situations where lives are at stake.\n\nFEATURES:\n- Binary compatible with Slackware-CURRENT.  Existing Slackware packages can be converted with a single command.\n- Automatically configures itself on boot.  There is no longer a need for a control panel.\n- Can act as a gateway to the Internet if a link is available (via Ethernet or tethered smartphone).\n- Linux kernel v3.4.4\n- Drivers for dozens of wireless chipsets\n- KDE Trinity r14.0.0 (Development)\n- LXDE (2011 release of all components)\n- Mplayer v4.5.1\n- GCC v4.5.2\n- Perl v5.14\n- Python v2.7.3\n- Firefox v13.0.1\n- X.org\n\nSYSTEM REQUIREMENTS (to use)\n- Minimum of 1GB of RAM (512MB without copy2ram boot option)\n- i586 CPU or better\n- CD- or DVD-ROM drive\n- BIOS must boot removable media\n- At least one (1) 802.11 a/b/g/n interface\n\nSYSTEM REQUIREMENTS (for persistent changes)\n- The above requirements to use Byzantium\n- 2+GB of free space on thumbdrive or harddrive\n\nWHAT WE NEED:\n- Developers.\n- Developers!\n- DEVELOPERS!\n- No more Bill Ballmer impersonations.\n- People running Byzantium to find bugs.\n- People reporting bugs on our Github page (https://github.com/Byzantium/Byzantium/issues).  We can't fix what we don't know about!\n- Patches.\n- People booting Byzantium and setting up small meshes (2-5 clients) to tell us how well it works for you with your hardware.  We have a hardware compatibility list on our wiki that needs to be expanded.\n- Help translating the user interface.  We especially need people fluent in dialects of Chinese, Arabic, Farsi, and Urdu.\n- Help us write and translate documentation.\n\nHomepage: http://project-byzantium.org/","torrent":{"xt":"urn:btih:45dc319aac76135ab707dff3b37d101208c39284","amp;dn":"Byzantium+Linux+v0.3a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45dc319aac76135ab707dff3b37d101208c39284","infoHashBuffer":{"type":"Buffer","data":[69,220,49,154,172,118,19,90,183,7,223,243,179,125,16,18,8,195,146,132]},"announce":[],"urlList":[]}}