{"title":"night racer  pc game  2013","uid":7975740,"size":66238620,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:46aac0f4c7cdaea782a6d1a9b3023d1602598dcf&amp;dn=night+racer++pc+game++2013+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"akonsharon9","files":1,"time":1356977269,"description":"1. System Requirements\nThese games were designed to perform on systems with the following specifications (minimum): \nWindows XP SP2/Vista/7\nPentium 4\n1 GB RAM\n12x CD-ROM\nDirectX 9 compatible 3D graphics card with 64MB RAM\nMouse and Keyboard\nSpeakers or headphones\nMac OSX 10.4.x\nIntel\n1 GB RAM\n12x CD-ROM\nMouse and Keyboard\nSpeakers or headphones\n\n\n\n\n2. Troubleshooting\nI think my CD is blank. What should I do?\nPlease make sure that you are inserting the CD the correct way. The label side should be facing upwards.\nIs it possible that my CD contains a virus?\nNo, all programs have been fully scanned and are free of viruses.\nThe games are running very slowly.\nIf the games are running slowly, please try the following:\nEnsure that your video settings are set to 32 bit colour. Open the Display Settings icon in the control panel, then select the 32 Bit Colour setting.\nClose all applications before launching the game.\nTo resolve slow CDRom performance, you may copy the game folder to your hard disk and run it directly.\nDirectX Problems:\nDirectXÂ® 9.0c or later must be installed on your computer before you can play. You can install DirectX by downloading the software from Microsoft Windows Update at http://windowsupdate.microsoft.com. If you encounter video or sound problems when using DirectX, go to http://support.microsoft.com for the latest troubleshooting information. You should also obtain the latest DirectX-compatible drivers from your video or sound card manufacturer.\n 3. Health Warnings\nSome people experience epileptic seizures when viewing flashing lights or patterns in our daily environment. These people may experience epileptic seizures when watching TV pictures or playing computer games. Even players who have never had any seizures may nonetheless have an undetected epileptic condition. Consult your doctor before playing computer games if you, or someone in your family, has an epileptic condition. Stop the game immediately should you experience any of the following symptoms during play:\ndizziness\naltered vision\neye or muscle twitching\nmental confusion\nloss of awareness of your surroundings\ninvoluntary movements and/or convulsions","torrent":{"xt":"urn:btih:46aac0f4c7cdaea782a6d1a9b3023d1602598dcf","amp;dn":"night+racer++pc+game++2013+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46aac0f4c7cdaea782a6d1a9b3023d1602598dcf","infoHashBuffer":{"type":"Buffer","data":[70,170,192,244,199,205,174,167,130,166,209,169,179,2,61,22,2,89,141,207]},"announce":[],"urlList":[]}}