{"title":"Deception S01E09 HDTV x264 LOL mp4","uid":8220497,"size":271162508,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:49c882d7eb3b084a6e73f4b3cd270346b7a40bf0&amp;dn=Deception+S01E09+HDTV+x264+LOL+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Thhaque","files":1,"time":1362467066,"description":"Deception\n\nGenre: Drama\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Liz Heldens\nCast: Meagan Good, Tate Donovan, Katherine LaNasa, Laz Alonso, Marin Hinkle, Wes Brown, Ella Rae Peck, Victor Garber, David Gelles\n\n.: Plot :.\nWhen wealthy socialite and notorious party girl Vivian Bowers is found dead of an overdose, no one is really surprised. The heiress to the Bowers pharmaceutical empire has been tabloid fodder for years: wild, pretty, privileged... and now dead at the age of 32. But for FBI agent Will Moreno (Laz Alonso), things don't add up with this suspicious dynasty. Convinced that the troubled girl's death was a homicide, he has a clever plan to get to the truth. Her name is Detective Joanna Locasto (Meagan Good). Twenty years ago, she was Vivian's best friend, having grown up in the Bowers' home. And when she appears at Vivian's funeral, the family re-embraces her and no one is the wiser. Joanna quickly begins to uncover dark secrets and clues about why Vivian's life was very much in danger. At the same time, she rekindles an old romantic relationship and rediscovers the allure of the luxurious lifestyle she once knew. She's about to see once again just how the other half lives... and dies.\n","torrent":{"xt":"urn:btih:49c882d7eb3b084a6e73f4b3cd270346b7a40bf0","amp;dn":"Deception+S01E09+HDTV+x264+LOL+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c882d7eb3b084a6e73f4b3cd270346b7a40bf0","infoHashBuffer":{"type":"Buffer","data":[73,200,130,215,235,59,8,74,110,115,244,179,205,39,3,70,183,164,11,240]},"announce":[],"urlList":[]}}