{"title":"Neverland (2011) Mini Serie 720P HQ AC3 DD5.1 ENg NL SUBS BB","uid":7969668,"size":4330426681,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4a67cf5a60cf4daa3fe452a40ee23a82ab8f3a6c&amp;dn=Neverland+%282011%29+Mini+Serie+720P+HQ+AC3+DD5.1+ENg+NL+SUBS+BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1356796177,"description":"Neverland (2011) Mini Serie 720P HQ AC3 DD5.1 ENg NL SUBS BB\n\n\n\nVerenigde Staten\nAvontuur / Fantasy\n180 minuten (miniserie, 2 delen)\n\ngeregisseerd door Nick Willing\nmet Rhys Ifans, Charlie Rowe en Bob Hoskins\n\nLonden 1906. Peter en zijn bende zakkenrollende weeskinderen maken de straten van de stad onveilig. De jongens werken voor Jimmy (Rhys Ifans) die de jongens uit hun hopeloze leven heeft gered en als een soort van criminele mentor fungeert. De inbraak bij juwelier Harbottles moet een grote buit opleveren en een grote buit betekent veel geld en een mogelijke terugkeer naar waar hij ooit stond op de maatschappelijke ladder. Jimmy heeft zo zijn redenen om de jongens daar niet bijte betrekken. Om te laten zien dat hij niet bang is en zo'n klus best aankan, besluit Peter de inbraak toch samen met zijn vrienden uit te voeren. Terwijl ze hun buit bijeen schrapen duikt Jimmy op om het echte doel van de roof te halen, een magische glazen bol waar hij een invloedrijke koper voor heeft. De bol is met recht magisch, want hij slokt onverwacht Jimmy en Peter's ploeg op, Peter verward achterlatend. Om te ontdekken wat er met zijn vrienden is gebeurd volgt hij het spoor van de bol en zo ontdekt hij dat de bol een poort is naar een wereld in een andere dimensie. Een hele bijzondere wereld, Neverland...\n\nSlimme jongens, piraten, indianen, krokodillen en een man luisterend naar de naam James Hook, dat klinkt allemaal redelijk bekend. Neverland toont ons een andere, wat meer duistere kijk op het bekende verhaal van Peter Pan. Treedt binnen in deze bijzondere wereld die er nieuw uitziet, maar wel met een groot aantal herkenbare elementen. Het is ook nog eens een lekker lange film, dus maak een paar uur vrij en geniet...\n\n\t\nEnglish\n\nRaised on the streets of turn-of-the century London, orphaned Peter and his pals survive by their fearless wits as cunning young pickpockets. Now, they've been rounded up by their mentor Jimmy Hook to snatch a priceless, some believe, magical treasure which transports them to another world. Neverland is a realm of white jungles and legendary mysteries of eternal youth, where unknown friends and enemies snatched from time welcome the new travelers with both excitement and trepidation. These groups include a band of 18th century pirates led by the power-mad Elizabeth Bonny, and the Native American Kaw tribe led by a Holy Man, which has protected the secret of the tree spirits from Bonny and her gang for ages, and that has meant war. But as the fight to save this strange and beautiful world becomes vital, Hook, Peter, and the ragamuffin lost boys consider that growing old somewhere in time could be less important than growing up, right here in their new home called Neverland. \n\n\n\nSOURCE..........: Neverland 2011-HDTV XvidHD 720p-NPW (2 delen)\nSIZE............: 4.00GB\nFORM............: AVI\nVIDEO CODEC.....: XVID\nBITRATE.........: 3395 Kbit/s\nWIDTH &amp; HEIGHT..: 1280 X 720\nFRAMES/S........: 23.976 Fps\nAUDIO...........: English\nAUDIO CODE......: AC3\nBITRATE.........: 384kbps\nBITRATE MODUS...: CBR\nCHANNELS........: 6\nSAMPLING........: 48.0 kHz\nSubtitles.......: Dutch/English srt\nCover en label zijn meegepost.\t\nHet betreft hier 2 divx 2GB\n\nThanks Hannes voor deze mooie Divx\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/73653&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/73653&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1720619&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1720619&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4a67cf5a60cf4daa3fe452a40ee23a82ab8f3a6c","amp;dn":"Neverland+%282011%29+Mini+Serie+720P+HQ+AC3+DD5.1+ENg+NL+SUBS+BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a67cf5a60cf4daa3fe452a40ee23a82ab8f3a6c","infoHashBuffer":{"type":"Buffer","data":[74,103,207,90,96,207,77,170,63,228,82,164,14,226,58,130,171,143,58,108]},"announce":[],"urlList":[]}}