{"title":"POtHS - Creation - 59 - The Evolution Of A Creationist","uid":8020732,"size":5828070476,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a7304c19d64550951def5cc645d6bf95669ae20&amp;dn=POtHS+-+Creation+-+59+-+The+Evolution+Of+A+Creationist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1358195305,"description":"\n\nPOtHS - Creation 59\n\nThe Evolution Of A Creationist\n\n\n\n\nPOtHS Comments on This one......... There is truth here for all ages and beliefs. If Darwin was wrong...........then the Schools have been intentionally lying to our Children. If the schools teach Darwinism which says there is NO CHRIST. Then they are of The Anti-Christ. Public Schools teaching books CHANGE EVERY YEAR. The Bible never changes. So where is truth??? In Evolution Theories??? If you believe in Evolution you are denying The Father, The Son and The Holy Spirit of the Praise They are entitled too for making everything you understand and can see and more than that, everything you don't understand and can't see. If you have never thanked the CREATOR for his Creation now is your chance to thank Him.\n\nDescription:\n\nPOtHS - Creation - 59 - The Evolution Of A Creationist\n\nThe Evolution Of A Creationist:\n\nThe Evolution Of A Creationist - parts 1-4:\nIt is important for all Christians today to understand not only the &quot;faith system&quot; behind evolution, but also the ramifications of evolutionary thought on such issues as abortion, same-sex union, euthanasia, and moral relativism.\n\nWith the combination of the fascinating lectures and the workbook, you will find this Evolution of a Creationist DVD series to be educational, thought provoking and even life changing.\n\nThe Evolution of a Creationist is an exciting, entertaining and challenging lecture series by Dr. Jobe Martin, presenting key ideas and concepts from his book of the same name. Dr. Martin discusses some of the Incredible Creatures that Defy Evolution as well as the many facts and findings in our world and our universe that evolutionists are unable to explain.\n\nThis four-part lecture is presented in front of a live audience, with photos, charts and video clips interspersed to aid in understanding. A 70-page workbook accompanies each video set, with fill-in-the-blank questions to stimulate discussion and comprehension. You can make your own copies of the workbook or purchase additional copies separately. Each part of the lecture is approximately one hour long, making the series perfect for Sunday School classes, Sunday evening services, Home Bible Studies, home schooling and small group meetings.\n\n\n\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n\nThe Entire Collection can be found here: &lt;a href=&quot; http://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;\n\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n","torrent":{"xt":"urn:btih:4a7304c19d64550951def5cc645d6bf95669ae20","amp;dn":"POtHS+-+Creation+-+59+-+The+Evolution+Of+A+Creationist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a7304c19d64550951def5cc645d6bf95669ae20","infoHashBuffer":{"type":"Buffer","data":[74,115,4,193,157,100,85,9,81,222,245,204,100,93,107,249,86,105,174,32]},"announce":[],"urlList":[]}}