{"title":"South of Broad (547)","uid":8088352,"size":1583175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bf729a5357594cf03179bd474af0ef82fab8987&amp;dn=South+of+Broad+%28547%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"geo358","files":4,"time":1359660069,"description":"Pat Conroy's novel South of Broad\n\nThe publishing event of the season: The one and only Pat Conroy returns, with a big, sprawling novel that is at once a love letter to Charleston and to lifelong friendship.\n\nAgainst the sumptuous backdrop of Charleston, South Carolina, South of Broad gathers a unique cast of sinners and saints. Leopold Bloom King, our narrator, is the son of an amiable, loving father who teaches science at the local high school. His mother, an ex-nun, is the high school principal and a well-known Joyce scholar. After Leo's older brother commits suicide at the age of thirteen, the family struggles with the shattering effects of his death, and Leo, lonely and isolated, searches for something to sustain him. Eventually, he finds his answer when he becomes part of a tightly knit group of high school seniors that includes friends Sheba and Trevor Poe, glamorous twins with an alcoholic mother and a prison-escapee father; hardscrabble mountain runaways Niles and Starla Whitehead; socialite Molly Huger and her boyfriend, Chadworth Rutledge X; and an ever-widening circle whose liaisons will ripple across two decades-from 1960s counterculture through the dawn of the AIDS crisis in the 1980s. \n\nThe ties among them endure for years, surviving marriages happy and troubled, unrequited loves and unspoken longings, hard-won successes and devastating breakdowns, and Charleston's dark legacy of racism and class divisions. But the final test of friendship that brings them to San Francisco is something no one is prepared for. South of Broad is Pat Conroy at his finest; a long-awaited work from a great American writer whose passion for life and language knows no bounds.","torrent":{"xt":"urn:btih:4bf729a5357594cf03179bd474af0ef82fab8987","amp;dn":"South+of+Broad+%28547%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf729a5357594cf03179bd474af0ef82fab8987","infoHashBuffer":{"type":"Buffer","data":[75,247,41,165,53,117,148,207,3,23,155,212,116,175,14,248,47,171,137,135]},"announce":[],"urlList":[]}}