{"title":"Interracial.Anal.Milfs.XXX.DVDRiP.x264-PORNOLATiON","uid":8042570,"size":1695801266,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4d479cc4f63c2dccaa221677bbf08f5f9718b7a7&amp;dn=Interracial.Anal.Milfs.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1358671875,"description":"Interracial.Anal.Milfs.XXX.DVDRiP.x264-PORNOLATiON\n\nNina Hartley, Dana DeArmond, Flower Tucci, Sean Michaels, Alana Evans, Cece Stone, Gabriel Dalessandro, Anjanette Astoria, Bob\n\nHot-Ass Cougars From Sean's Evil Angel Archives! Suave, studly Sean Michaels has parlayed his legendary XXX status into a variety of popular niche productions that push social taboos into the realm of pure erotic excitement. 'Interracial Anal MILFs' is the performer/director's newest compilation of vignettes exploring the dynamic of insatiable white ladies who deeply crave enormous black cock. First are Flower Tucci and Alana Evans, a couple of womanly, big-assed blondes. They oil up their huge behinds, then take turns gagging on Sean's towering shaft. Each of these voluptuous booty whores gets anally stuffed in a nasty session of lewd black-on-white sodomy and female ejaculation! Next, refined blonde MILF Nina Hartley seduces her evening escort, thinking her husband is away, but when he returns unexpectedly, the mature sexpot gets it from both ends in a twisted psychosexual three-way - and cuckolded Gabriel downs a glass of the black man's sperm! Tanned, big-assed nurse Anjanette Astoria services patient Sean's needs with some perverse backdoor therapy and a creamy oral cum shot. Brunette cutie Cece Stone rides Sean while her humiliated spouse watches helplessly. Shamelessly, Cece takes a cum facial, then makes her hubby lick Sean's semen from her tits! Lastly, slender brunette Dana DeArmond seduces Sean as her husband watches with a hidden camera. Dana takes a deep, sensuous anal fucking for her sneaky hubby's entertainment. Not just any cock can satisfy a real woman's asshole - and these 'Interracial Anal MILFs' are experienced and horny enough to demand the very best. Sean gives 'em what they need.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7rg9unbxb2uyy2xykr8t.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7rg9unbxb2uyy2xykr8t.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=fm7jxepf26pydba5d19y.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=fm7jxepf26pydba5d19y.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:4d479cc4f63c2dccaa221677bbf08f5f9718b7a7","amp;dn":"Interracial.Anal.Milfs.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d479cc4f63c2dccaa221677bbf08f5f9718b7a7","infoHashBuffer":{"type":"Buffer","data":[77,71,156,196,246,60,45,204,170,34,22,119,187,240,143,95,151,24,183,167]},"announce":[],"urlList":[]}}