{"title":"Focus Photoeditor v6.5.1.0 with Key [TorDigger]","uid":8048343,"size":39056499,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4f73787175717b02aaf784f8ee00f8e092059441&amp;dn=Focus+Photoeditor+v6.5.1.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":10,"time":1358801604,"description":"Focus Photoeditor\n\nFocus Photoeditor is a powerful, easy-to-use image editor, that can be used to improve and correct all kind of digital photos and to produce graphics for the web, the home and the office. You can acquire digital pictures from file, from other applications, or with the help of a scanner or a digital camera and start to work with them immediately. Try the different automatic improvement functions and correct your photos in a matter of seconds. With its many image regulation abilities, that improve the pictures appearance, without loosing any quality, Focus can be used as a strong and professional tool by both beginner and advanced photographers.\n\nMain features:\n\n- Loads fast, letting you immediately start to edit your pictures\n- Does not eat up memory: memory consumption does not grow with the number of layers or the number of files opened\n- Supports over 100 digital camera RAW formats\n- Has the best set of Automatic Photo Corrections you could ask for\n- Uses High Quality photo correction algorithms, which are also finely tuned\n- Has a very easy to use Batch Processor with undo capabilities\n- Supports powerful ways of creating Selections and has separate undo history for them\n- Features great control over precise editing\n- Provides many options to save and export files (optimized size and preview for all formats)\n- Has a very comfortable picture browser: lets you rotate, make backup copies, copy &amp; paste, print picture files in a sheet\n- Offers many extras, like a web-album builder\n- Improved interface\n- Added support for newest cameras\n- Improved speed of several editing and displaying operations\n- Added some photo corrections and improved existing ones\n- Added &quot;Auto Crop&quot;\n- Paint Engine was improved, now follows the mouse movements more smoothly and precisely\n- Improved &quot;Quick Fix&quot; correction\n- Added Automatic and Manual &quot;Dynamic Range&quot; Correction\n- Corrected many bugs\n- Improved many other features\n\nSupported OS:\n\nWindows All\n\nHomepage: http://www.focusphotoeditor.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register program with given name and serial.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:4f73787175717b02aaf784f8ee00f8e092059441","amp;dn":"Focus+Photoeditor+v6.5.1.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f73787175717b02aaf784f8ee00f8e092059441","infoHashBuffer":{"type":"Buffer","data":[79,115,120,113,117,113,123,2,170,247,132,248,238,0,248,224,146,5,148,65]},"announce":[],"urlList":[]}}