{"title":"Adventures at Trebizon","uid":8036841,"size":127669559,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fe47e5d520a4dc382c028f9f278b8faf054947d&amp;dn=Adventures+at+Trebizon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1358535086,"description":"FIRST TERM AT TREBIZON\nFresh from a London comprehensive, Rebecca Mason is plunged into life at Trebizon, the famous boarding school for girls. Lonely and anxious to prove herself, Rebecca decides to write something for the school magazine. But the piece that appears is not the one she intended and she unwittingly triggers a row which rocks the school... It's a good thing Rebecca has some new friends on her side!\n\nSECOND TERM AT TREBIZON\nRight from the start of Rebecca Mason's second term at Trebizon School, Tish Anderson behaves most oddly. Why is she suddenly so keen for Sue Murdoch to compete for the Music Scholarship? Then When Sue's secret ambition to become captain of the hockey team looks close to being fulfilled, Tish adamantly opposes her. With her two best friends at loggerheads, Rebecca is caught in a real dilemma.\n\nSUMMER TERM AT TREBIZON\nRebecca has never been very good at maths. But now, if she doesn't improve, she'll go into the B form and be separated from Tish, Sue and the rest of her friends. So why does Max, the handsome new maths teacher, ignore her and devote his attention instead to Roberta Jones? And who stole the money raised for charity from the sponsored surfing competition?","torrent":{"xt":"urn:btih:4fe47e5d520a4dc382c028f9f278b8faf054947d","amp;dn":"Adventures+at+Trebizon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe47e5d520a4dc382c028f9f278b8faf054947d","infoHashBuffer":{"type":"Buffer","data":[79,228,126,93,82,10,77,195,130,192,40,249,242,120,184,250,240,84,148,125]},"announce":[],"urlList":[]}}