{"title":"The Professionals (Western) {Marvin, Ryan, Lancaster, Palance} [","uid":8017792,"size":764965568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:51295354c3126ff8075223a9871b55043166dda1&amp;dn=The+Professionals+%28Western%29+%7BMarvin%2C+Ryan%2C+Lancaster%2C+Palance%7D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1358135987,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0060862/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0060862/?ref_=fn_al_tt_1&lt;/a&gt;\n\nStoryline\n\nA rich Texan, J.W. Grant, selects three men and invites them to his private train to offer them a contract: Rescue his wife who has been kidnapped by a Mexican revolutionary. The leader of the men, Rico, decides they would be a better team if Grant would hire one more man, an explosives expert. Grant quickly agrees and soon the four are off to complete the contract. However, while on the trail, they discover some interesting facts, like has Mrs. Grant 'really' been kidnapped?\n\n\nUser Review\n\nThis is a great western... at a time when Hollywood audiences were less interested in westerns. It also developed the theme of moral ambiguity found in the Sergio Leone/Clint Eastwood &quot;Man With No Name&quot; westerns and The Wild Bunch. Lee Marvin (fresh from his Oscar performance in Cat Ballou) shows once again how strong an actor he is ... and how well he matches up with Burt Lancaster (with his oscar for Elmer Gantry six years earlier). Jack Palance is once again a villain with a winning smile. In addition to the excellent acting and exciting action scenes, the film makes good use of the horses, the train, the weaponry ... as well as the subplot about the old revolutionaries meeting once again after many years. In the end, the plot has a nice twist ... and our heroes must make a moral choice. The film compares favorably to the best John Ford westerns, plus it has colorful scenery and a great sense of humor. You should definitely watch the &quot;widescreen&quot; version if you can. Richard Brooks was nominated for Oscars for directing and writing.\n","torrent":{"xt":"urn:btih:51295354c3126ff8075223a9871b55043166dda1","amp;dn":"The+Professionals+%28Western%29+%7BMarvin%2C+Ryan%2C+Lancaster%2C+Palance%7D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51295354c3126ff8075223a9871b55043166dda1","infoHashBuffer":{"type":"Buffer","data":[81,41,83,84,195,18,111,248,7,82,35,169,135,27,85,4,49,102,221,161]},"announce":[],"urlList":[]}}