{"title":"Coast to Coast AM February 28 2013","uid":8209107,"size":56464324,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5143b784542af17ab60b00f65ed74509bc94efce&amp;dn=Coast+to+Coast+AM+February+28+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1362192273,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-28-13\nHost: \tGeorge Noory\nGuests: \tLinda Moulton Howe, Robert Hazen\n\nInvestigative reporter Linda Moulton Howe provided an update on the mysterious boom phenomenon of the past two years and its possible connection to &quot;sound weapons.&quot; She also discussed Melba Ketchum's five-year study of hair, tissue, blood and saliva samples collected from Bigfoot investigators, and oddities surrounding the Martian moon Phobos.\n\nA medically discharged Army veteran, using the pseudonym &quot;Peter Jones,&quot; revealed to Linda insights that he learned from a soldier who had recently returned from Iraq and claimed to have deployed a sound weapon to take down a 'high value target.' Jones said he was shown photos, from the aftermath of the weapon's use, which depicted a perfectly spherical hole, about the size of a basketball, blasted through the wall of an Iraqi home. Eerily, photos from inside the home showed an armchair covered in blood and body tissues as well as a solid human heart behind the chair. Jones surmised that the weapon &quot;essentially liquified&quot; the target except for his heart. More here. Linda also spoke with Jones about his observations of low-flying military helicopters maneuvering in search patterns following reports of these mystery booms. Further details.\n\nNext, Linda shared her interview with Melba Ketchum concerning the publication of her extensive study on potential Bigfoot DNA. She lamented that all of the major scientific journals rejected the paper and asserted that their refusal to publish it was because they simply could not believe the findings, regardless of the strength of the research. On what the DNA study suggests about Bigfoot, Ketchum said &quot;all we know is they have a human maternal lineage and they have their progenitor male that is something that was not seen before.&quot; Oddly, she said that, of primates, this mystery DNA is closer to the lemurs than apes. To that end, she noted that there was a lemur species, now extinct, that was between 400 and 500 pounds and had opposable thumbs. More.\n\nIn her final report of the evening, Linda talked to Dr. Jay Melosh of Perdue University regarding the peculiarities of the Martian moon Phobos. He explained that Phobos' composition is akin to a &quot;primitive meteorite&quot; and that it appears to have been 'captured' by Mars. &quot;We don't know any way that could happen,&quot; Melosh said, unless it occurred &quot;very early in the solar system.&quot; Additionally, Melosh pointed out that the circular orbit of Phobos &quot;does not happen very naturally.&quot; However, he dismissed speculation that Phobos is hollow or an artificial body and, instead, suggested that it is &quot;thoroughly fractured and has a lot of void space in it.&quot; View the full report.\nThe Story of Earth\n\nIn the first hour, Senior Research Scientist at the Carnegie Institution of Washington's Geophysical Laboratory, Robert Hazen, talked about the history of Earth, as a planet. &quot;It is a great story and it is not told very often,&quot; he said of the Earth's 'life story.' One aspect of that history is that the gravitational relationship between Earth and the moon has caused both bodies to slow their rotation. Over 4.5 billion years, he said, this has resulted in the Earth rotational cycle growing from 5 hours to the current 24 hour day. During his appearance, Hazen also detailed the surprising emergence of a black market for meteorites that has risen out of the Saharan desert.\n\nNews segment guest: Mish Shedlock\nWebsite(s):\n\n    earthfiles.com\n    hazen.gl.ciw.edu\n\nBook(s):\n\n    Mysterious Lights and Crop Circles\n    Glimpses of Other Realities, Volume 2\n    The Story of Earth\n\n","torrent":{"xt":"urn:btih:5143b784542af17ab60b00f65ed74509bc94efce","amp;dn":"Coast+to+Coast+AM+February+28+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5143b784542af17ab60b00f65ed74509bc94efce","infoHashBuffer":{"type":"Buffer","data":[81,67,183,132,84,42,241,122,182,11,0,246,94,215,69,9,188,148,239,206]},"announce":[],"urlList":[]}}