{"title":"The Hunters By Chris Kuzneski","uid":8192101,"size":1705057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:549d72ed3930fb9f21b7e0629d48d7c36a47983b&amp;dn=The+Hunters+By+Chris+Kuzneski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"maxdesolate","files":5,"time":1361848890,"description":"The first in a brand new series from the international bestseller Chris Kuzneski - The Hunters: a team of renegades - an ex-military leader, a historian, a computer whiz, a weapons expert and a thief - financed by a billionaire philanthropist are tasked with finding the world's most legendary treasures.\n        The Mission: recover a vast Romanian treasure that was stolen by the Russians nearly a century ago. Fearing a Germany victory in World War 1, the Romanian government signed a deal to guarantee the safety of the country's most valuable artifacts until after the war. In 1916 two treasure trains full of gold and the most precious objects of the Romanian state - paintings, jewellery from the Royal family, ancient Dacien artifacts - were sent to the underground vaults in the Kremlin only to be lost to the Romanian people forever as Russia severed all diplomatic relations with the country and scattered the treasure to its outlying regions. \n     With a haul valued at over $3.5 billion dollars, everyone wants to claim the vast treasure but its location has remained a mystery, until now. Can the Hunters succeed where all others have failed?\n\nEPUB,MOBI AND TXT.","torrent":{"xt":"urn:btih:549d72ed3930fb9f21b7e0629d48d7c36a47983b","amp;dn":"The+Hunters+By+Chris+Kuzneski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"549d72ed3930fb9f21b7e0629d48d7c36a47983b","infoHashBuffer":{"type":"Buffer","data":[84,157,114,237,57,48,251,159,33,183,224,98,157,72,215,195,106,71,152,59]},"announce":[],"urlList":[]}}