{"title":"Earth to Earth","uid":8313594,"size":35443471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54cd717755b9ef49b81716e400f42ce79ef001fa&amp;dn=Earth+to+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1364531712,"description":"Martin Hill, &quot;Earth to Earth&quot;\nISBN: 0740769340 | 2007 | EPUB | 192 pages | 34 MB\n\nMy photographs are made with the same sunlight that powers all the earth's living systems. --Martin Hill\n\n* Reminiscent of the internationally best-selling Earth from Above, Martin Hill's Earth to Earth transforms the beauty of everyday items found in nature and elevates them to ecological art.\n\nEcology is a science that is entering its renaissance as issues of global warming, greenhouse emissions, and ozone depletion make their way from scientific debates and newspaper headlines to family breakfast tables. Environmental photographer Martin Hill and project collaborator Philippa Jones visit remote locations around the globe to create a stunning array of evocative photographs that represent a visual circle of life promoting ecological sustainability and responsibility.\n\nIn addition to an eloquent introduction by Sir Edmund Hillary, ecologically minded quotes and facts appear throughout the collection:\n\n* Each day more solar energy falls to the earth than the total amount of energy the planet's six billion inhabitants would consume in 25 years.\n* What use is a house if you haven't got a tolerable planet to put it on?","torrent":{"xt":"urn:btih:54cd717755b9ef49b81716e400f42ce79ef001fa","amp;dn":"Earth+to+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54cd717755b9ef49b81716e400f42ce79ef001fa","infoHashBuffer":{"type":"Buffer","data":[84,205,113,119,85,185,239,73,184,23,22,228,0,244,44,231,158,240,1,250]},"announce":[],"urlList":[]}}