{"title":"Mint-Cappuccino","uid":8197035,"size":1281359933,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:58aacb2e657eac7c1016ba4313ea253e6c5da376&amp;dn=Mint-Cappuccino&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mokaNinja","files":2,"time":1361935141,"description":"Unapproved! Unofficial. Totally Underground. But, Absolutely Legal.\n\nFor Your Consideration!\n\nIntroducing!\n\nAmeretto!  - A Cappuccino Development Environment all Set up For You on a Linux Mint Live Distro!\n\n\nThe password to enter this development environment: cappuccino\n\nI just began learning Cappuccino on Linux and thought I'd make it easier for any Linux or Window users who may be learning to program for the first time and who want to learn the hottest new multi-platfrom web programming language. You no longer have to think about writing browser specific code and you get a huge Framework of polished Mac-like controls that plug right in. And, you don't have to spend time with installation tutorials for dev tools, it's all set up for you on this iso. Instead, let's get coding now!\n\nI myself am using it and it's way better and more powerful than any web language I've used and you don't need a MicroSoft license!! Ha ha!\n\nCheck out more about Cappuccino here: http://www.cappuccino-project.org/\n\nBased on the 4th most popular distro used in the world, Linux Mint is the top Linux choice for developing with Cappuccino. And the whole development environment is set up and ready to go for you with this customized iso.\n\nTry out live without touching your hard drive. This iso boots just to ram. Or install and update and get the speed benefits!\n\nThe live disk also allows to just boot live and only develop in ram with Internet disconnected if you need the security for your development environment. This will keep all your work safe until you are ready to publish. Just save work on a secure or encrypted usb/hard disk until it ready for showing.\n\nAll set up for development with:\n\n- Sublime\n- Chromium\n- Apache2\n- Django\n- Git\n- capp and jake\n\n- An off-line version of the Cappuccino API is loaded.\n- The most recent Cappuccino source compiled and ready to go.\n\nPost installation instructions:\n\nUpdate Linux Mint\n1. If the update icon appears on your toolbar, just hit it and follow instructions.\n\nUpdate Cappuccino\nUpdating Cappuccino to get the bleeding edge changes is easy, it just take two commands:\n1. Open up terminal.\n2. Navigate to /home/cp/cappuccino/\n3. Enter the command: git pull\n4. After it finishes, enter: jake install\n5. Now you are updated!\n(I'll add a toolbar shortcut so this is one button press you for next release.)\n\n\nHere is an Objective-J tutorial I am creating to go with this iso:\n &lt;a href=&quot;\nhttps://docs.google.com/document/d/1gJQq-V6gOjv9ZPudwODf-vOMWGG85QlMVRV9Zbr3wPE/edit?usp=sharing&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://docs.google.com/document/d/1gJQq-V6gOjv9ZPudwODf-vOMWGG85QlMVRV9Zbr3wPE/edit?usp=sharing&lt;/a&gt;\n\nThank you Linux Mint, Cappuccino, Sublime, Chromium, Django, and Apache! Special thanks to Remastersys which provides a way to integrate these awesome technologies in a custom Linux distro for a specific purpose. ","torrent":{"xt":"urn:btih:58aacb2e657eac7c1016ba4313ea253e6c5da376","amp;dn":"Mint-Cappuccino","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58aacb2e657eac7c1016ba4313ea253e6c5da376","infoHashBuffer":{"type":"Buffer","data":[88,170,203,46,101,126,172,124,16,22,186,67,19,234,37,62,108,93,163,118]},"announce":[],"urlList":[]}}