{"title":"Gene Effect v1.2 APK + OBB","uid":8029811,"size":124151381,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:590c8c6e8db40983af32bc348c3b41e20e774c11&amp;dn=Gene+Effect+v1.2+APK+%2B+OBB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nnttoo","files":1,"time":1358384475,"description":"Mankind explores space using an ancient technology found in an abandoned alien ore mine on Mars. We are now capable of exploiting resources from foreign planets. One day a mining vessel is missing on the planet Kratoss. What starts as a simple rescue mission turns into the discovery of a secret that threatens the existence of mankind.\n\nGameplay:\nGene Effect is a side scrolling action-adventure. Explore ancient alien mines on the planet Kratoss. Collect resources on your way through deep mines and fight against natural phenomena, biological threats and mechanical devices. You can solve optional puzzles that unlock hidden areas containing relicts, artifacts and other goodies.\n\nUpgrade your ship with artifacts and experience an epic story that unfolds using multiple, interweaved storylines.\n\nEnjoy Gene Effect over and over again with randomized level content, 3 difficulty levels and different play styles.\n\nFeatures:\nthree different difficulty modes that increase the challenge \nfind hidden artifacts to upgrade your ship \n6 different trophies including score, time and skill based rewards \nstatistical overview with interesting facts like overall progress, total playtime, travel distance and many more \nsolve optional puzzles and discover secret places \ninteractive environments with dangerous traps and tons of destructible objects \nrandomly generated level content for varying and dynamic gameplay \noutstanding visuals using dynamic lighting and real physics \nunlock 25 music tracks and listen to them with an integrated music player\n\nWhat's in this version : (Updated : Jan 16, 2013)\nNote: On some devices the optional bloom and lensflare effects may cause bad performance, graphic errors or crashes. Please turn this option off if you are experiencing any issues.\n\nnew update read here:  &lt;a href=&quot;\nhttp://www.data-apk.in/tag/gene-effect&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.data-apk.in/tag/gene-effect&lt;/a&gt;","torrent":{"xt":"urn:btih:590c8c6e8db40983af32bc348c3b41e20e774c11","amp;dn":"Gene+Effect+v1.2+APK+%2B+OBB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"590c8c6e8db40983af32bc348c3b41e20e774c11","infoHashBuffer":{"type":"Buffer","data":[89,12,140,110,141,180,9,131,175,50,188,52,140,59,65,226,14,119,76,17]},"announce":[],"urlList":[]}}