{"title":"Powerdown: Options and Actions for a Post-Carbon World","uid":7860455,"size":5314280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59f6125183f9108b8f67d6b31c22291bdce95fd9&amp;dn=Powerdown%3A+Options+and+Actions+for+a+Post-Carbon+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1353918712,"description":"\n&quot;Powerdown: Options and Actions for a Post-Carbon World&quot; by Richard Heinberg\nNS Publishers, Clairview Books | 2004 | ISBN: 0865715106 9780865715103 1902636635 9781902636634 | 223 pages | PDF | 5 MB\n\nThis book explores how three important groups within global society-the power elites, the opposition to the elites (the antiwar and antiglobalization movements, et al: the &quot;Other Superpower&quot;), and ordinary people-are likely to respond to these four options. Timely, accessible and eloquent, Powerdown is crucial reading for our times.\n\nIf the US continues with its current policies, the next decades will be marked by war, economic collapse, and environmental catastrophe. Resource depletion and population pressures are about to catch up with us, and no one is prepared. The political elites, especially in the US, are incapable of dealing with the situation and have in mind a punishing game of &quot;Last One Standing.&quot;\nThe alternative is &quot;Powerdown,&quot; a strategy that will require tremendous effort and economic sacrifice in order to reduce per-capita resource usage in wealthy countries, develop alternative energy sources, distribute resources more equitably, and reduce the human population humanely but systematically over time. While civil society organizations push for a mild version of this, the vast majority of the world's people are in the dark, not understanding the challenges ahead, nor the options realistically available.","torrent":{"xt":"urn:btih:59f6125183f9108b8f67d6b31c22291bdce95fd9","amp;dn":"Powerdown%3A+Options+and+Actions+for+a+Post-Carbon+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59f6125183f9108b8f67d6b31c22291bdce95fd9","infoHashBuffer":{"type":"Buffer","data":[89,246,18,81,131,249,16,139,143,103,214,179,28,34,41,27,220,233,95,217]},"announce":[],"urlList":[]}}