{"title":"Albany NY 2122013.rar","uid":8136940,"size":1080327192,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5b313a2b1a1a4a1de2ada9b77830a2906b6da7eb&amp;dn=Albany+NY+2122013.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1360728807,"description":"Urgent News from United States of America As we the United States Citizens are in danger and have come to realize that our Government and electoral Officials have become &quot;Corrupt&quot; being Approx 10 years advanced than other countries and I wanted to share this information with the world and let other countries know as well that its not us the people waging war on them its our government and they do not listen to us they are out of control and have seized control of many things such as the media, we are being stripped of not only our Constitutional rights but are being slowly disarmed so we can't defend ourselves against a Corrupt government/dictatorship as previous laws passed has stopped us from forming a citizens militia and if we try to protect ourselves by joining together we are automatically considered Terrorist. please help spread this information as far and as long as you can thank you. This is very very serious and other countries are in danger!\tObama just Authorized 20 f16 fighter jets to be sent to Egypt and a handful of m1 Abram tanks as he looks to wage more wars.In this video we have 1 of many rallies showing the people of NY fighting for their rights! \t","torrent":{"xt":"urn:btih:5b313a2b1a1a4a1de2ada9b77830a2906b6da7eb","amp;dn":"Albany+NY+2122013.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b313a2b1a1a4a1de2ada9b77830a2906b6da7eb","infoHashBuffer":{"type":"Buffer","data":[91,49,58,43,26,26,74,29,226,173,169,183,120,48,162,144,107,109,167,235]},"announce":[],"urlList":[]}}