{"title":"Brazzers - MILFs Like It ?lack 2 [DvdRip].avi","uid":8003993,"size":2200078336,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5ebaae1320bbf797eb13f0ec7d9d6600b232abbc&amp;dn=Brazzers+-+MILFs+Like+It+%3Flack+2+%5BDvdRip%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"SplashPt","files":1,"time":1357842232,"description":"Brazzers - MILFs Like It ?lack 2 [DvdRip].avi\n\nLonely moms getting pounded by monster black cock. Vannah Sterling - When Vannah comes to MLB to get some of that black cock from Tactics, their session gets interrupted by a fight between Jason and Shane... She decides to calm the prostitutes down by letting them fuck her! Nicki Hunter - The one and only Nicki Hunter, the bitch who never gets tired of cock, is in the MLB building. It seems all the guys in the crew have bad memories of this psychotic black cock hungry Milf, except Shane, who volunteers to fuck her! Raven Black - This chick wanted to get back at her stupid cheating boyfriend of hers. Not only will he never be able to fuck her no more due to the massive gap left by our boy Shane, we'd be surprised if she can still walk! Sarah Jessie - Our Boy DT, aka Deep Threat, aka Greedy got out of the pen and we decided to set him up with some finnnnnne pussy that wanted a Thug Life happy ending. Should have told the bitch that Greedy didn't get any for 6 months! Mandy Sweet - A predominant investor, Lee Bang, decided to give us a tour of our possible new house as a front for Milfs Like it Black. Who are we to say no to an offer. Everything was looking great until one of our appointments had to overlap! Moxxie Maddron - Moxxie the divorced housewife paid us a visit with a suitcase filled with a part of her alimony... All she wanted was to be a lifetime customer so she can randomly get big black cock shoveling her wet white pussy! We gave it to her good.\n\nNicki Hunter, Vannah Sterling, Raven Black, Sarah Jessie, Moxxie Maddron, Mandy Sweet\n\nMILF, Black, Anal, Gonzo, Hardcore, Oral, Big Tits\n\nScreens:\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=4ld4szrfyh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=4ld4szrfyh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=s332z6zaya.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=s332z6zaya.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5ebaae1320bbf797eb13f0ec7d9d6600b232abbc","amp;dn":"Brazzers+-+MILFs+Like+It+%3Flack+2+%5BDvdRip%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ebaae1320bbf797eb13f0ec7d9d6600b232abbc","infoHashBuffer":{"type":"Buffer","data":[94,186,174,19,32,187,247,151,235,19,240,236,125,157,102,0,178,50,171,188]},"announce":[],"urlList":[]}}