{"title":"Pavement - 2004 - Crooked Rain (LA's Desert Origin Edition) [fla","uid":8008796,"size":1284993881,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:63ac007daa37191cb9731ae32504d10764b721b7&amp;dn=Pavement+-+2004+-+Crooked+Rain+%28LA%27s+Desert+Origin+Edition%29+%5Bfla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1357953591,"description":" &lt;a href=&quot;http://www.allmusic.com/album/crooked-rain-crooked-rain-mw0000107665&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.allmusic.com/album/crooked-rain-crooked-rain-mw0000107665&lt;/a&gt;\n\nIt may be a bit reductive to call Crooked Rain, Crooked Rain the Reckoning to Slanted &amp; Enchanted's Murmur -- not to mention easy, considering that Pavement recorded a song-long tribute to R.E.M.'s second album during the Crooked Rain sessions -- but there's a certain truth in that statement all the same. Slanted &amp; Enchanted is an enigmatic masterpiece, retaining its mystique after countless spins, but Crooked Rain strips away the hiss and fog of S&amp;E, removing some of Pavement's mystery yet retaining their fractured sound and spirit. It's filled with loose ends and ragged transitions, but compared to the fuzzy, dense Slanted, Crooked Rain is direct and immediately engaging -- it puts the band's casual melodicism, sprawling squalls of feedback, disheveled country-rock, and Stephen Malkmus' deft wordplay in sharp relief. It's the sound of a band discovering its own voice as a band, which is only appropriate because up until Crooked Rain, Pavement was more of a recording project between Malkmus and Scott Kannberg than a full-fledged rock &amp; roll group. During the supporting tour for Slanted, Malkmus and Kannberg recruited bassist Mark Ibold and percussionist Bob Nastanovich, and original drummer Gary Young was replaced by Steve West early into the recording for this album, and the new blood gives the band a different feel, even if the aesthetic hasn't changed much. The full band gives the music a richer, warmer vibe that's as apparent on the rampaging, noise-ravaged &quot;Unfair&quot; as it is on the breezy, sun-kissed country-rock of &quot;Range Life&quot; or its weary, late-night counterpart, &quot;Heaven Is a Truck.&quot; Pavement may still be messy, but it's a meaningful, musical messiness from the performance to the production: listen to how &quot;Silence Kit&quot; begins by falling into place with its layers of fuzz guitars, wah wahs, cowbells, thumping bass, and drum fills, how what initially seems random gives way into a lush Californian pop song. That's Crooked Rain a nutshell -- what initially seems chaotic has purpose, leading listeners into the bittersweet heart and impish humor at the core of the album. Many bands attempted to replicate the sound or the vibe of Crooked Rain, Crooked Rain, but they never came close to the quicksilver shifts in music and emotion that give this album such lasting appeal. Here, Pavement follow the heartbroken ballad &quot;Stop Breathin'&quot; with the wry, hooky alt-rock hit &quot;Cut Your Hair&quot; without missing a beat. They throw out a jazzy Dave Brubeck tribute in &quot;5-4=Unity&quot; as easily as they mimic the Fall and mock the Happy Mondays on &quot;Hit the Plane Down.&quot; By drawing on so many different influences, Pavement discovered its own distinctive voice as a band on Crooked Rain, Crooked Rain, creating a vibrant, dynamic, emotionally resonant album that stands as a touchstone of underground rock in the '90s and one of the great albums of its decade.","torrent":{"xt":"urn:btih:63ac007daa37191cb9731ae32504d10764b721b7","amp;dn":"Pavement+-+2004+-+Crooked+Rain+%28LA%27s+Desert+Origin+Edition%29+%5Bfla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ac007daa37191cb9731ae32504d10764b721b7","infoHashBuffer":{"type":"Buffer","data":[99,172,0,125,170,55,25,28,185,115,26,227,37,4,209,7,100,183,33,183]},"announce":[],"urlList":[]}}