{"title":"HISTORY OF POP AND ROCK MUSIC - part 455","uid":8025032,"size":573311484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:643a814a4da66ef361aab1423e197a24f1709354&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+455&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1358287983,"description":"\n\n                   PART  455\n\n\n        DAVID BOWIE  -  The Man Who Sold The World  (2000)\n        NIRVANA  -  The Man Who Sold The World  (1993)         (+)\n        LULU  -  The Man Who Sold The World  (1974)\n\n\n\n(+)  =  This item has already been uploaded \n        Replace the old file with this one\n        (new one is VOB format)\n\n\n\n     &quot;The Man Who Sold the World&quot; is a song written and performed by David Bowie. It is the title track of his third album, released in the U.S. in November 1970 and in the UK in April 1971. The song has been covered by a number of other artists, notably by Lulu in 1974, and Nirvana in 1993.\n\n     Lulu's &quot;The Man Who Sold the World&quot; was released as a single on 11 January 1974 having been introduced by Lulu on the TOTP broadcast of 10 January 1974: the track only made its Top 50 debut (at #27) on the chart dated 16 January 1974 following a reprise performance by Lulu on the 24 January 1974 TOTP broadcast with a third TOTP performance by Lulu on the 7 February 1974 broadcast facilitating a boost from #13 to #5 on the chart dated 9 February 1974. In her TOTP performances in support of &quot;The Man Who Sold the World&quot; Lulu has been characterized as &quot;dressed and sounding exactly like a diminutive Bowie&quot;.  On the UK Top 50 dated 16 February 1974 Lulu's &quot;The Man Who Sold the World&quot; rose to #3 which proved to be the peak position for the track which subsequently made an accelerated chart descent with its overall Top 50 tenure being a comparatively brief nine weeks. Internationally &quot;The Man Who Sold the World&quot; afforded Lulu a major hit hit in Ireland (#8), the Netherlands (#10) and Germany (#13): the track was also a minor chart item in Australia at #81.\n\n       In his journals, Kurt Cobain of the American grunge band Nirvana ranked the album The Man Who Sold the World at number 45 in his top 50 favourite albums. A live rendition of the song was recorded by the band in 1993 during their MTV Unplugged appearance, and it was released on their MTV Unplugged in New York album the following year. The song was also released as a promotional single for the album and received considerable airplay on alternative rock radio stations. It was also thrown into heavy rotation on music video stations such as MTV. Nirvana regularly covered the song during live sets after their memorable acoustic performance up until lead singer Cobain's death in 1994. In 2002 the song was re-released on Nirvana's &quot;best of&quot; compilation album Nirvana.\n\n","torrent":{"xt":"urn:btih:643a814a4da66ef361aab1423e197a24f1709354","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+455","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"643a814a4da66ef361aab1423e197a24f1709354","infoHashBuffer":{"type":"Buffer","data":[100,58,129,74,77,166,110,243,97,170,177,66,62,25,122,36,241,112,147,84]},"announce":[],"urlList":[]}}