{"title":"Coast to Coast AM January 17 2013","uid":8036526,"size":57278508,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:647ba3003f3b6235c1e0376820c1e7d9a89d78e5&amp;dn=Coast+to+Coast+AM+January+17+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1358530795,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-17-13\nHost: \tGeorge Noory\nGuests: \tRuss Dizdar, Dr. Peter Breggin\n\nFormer Chaplain at the University of Akron PD, Russ Dizdar, discussed Satanic ritual abuse (SRA) and how many cases of multiple personality disorder are the results of occult programming. Estimates suggest that up to 4-10 million people may have been harmed by this type of abuse, he reported. While there are different brands of Satanism, such as &quot;psycho-Satanism&quot; (practiced by people such as Richard Ramirez), and organizations like the Church of Satan, Dizdar has focused his efforts against an &quot;Underground&quot; cult that is trans-generational and multi-continental. Through bloodlines they might be traced as far back as the Nephilim, but in the modern era, they came out of &quot;the Black Flame&quot; brotherhood/Nazi connection and have many wealthy and elite members, he claimed.\n\nDizdar said he's spent 25 years tracking SRA victims both on the spiritual and law enforcement side. The Underground typically starts abusing victims when they are still a child, inflicting them with various traumas, sexual and otherwise, which cause them to disassociate and split into different personalities, he explained, adding that each of these personalities can then be programmed for specific tasks, such as becoming an assassin. By the age of 13, a victim may have gone through up to a 1,000 different types of rituals, and could have as many as 70-80 sub-personalities programmed into them, speaking 4-5 different languages, he noted.\n\nWhile the main personality is supposed to be amnesiac to the other identities, when they receive a specific trigger this can set off one of the programmed personas, he continued. Regarding the ritual aspect, &quot;the reason they use the demonic energizing is for the power...and supernatural strength behind it,&quot; he remarked. The Underground's endgame is for globalist rule, and the rise of the Antichrist, said Dizdar. &quot;In the future, there's going to be the largest supernaturally-charged transmuted empowered military system ever. There will be a planetary ritualistic release of demonic presence to gather them for the great day,&quot; he warned.\nPsychiatric Drugs &amp; Violence\n\nFirst hour guest, Dr. Peter Breggin talked about the recent shootings and their possible relationship to psychiatric drugs. He lamented that the Obama administration has been pushing psychiatry as part of the effort to make schools safer. But psychiatrists typically prescribe medications to children, which &quot;vastly empowers the drug companies,&quot; and it's fascistic to rely on psychiatry to police us, he commented. Further, data shows that people on antidepressants are 840% more likely to commit violence than if they were on other types of prescription drugs, he noted, adding that increased aggression and hostility were associated with antidepressants, stimulants, and mood stabilizers.\n\nNews segment guests: Greg Hunter, Capt. Kelly Sweeney\n\nWebsite(s):\n\n    theblackawakening.com\n    shatterthedarkness.net\n    breggin.com\n\nBook(s):\n\n    The Black Awakening\n    God's Ghostbusters\n    Medication Madness\n\n","torrent":{"xt":"urn:btih:647ba3003f3b6235c1e0376820c1e7d9a89d78e5","amp;dn":"Coast+to+Coast+AM+January+17+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"647ba3003f3b6235c1e0376820c1e7d9a89d78e5","infoHashBuffer":{"type":"Buffer","data":[100,123,163,0,63,59,98,53,193,224,55,104,32,193,231,217,168,157,120,229]},"announce":[],"urlList":[]}}