{"title":"Scott Pilgrim Vs. The World","uid":8049059,"size":15940903839,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:652d4cbba30f8b9e82a539e4358efffef619872e&amp;dn=Scott+Pilgrim+Vs.+The+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mazurie","files":1,"time":1358818408,"description":"Based on Bryan Lee O'Malley's Oni Press comic book of the same name, Scott Pilgrim vs. the World follows the eponymous slacker rocker on his colorful quest to defeat his dream girl's seven evil ex-boyfriends. Twenty-two-year-old Scott Pilgrim (Michael Cera) may not have a job, but rocking the bass for his band, Sex Bob-omb, is a tough job unto itself. When Scott locks eyes with Ramona Flowers (Mary Elizabeth Winstead), he knows she's the girl he wants to grow old with. But Ramona has some serious baggage; her supercharged exes rue the thought of her being with another man, and they'll crush any guy who gives her a second glance. Now, in order to win Ramona's heart, Scott will do battle with everyone from vegan-powered rock gods to sinister skateboarders, never losing sight of his gorgeous goal as he pummels his way to victory. Shaun of the Dead's Edgar Wright directs the film from a script he penned with Michael Bacall. Superhero veterans Chris Evans and Brandon Routh co-star in the action comedy as two of the seven ex-boyfriends. ~ Jason Buchanan, Rovi","torrent":{"xt":"urn:btih:652d4cbba30f8b9e82a539e4358efffef619872e","amp;dn":"Scott+Pilgrim+Vs.+The+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652d4cbba30f8b9e82a539e4358efffef619872e","infoHashBuffer":{"type":"Buffer","data":[101,45,76,187,163,15,139,158,130,165,57,228,53,142,255,254,246,25,135,46]},"announce":[],"urlList":[]}}