{"title":"Urgent News from United States of America 3.rar","uid":8120363,"size":50771049,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:652e6a999a72dd72ca756fbb8129c0a69be869d6&amp;dn=Urgent+News+from+United+States+of+America+3.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Korge","files":1,"time":1360388973,"description":"Urgent News from United States of America Things are heating up folk's as i have been infected with a serious roaming virus for uploading the other video and had to recover my computer and switch to another Vpn cause my ip was banned by privitize for unknown reasons until i read their tos anyway im back and i don't care what they try and do cause i will still upload the truth,  As we the United States Citizens are in danger and have come to realize that our Government and electoral Officials have become &quot;Corrupt&quot; I wanted to share this information with the world and let other countries know as well that its not us the people waging war on them its our government and they do not listen to us they are out of control and have seized control of many things such as the media, we are being stripped of not only our Constitutional rights but are being slowly disarmed so we can't defend ourselves against a Corrupt government/dictatorship as previous laws passed has stopped us from forming a citizens militia and if we try to protect ourselves by joining together we are automatically considered Terrorist. please help spread this information as far and as long as you can thank you. This is very very serious and other countries are in danger!","torrent":{"xt":"urn:btih:652e6a999a72dd72ca756fbb8129c0a69be869d6","amp;dn":"Urgent+News+from+United+States+of+America+3.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652e6a999a72dd72ca756fbb8129c0a69be869d6","infoHashBuffer":{"type":"Buffer","data":[101,46,106,153,154,114,221,114,202,117,111,187,129,41,192,166,155,232,105,214]},"announce":[],"urlList":[]}}