{"title":"Avernum with Keygen - old version","uid":8200577,"size":7418926,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:660ae827ba3743466996e638cac9e307b4327288&amp;dn=Avernum+with+Keygen+-+old+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mjbonuma","files":1,"time":1362005713,"description":"THIS IS MY FIRST TORRENT, FOLKS! IF THERE IS ANYTHING WRONG WITH IT JUST COMMENT AND I'LL HELP ANY WAY I CAN!\n\nYou have been banished to the underworld, never to see the light of day again.\n\nYou have been cast down into the dark, volcanic pits of Avernum, filled with foul monsters, constant warfare, and thousands and thousands of your fellow prisoners. This is your punishment for not fitting in, for speaking out against the powers that be, for being an inconvenience to the government of the cruel Emperor Hawthorne. You have been sentenced to life imprisonment in the caverns, eventually to die there, forgotten and unmourned.\nBut you need not accept your fate. There are those who wish to struggle against this injustice, who wish to return to the surface world and to fight against tyranny. But first, they need a hero, they need inspiration, and, most of all, they need someone who can find an escape route. Can you help them?\n\nWill you be the first person to escape from Avernum?\n\n-------------------------------------------------------------------------------------\n\n- Install the averdemo.exe (yeah, the same demo crap you get on spiderweb page)\n- Run the demo to getr the registration code\n- Use the registration code on the key generator to get another code\n- Run the game and select to register with the code given by the key generator\n\nHAVE FUN!!!","torrent":{"xt":"urn:btih:660ae827ba3743466996e638cac9e307b4327288","amp;dn":"Avernum+with+Keygen+-+old+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"660ae827ba3743466996e638cac9e307b4327288","infoHashBuffer":{"type":"Buffer","data":[102,10,232,39,186,55,67,70,105,150,230,56,202,201,227,7,180,50,114,136]},"announce":[],"urlList":[]}}