{"title":"The Ed Show 1-8-13.mp4","uid":8001533,"size":183340216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66507a54b1580b6d8d2deda33b47fc52e88297cd&amp;dn=The+Ed+Show+1-8-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1357773112,"description":"The Ed Show; January 8, 2013.\n\nTwo years after the tragedy in Tucson, former Rep. Gabrielle Giffords and her husband, former astronaut Mark Kelly, are taking the gun lobby head on. And a powerful new ad calls for courage in Congress. Ed welcomed Sen.Barbara Boxer (D-CA) for an update on the fight for common sense gun safety.\n\nThen, Sheriff Joe Arpaio sent his posse out to patrol around schools in Arizona. Ed got the truth about arming public school teachers with Randi Weingarten (President of the American Federation of Teachers).\n\nRep. Steven Palazzo wanted aid when his district was ravaged by Hurricane Katrina. And yet, he voted down Sandy aid. He took a hypocritical tour of Sandy damage.\n\nCongress hits a new low: even root canals, cockroaches and lice are now more popular! Bob Shrum (Democratic Strategist) and Howard Fineman (NBC News Political Analyst and Editorial Director of the Huffington Post Media Group), assessed the damage.\n\nFlorida's Rick Scott is cooking the books to deny care to the poor. Find out why this is nothing new for the Republican governor.\n\nAnd in the BIG Finish, insurance giant AIG is thinking about suing the federal government after the taxpayers bailed them out.(they withdrew the next day). How could that be? Ed asked William Cohan (Bloomberg View Columnist, and author of &quot;Money and Power&quot;).","torrent":{"xt":"urn:btih:66507a54b1580b6d8d2deda33b47fc52e88297cd","amp;dn":"The+Ed+Show+1-8-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66507a54b1580b6d8d2deda33b47fc52e88297cd","infoHashBuffer":{"type":"Buffer","data":[102,80,122,84,177,88,11,109,141,45,237,163,59,71,252,82,232,130,151,205]},"announce":[],"urlList":[]}}