{"title":"tales.from.the.crypt.mp4.all.episodies.by.swordfish","uid":7973584,"size":8444931221,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:67ed8f903b6d5fca1ef45fac50fd302fb37c97ee&amp;dn=tales.from.the.crypt.mp4.all.episodies.by.swordfish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ocruz3","files":93,"time":1356927244,"description":"tales.from.the.crypt.mp4.serie.by.swordfish\n\nTODA LAS TEMPORADAS COMPLETAS IDIOMA INGLES CON SUBTITULOS EN ESPAÃ‘OL\n\nTales from the Crypt, sometimes titled HBO's Tales from the Crypt, is an American horror anthology television series that ran from 1989 to 1996 on the premium cable channel HBO. The title is based on the 1950s EC Comics series of the same name and most of the content originated in that comic or the four other EC Comics of the time (Haunt of Fear, Vault of Horror, Crime SuspenStories, and Shock SuspenStories). The show was produced by HBO with uncredited association by The Geffen Film Company and Warner Bros. Television (all part of a production consortium officially called Tales from the Crypt Holdings). The series is not to be confused with the 1972 film by the same name or Tales from the Darkside, another similarly themed horror anthology series.\n\nBecause it was aired on HBO, a premium cable television channel, it was one of the few anthology series to be allowed to have full freedom from censorship by network standards and practices as a result, HBO allowed the series to contain graphic violence as well as other content that had not appeared in most television series up to that time, such as profanity, gore, nudity and sexual situations, which could give the series a TV-MA rating for today's standards. The show is subsequently edited for such content when broadcast in syndication or on basic cable.\n\nWhile the series began production in the United States, in the final season filming moved to Britain, resulting in episodes which revolved around British characters.\n\nSUBIDO POR SWORDFISH\n\nDEJA COMENTARIOS SALUDOS","torrent":{"xt":"urn:btih:67ed8f903b6d5fca1ef45fac50fd302fb37c97ee","amp;dn":"tales.from.the.crypt.mp4.all.episodies.by.swordfish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ed8f903b6d5fca1ef45fac50fd302fb37c97ee","infoHashBuffer":{"type":"Buffer","data":[103,237,143,144,59,109,95,202,30,244,95,172,80,253,48,47,179,124,151,238]},"announce":[],"urlList":[]}}