{"title":"Minnesota Nice (2012) A Documentary On Bullying And Teen Suicide","uid":8056801,"size":476618133,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:686f9dc2b0d2cd66d4933e985c7615b7af0d8657&amp;dn=Minnesota+Nice+%282012%29+A+Documentary+On+Bullying+And+Teen+Suicide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sfdfsdfs","files":3,"time":1358986211,"description":"Directed by 18 year old Alec Fischer. Copyright 2012. Public Release Date: October 28th, 2012. The film is made up of real students, sharing their real stories about being bullied in school.\n\nPurchase apparel to support the film: http://minnesotaniceapparel.spreadshirt.com\n\n&quot;Like&quot; the film on Facebook:\n\nIf you are being bullied and don't know where to turn for help, please go to the listed resources:\n &lt;a href=&quot;\nhttp://www.pacer.org/bullying/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pacer.org/bullying/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.thetrevorproject.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrevorproject.org&lt;/a&gt;\n\nThe documentary &quot;Minnesota Nice?&quot; was created by 18 year old Alec Fischer, who made the film his senior year in high school. The film highlights the problem Minnesota has been having with student suicides and bullying in schools, and brings attention to how school administrations and the State Government have been ignoring the problem despite cries for help from students and faculty. In the film, real students from across Minnesota share their real stories of how they were bullied and harassed relentlessly in school, many to the point of attempting suicide.\n\nFischer created the film to raise awareness about the growing problem our country is facing with students committing suicide due to bullying, and also because he wanted to give students a voice who were otherwise silenced. \n\nHere is a brief backstory and intro to the film by Alec: \n\nHi everyone, and thank you for watching and sharing my film. This is an issue that has been getting a lot of attention in the media lately, and has been addressed across our country. However, students who are being bullied right now can't seem to find help, and the problem isn't getting any better. \n\nAs a middle school student, I was bullied relentlessly starting in 6th grade. Every day I would hear disgusting insults thrown at me from students who were older than me, and also from students in my own grade. Faggot, worthless, idiot, loser, nothing, and homo were some of the most reoccurring words. Hearing these names multiple times every class, every day, each week of every school year began to take its toll on me. I began to believe what people were saying to me. The bullying got so bad that in 8th grade I attempted to end my life. I thought I was worthless and that the world would be a better place without me. \n\nWhat saved me from that state of mind was knowing that there were people around me who were a lot worse off than I was. A lot of my friends were being bullied more than I was, and many of them attempted suicide from 6th grade to 12th grade. I realized that I had to be the strong person who they could come to and talk with. I would often find myself up at 1am on a school night convincing someone to put the razor blade down, telling them that they were beautiful and didn't need to cut the pain away. \n\nThis past November (2011) I had a friend call me around midnight asking for help. He needed someone to talk to about the bullying he was going through at his school. I found myself going over to his house at 12:30am on a school night, and letting him cry on my shoulder until 4 in the morning. He told me later that week that he had been planning on killing himself that night because the bullying had gotten so bad, and that if I had come over even an hour later he wouldn't be here right now. \n\nThat scared me so much I knew I needed to start making this film immediately. I buckled down and began interviewing people across the State, gathering their stories and their opinions on bullying. I interviewed school and district administrators, senators, bullying-prevention organizations, parents, students who were being bullies, and students who were being bullied. After gathering all of the footage I realized that the stories I needed to tell were the ones from students being bullied at school. It was then that &quot;Minnesota Nice?&quot; began to form into a documentary highlighting real stories from real students about bullying. \n\nI finished the film in May, and have been presenting it at theaters, schools, and local organizations for the past 5 months. However, I knew the film needed to be seen by more people, and it needed to be free. I think it's a message that EVERYONE needs to see, and to put a price tag on it felt wrong to me. For that reason, I decided to release the film on YouTube. From here, people can see it without charge, and the message can be shared across the world. The only thing it now relies on is you. I hope you take something away from the film, and if you like the message it conveys please share it with the people around you. \n\nWe can make the current situation better for students across the country. It just takes one person to stand up against bullying to make the world a safer place. Together we can take a stand against bullying. Together we can say we've had enough. Together we can change.","torrent":{"xt":"urn:btih:686f9dc2b0d2cd66d4933e985c7615b7af0d8657","amp;dn":"Minnesota+Nice+%282012%29+A+Documentary+On+Bullying+And+Teen+Suicide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"686f9dc2b0d2cd66d4933e985c7615b7af0d8657","infoHashBuffer":{"type":"Buffer","data":[104,111,157,194,176,210,205,102,212,147,62,152,92,118,21,183,175,13,134,87]},"announce":[],"urlList":[]}}