{"title":"GTA-SA","uid":8049538,"size":720867284,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6910c04ec88a32ac91b5977b1db390ff2b9ed324&amp;dn=GTA-SA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Death132","files":1,"time":1358827549,"description":"In the year since Rockstar Game's incredible Grand Theft Auto: San Andreas was released, a lot of unbelievable software has come and gone for the PlayStation 2. Metal Gear Solid 3, God of War, Shadow of the Colossus, and Devil May Cry 3 have all pushed the limits of our imaginations with their excellent concepts and mechanics, and have continued to set standards and expectations as to what a videogame should be. Of course, that left us with an interesting question: &quot;With the release of Grand Theft Auto: San Andreas - Special Edition in the midst of this summer's 'Hot Coffee' scandal, how does IGN's 2004 Game of the Year still hold up?&quot;\n\nThe answer, not surprisingly, is still &quot;enormously well.&quot; Though the game itself doesn't feature anything new by way of content, bug fixes, or storylines (with the exception being that the buried &quot;Hot Coffee&quot; mini-game has now been removed), it's still an excellent experience -- and other than a few extras that have been added outside of the software, it remains unchanged. With that in mind, we present below a modified version of the original review that ran more than a year ago with a couple of specific changes. One: the overall opinion of the piece has been skewed a bit to reflect the high quality software that's been released since, and Two: we have now added mention of the bonus extras included in the special edition package.","torrent":{"xt":"urn:btih:6910c04ec88a32ac91b5977b1db390ff2b9ed324","amp;dn":"GTA-SA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6910c04ec88a32ac91b5977b1db390ff2b9ed324","infoHashBuffer":{"type":"Buffer","data":[105,16,192,78,200,138,50,172,145,181,151,123,29,179,144,255,43,158,211,36]},"announce":[],"urlList":[]}}