{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":8025760,"size":8582251495,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69ee3273d5cc123b444799d832c0a8c77b18163e&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1358303610,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 40 - Orion Conspiracy WW3 Fake Alien Invasion\n \n\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh.\n\nDescription:\n\nThe Orion Conspiracy: &lt;a href=&quot;\nhttp://www.theorionconspiracy.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theorionconspiracy.com/&lt;/a&gt;\nA short movie by French director/photographer Seb Janiak that was released in 2007/2008. It consists of a long presentation with a slideshow given by an anonymous lecturer to a group of important-looking men that tries to tie every major conspiracy theory in a single unified conspiracy theory narrative. Given the fact that the images in the slideshow are either blatantly photoshopped or taken out of context, chances are that the whole thing is indeed a tongue-in-cheek artsy movie, probably with some kind of message about gullibility and the media, and not a straight example of Seb Jainak being a true believer.\n-----------------------------------------------------------\n\nBases 7 Britain's Supersoldiers - MK-Ultra Mind Control:\nThe final DVD version of Bases 7 on the Supersoldier program in the UK. Thanks to Dave's brave witness statement a whole batch of victims and witnesses have come forward, see AMMACH Witness statements.AMMACH Project Conference is on Aug31st,Sept 2nd Britannia Hotel Nottingham\nHighly Disturbing allegations and claims involving Ritual Child Abuse, Aliens, Mind Control, UFOs, Secret bases in Somerset. Super Soldiers, MI6 and more..RAF in the Project Monarch Program.\nThe Orkney Child Abuse Scandal is detailed.\nInvolves physical creature implants that move in the body, and radiate RF signals.\nThese Claims are made by Super Soldier Dave &quot;M&quot;, in ths gruelling interview on the BASES label.\nContinuing on from the Barry King, James Casbolt and Matt Todd data, we have more, and its getting worse. This information is for Mature researchers only. Some information may shock and offend. Its not looking good off planet!\nDave claims to &quot;Hulk Out&quot; and is a PRESENT Mind Controlled &quot;Super Soldier&quot;, with scars and intrusion holes in his back. He is sent on secret Missions, potentially off planet. Who Knows, with others, some of whom were selected at schools in the Taunton area.\nThis is posted with the consent of an ACTIVE Mind Controlled Supersoldier in England. THREE have so far come forward, out of at least NINE.\nBASES 7 invites the remnainder to come forward.\nBUT so far we have no EVIDENCE ANY of these &quot;Claims&quot; have ANY valid Reality.\nSo BASES and UndergroundVideo Uk advises Caution.\n-----------------------------------------------------------\n\nUFO Photos - Part 2:\nInsider knowledge on ufos, aliens, bases on other planets &amp; other anomalies.  Learn about real UFO, Alien and Moon/Mars Base Photos and the astronauts' encounters with these structures, creatures and anomalies.  Real-life Christian Ghost Hunter, Michael Hur, discusses the analysis of these events with in-depth insider commentary.\n-----------------------------------------------------------\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:69ee3273d5cc123b444799d832c0a8c77b18163e","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69ee3273d5cc123b444799d832c0a8c77b18163e","infoHashBuffer":{"type":"Buffer","data":[105,238,50,115,213,204,18,59,68,71,153,216,50,192,168,199,123,24,22,62]},"announce":[],"urlList":[]}}