{"title":"Anokha Milan (1972) VCD_No Subs [DDR]","uid":8194518,"size":1345398524,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f6a02513cafea204bdd4d658be3113d92d0fdac&amp;dn=Anokha+Milan+%281972%29+VCD_No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1361890385,"description":"Anokha Milan (1972) VCD_No Subs [DDR]\n\nCAST:- Dharmendra, Pranoti Ghosh, Dilip Kumar, Abhi Bhattacharya, Bikash Roy, Satya Banerji, Dilip Roy, Asha Devi\nDirected by Jagannath Chaterji\nMusic Director: Salil Chowdhury\t\nLyricist: Haneef, Jackie\n\nSongs are included in MP3s\nAnokha Milan (1972) 00. Title Music and Screen Credits_Salil Chowdhury\nAnokha Milan (1972) 01. Bandhu Re Ye Man Dole, Manna Dey, Haneef, Jackie, Salil Chowdhury\nAnokha Milan (1972) 02. Man Na Morey Satta, Sabita Chowdhury, Haneef, Jackie, Salil Chowdhury\nAnokha Milan (1972) 03. Song Unknown, Haneef, Jackie, Salil Chowdhury\nAnokha Milan (1972) 04. Bandhu Re Ye Man Dole, Manna Dey, Haneef, Jackie, Salil Chowdhury\nAnokha Milan (1972) 05. Music and Dance only, Salil Chowdhury\n\nSYNOPSIS:- Anokha Milan (1972)\nTara Sen lives in a small town in India with her parents, a younger brother, sister, and an elder brother who lives in Calcutta. She is friendly with Ghanshyam, affectionately called &quot;Ghana&quot;, and often spends time with him near the river bank. When her brother returns home he brings along a friend named Bijesh, who takes a liking to Tara and molests her. He is asked to leave the very next day, but the news spreads like wildfire, resulting in her parents to decide to get her married immediately, in vain though as no one wants to come forward to marry her. \n\nDuring the Devi Pooja ceremonies, people crowd around the Sen household and spread vicious rumors about Tara, Ghana does not take kindly to this, a fight ensues, and a man is killed. The police are summoned, Ghana is arrested and held in prison. Sen attempts to reason with the local Police Inspector Badal Gupta, known for womanizing and being an alcoholic, who agrees to withdraw all charges provided Tara marries him. Sen is reluctant, but Tara readily accepts, and their marriage takes place. Tara's husband does not give up on his bad habits, neither does he fulfill his promise of releasing Ghana. One day an argument ensues between Tara and him, followed by a struggle, blows are exchanged, with Tara hitting him on the head with an axe. He is hospitalized, Tara is arrested, but when he regains consciousness he refuses to press charges, then subsequently succumbs to his injuries, Tara is sentenced to prison. \n\nWhen she finds out that Ghana is doing time in Andamans, she requests for a transfer there, which is granted. When she reaches Andamans, she is told by the Warden that the only way she can meet with Ghana is by marrying him. But Ghana is old-fashioned and refuses to marry Tara on grounds that she is wealthy and he a lowly servant. Tara now has an option - return home and live alone for the rest of her life, or alternatively kill herself.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1119 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Hindi\nRunTime: 2:10:57\nSubtitles: NONE\nRipped by: Trinidad [DDR]    \nDuration: 2:10:57","torrent":{"xt":"urn:btih:6f6a02513cafea204bdd4d658be3113d92d0fdac","amp;dn":"Anokha+Milan+%281972%29+VCD_No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6a02513cafea204bdd4d658be3113d92d0fdac","infoHashBuffer":{"type":"Buffer","data":[111,106,2,81,60,175,234,32,75,221,77,101,139,227,17,61,146,208,253,172]},"announce":[],"urlList":[]}}