{"title":"DON'T LET A SNITCH WRECK YOUR LIFE!","uid":7992737,"size":3200070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f999ec881076a0f2b0efeb872eccc7e3f1ccf67&amp;dn=DON%27T+LET+A+SNITCH+WRECK+YOUR+LIFE%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wearehidden","files":4,"time":1357527295,"description":"These days, law enforcement at all levels -- from the local cop shop to obscure federal agencies -- uses snitches to trap ordinary people. Snitches tell lies that send their friends to jail. Paid agents provocateurs talk or trick otherwise harmless people into committing crimes. In many places, Snitch culture has virtually replaced real investigation of real crimes.\n\nDon't think you're exempt if you're a &quot;law-abiding citizen.&quot; The most trusting, naive, innocent people often make the easiest targets for these weaselly, lying, opportunistic vermin. Snitches specialize in targeting the vulnerable.\n\nYou may be in danger if you are:\n\n    A political activist\n    A recreational drug user\n    A hobbyist or business person who works with &quot;sensitive&quot; materials\n    A member of an unpopular religion\n    A gun owner or dealer\n    A participant in the underground economy\n    A photographer or videographer\n    A controversial thinker or writer\n    Or you just happen to hang out with the wrong people\n\nSnitches are everywhere and they're hard to detect. This brief, FREE ebook, Rats, can help you:\n\n    Identify a snitch\n    Protect yourself against snitches and agents provocateurs\n    Protect your friends or colleagues\n    Know how to handle yourself if you get arrested\n\nIt could even help you avoid being pressured into becoming a snitch, yourself.\n\nRats is the work of ex-cops, lawyers, security experts, experienced activists, outlaws, former outlaws, trained interrogators, and more. In the hour or so it takes you to read their information, you'll gain a lifetime's worth of armor against snitches, informers, informants, agents provocateurs, narcs, finks, and similar vermin.\n\nDownload the Rats ebook now. Five electronic formats. All absolutely FREE. Download below or top of page left.\n\nShare it with your friends. Spread it around. Offer copies for download you your own site or mirror this entire page. All we ask is that you provide a link back to http://rats-nosnitch.com/. Information is power -- the power of free people against a growing police state.\n\nIf you want to read the book in one of the ereader formats but don't own a Kindle or a Nook, you can download free reader software for phones, Windows and Mac computers, and other devices. Free Kindle apps from Amazon.com. Free Nook apps from Barnes &amp; Noble. \n\n\n\n","torrent":{"xt":"urn:btih:6f999ec881076a0f2b0efeb872eccc7e3f1ccf67","amp;dn":"DON%27T+LET+A+SNITCH+WRECK+YOUR+LIFE%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f999ec881076a0f2b0efeb872eccc7e3f1ccf67","infoHashBuffer":{"type":"Buffer","data":[111,153,158,200,129,7,106,15,43,14,254,184,114,236,204,126,63,28,207,103]},"announce":[],"urlList":[]}}