{"title":"X-Factor Annual #4 (1989) [Marvel] (Requested)","uid":7967661,"size":86785780,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:701cab5ebb26e6b7b821421deea7d458a351428b&amp;dn=X-Factor+Annual+%234+%281989%29+%5BMarvel%5D+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blackcanary","files":-1,"time":1356723867,"description":"English | CBR | 56 Pages\n\nX-Factor Annual #4\nPublisher:  Marvel\nPublication Date:  October 1989\n\nI Must Go Down to the Sea Again\nStory and Pictures:  John Byrne\nEmbellishment:  Walter Simonson\nLettering:  Jim Novak\nColoring:  Tom Vincent\n\n...That I Be Bound in a Nutshell\nStory:  Ralph Macchio\nArt:  John Byrne\nLettering:  Jim Novak\n\nInferno Aftermath\nStory:  Mark Gruenwald\nPencils:  Jim Fern\nInks:  Joe Rubenstein\nLettering:  Joe Rosen\nColors:  Gregory Wright\n\nSaga of the Serpent Crown: Emperor of Death\nWriter:  Peter Sanderson\nPenciler:  Mark Bagley\nInker:  Keith Williams\nColorist:  Santiago Tapia Jr.\nLetterers:  Starkings &amp; Moede\n\nI Must Go Down to the Sea Again: Being carried across the globe by some sort of tractor beam, Beast clings to the body of his teammate Marvel Girl while she is in a trance. Upon trying to snap her out of her trance, he inadvertently drops them in the middle of the ocean.\n\nGhaur's agents try and apprehend their newly chosen Bride of Set. Unfortunately for Ghaur, Attuma has noticed that the female soon-to-be prisoner of the Deviant King is none other than Jean Grey.\n\nAttempting to make her pay for spurning and defeating him back in the times she was Phoenix, she battles him again. Weak, tired, and nearing death at Attuma's hands, Beast comes to her rescue alongside Andromeda. While Beast makes his getaway with Jean, Andromeda faces her father Attuma.\n\nBeast is convinced by Ghaur to hand Jean over to him in order to save her life. After the battle, Andromeda is also taken to be a Bride of Set.\n\n\n... That I Be Bound in a Nutshell: It's a battle of nerves and willpower as Doctor Doom tries to perfect the stolen brainwashing technology of Magneto himself. Each man makes the other endure painful and traumatic memories of their pasts.\n\n\nInferno Aftermath: Two FBI Agents are tasked with going to New York and discovering the true nature of the events from Inferno. Unable to reach the Avengers of Fantastic Four, the Agents try and contact X-Factor.\n\nDespite what little information Gilgamesh can give them and the stories X-Factor concoct, the Agents are left to use the reason: Hypno Ray.\n\n\nThe Saga of the Serpent Crown, Chapter 10: Emperor of Death: The complete history of the Serpent Crown continues here as Namor faces Naga. Naga convinces Namor he has killed Dorma (Namor's lover). Enraged, Namor engages Naga in a fierce battle.\n\nNaga, when almost killing Namor, reveals the woman who died was a Lemurian gets more than he bargained for as one of his allies Karthon discovers the woman killed was his sister. Karthon kills Naga while his not looking and frees Namor from Naga's deathtrap.\n\nBehind the scenes, Llyra uses this to move the next step of her plan into play ... drawing her and Ghaur even closer to one another.","torrent":{"xt":"urn:btih:701cab5ebb26e6b7b821421deea7d458a351428b","amp;dn":"X-Factor+Annual+%234+%281989%29+%5BMarvel%5D+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"701cab5ebb26e6b7b821421deea7d458a351428b","infoHashBuffer":{"type":"Buffer","data":[112,28,171,94,187,38,230,183,184,33,66,29,238,167,212,88,163,81,66,139]},"announce":[],"urlList":[]}}