{"title":"Fullmetal Alchemist: Brotherhood + movie BD 720p","uid":8004633,"size":23109282421,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:73f670795ac5b6a9a60ae2d4cfb5e3132dac4d5f&amp;dn=Fullmetal+Alchemist%3A+Brotherhood+%2B+movie+BD+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ajzer85","files":-1,"time":1357859374,"description":"Fullmetal Alchemist: Brotherhood\n\nFullmetal Alchemist: Brotherhood, known in Japan as Alchemist of Steel: Fullmetal Alchemist (Hagane no Renkinjutsushi: Furumetaru Arukemisuto) is the second independent anime adaptation developed by Bones from the Fullmetal Alchemist manga series by Hiromu Arakawa. Set in a fictional universe in which alchemy is one of the most advanced scientific techniques known to man, the story follows the brothers Edward and Alphonse Elric, who want to restore their bodies after a disastrous failed attempt to bring their mother back to life through alchemy. Performing human transmution is illegal, but not impossible. After their mothers sudden death they attempted a human transmution to bring her back, Edward loosing his arm and Alphonse his whole body as &quot;toll&quot; for opening the gate of Truth while trying to transmute a human life. In a desperate attempt to get his brother back Edward opens the gate again, bringing Alphonses soul back and attaching it to a nearby suit of armor, paying his leg in toll again. The transmution went horribly wrong, the creature created was not human nor had it a soul. Along with that Ed and Al also gained a glimpse of &quot;the Truth&quot; on the other side of the gates. The series picks up years later where we find Ed and Al as alchemists for the military, State Alchemists, or &quot;dogs of the military&quot;. As the youngest state alchemist ever Edward is using both his influense and skills in alchemy to find out more about The Alchemist's Stone. A artifact said to enhance their powers enough to bypass the rule of equivalent exchange, thus gaining more than they give in transmution. A way to open the gate without paying toll. However, this artifact seems to be well known but wastly tabu. What is the secret behind this stone?\n\nThe series is made up of 64 episodes, all accounted for in this pack. They are released by Eclipse, all in 1280x720 HD, ripped from the blueray-release of the series. Japanese language and english softcoded subtitles, mkv-format so get your codecs/VLC updated. Each episode is roughly 340mb and 25min.\n\n\n\nFullmetal Alchemist: The Sacred Star of Milos\n\nThe movie after Brotherhood, released july 2 2011. In this movie Ed and Al has not yet regained their bodies but they are state alchemists of high value. They are aware of their bodies being within the Truth and are looking for ways to gain entrance other than through human transmutation. The movie begins with an orange haired girl, Julia Crichton, waking up from a dream about the day her family was forcibly taken from her home by soldiers beside her older brother Ashley who is studying their parents' alchemy books. Soon the siblings hear some strange noises and Ashley goes ahead to investigate, but a worried Julia follows to a room where she finds the bodies of her parents hung up and dripping blood. She watches in horror as her brother is attacked and presumably murdered to which she faints.\nYears later, a criminal breaks free from prison in Amestris, and the Elric brothers Edward and Alphonse join the effort to recapture him. The duo confronts the escapee who proves himself a dangerous opponent able to create ice and lightning from the alchemy circles drawn in blood on the palms on his hands.\n\nThis movie is in japanese language with softcoded english subtitles, mkv-format in 1280x720 HD. Resonably good quality considering the size of only 635mb and 1:50h long.","torrent":{"xt":"urn:btih:73f670795ac5b6a9a60ae2d4cfb5e3132dac4d5f","amp;dn":"Fullmetal+Alchemist%3A+Brotherhood+%2B+movie+BD+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73f670795ac5b6a9a60ae2d4cfb5e3132dac4d5f","infoHashBuffer":{"type":"Buffer","data":[115,246,112,121,90,197,182,169,166,10,226,212,207,181,227,19,45,172,77,95]},"announce":[],"urlList":[]}}