{"title":"Buttmans Stretch Class 15 XXX DVDrip x264-Jiggly","uid":8185440,"size":2283043564,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7475976f032949ec7663d6a4b5b3b0a7db75c240&amp;dn=Buttmans+Stretch+Class+15+XXX+DVDrip+x264-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":1,"time":1361714357,"description":"Director John Stagliano \n\nStarring Chanel Preston, Sierra Sanders, AJ Applegate\n\nGenre Gonzo, Pornstar, Anal, Toys, Blonde, Booty, Brunette, Bubble Butt, College, Foot, P.O.V., Petite, Teens, Natural tits \n\nButtman's Stretch Class 15 Summary: With his Stretch Class series of erotic training videos, pornographic pioneer John Buttman Stagliano uses his kinky expertise to mold eager, young sluts into skilled, flexible, sexually self-aware performers ready to take on the world! Buttman's Stretch Class 15 is three scenes of intensive instruction involving ass tease and posing, SM-style endurance and outrageously lewd masturbation using an endless variety of toys and props from the director's well-appointed home studio. First, busty beauty Chanel Preston rocks a see-through fishnet top and a pair of skintight white spandex leggings, wedgied into the crack of her ass. She plants her meaty behind on the director's face to let him inhale her musky aroma through the sheer material. Chanel's private tutoring involves plenty of clothespin tit torment, dildo deep-throating and big, ass-reaming toys. Several changes of outfit later, the sultry bitch vibrates her pussy to climax, her plundered sphincter gaping. Perky, beautiful Sierra Sanders brings her soft, all-natural body to Stretch Class for a session of kinky anal fun. The labia of her juicy cunt get pinched with painful clamps, her luscious boobs are pulled like taffy, and the pale cutie concludes her lesson with the orgasmic help of a large vibrating wand. Lastly, super-friendly blonde AJ Applegate teases Buttman with her adorable bare feet; a riding crop, big anal invaders and other perverted pleasures bring AJ to orgasm. Buttman's Stretch Class 15 is more than stretching the flesh... it's about expanding a girl's erotic horizons.\n\n\n &lt;a href=&quot;\nhttp://www.forload.net/?v=fxix.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=fxix.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.forload.net/?v=buku.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=buku.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.forload.net/?v=jigglybutt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=jigglybutt.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7475976f032949ec7663d6a4b5b3b0a7db75c240","amp;dn":"Buttmans+Stretch+Class+15+XXX+DVDrip+x264-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7475976f032949ec7663d6a4b5b3b0a7db75c240","infoHashBuffer":{"type":"Buffer","data":[116,117,151,111,3,41,73,236,118,99,214,164,181,179,176,167,219,117,194,64]},"announce":[],"urlList":[]}}