{"title":"The Black Donnellys [2007] Season 1 - Complete Series (DVD / .IS","uid":8006964,"size":24556254156,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:74d1e339aa917f546513a0f01f5863757a33058a&amp;dn=The+Black+Donnellys+%5B2007%5D+Season+1+-+Complete+Series+%28DVD+%2F+.IS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Ferrari5180","files":5,"time":1357913180,"description":"TORRENT DETAILS\n\nThe Black Donnellys\nSeason 1\nEpisodes 1-13\n\n1:1 DVD Copy\n.ISO / 3 DVD's\nNTSC Format\nEnglish Language\n &lt;a href=&quot;\nhttp://img198.imageshack.us/img198/5483/theblackdonnellys2007th.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img198.imageshack.us/img198/5483/theblackdonnellys2007th.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0805661/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0805661/&lt;/a&gt;\n\n&quot;EXPECT THE UNEXPECTED&quot;\n     \n               - Daily News\n\nFrom the Oscar-winning writers of Crash and the writer of Million Dollar Baby comes a bold and edgy crime-drama series, The Black Donnellys.\n\nFour very different Irish-American brothers - Kevin, Jimmy, Tommy and Sean - have sworn to live by the code of the &quot;family first.&quot; But as they become increasingly involved in the ruthless world of New York organized crime, their loyalties to their friends, to their loves ones, and especially to each other will be put to the ultimate test. Available on DVD for the first time, this explosive 3-disc set includes all 13 episodes, including seven episodes that never aired on NBC.\n\nDISC ONE\n\n01. &quot;PILOT&quot;\nFour Irish-American brothers - Kevin, Jimmy, Tommy and Sean - live by the motto of the &quot;family first&quot; but find their individual interests conflict when they're implicated in the disappearance of a mob-connected bookie.\n\n02. &quot;A STONE OF THE HEART&quot;\nIt's time for the payback as Jimmy sits in a holding cell, and Tommy and Kevin decide to dispose of his problem with the bookie - for good.\n\n03. &quot;GOD IS A COMEDIAN&quot;\nA brother's love can be harsh, especially when Tommy accurately predicts Jimmy's fall from grace after being released from prison.\n\n04. &quot;THE WORLD WILL BREAK YOUR HEART&quot;\nJimmy's big mouth gets the brothers into even more trouble, and Tommy decides to host the wake for Huey in order to avoid suspicion in the neighborhood.\n\nDISC TWO\n\n05. &quot;LIES&quot;\nHonesty may not be the best policy when Tommy discovers that Huey's widow has a box Dokey desperately wants, and Jenny wakes up in Samson's bed.\n\n06. &quot;RUN LIKE HELL&quot;\n\nA scheme to strong-arm funds grabs hold of all the brothers as Tommy gets pulled into Jimmy and Kevin's gambling addiction while trying to protect an old friend.\n\n07. &quot;THE ONLY THING SURE&quot;\nRoles are reversed when Jimmy paints the bar and protects Sean from the family business and Tommy goes out with Kevin to collect payments.\n\n08. &quot;IN EACH ONE A SAVIOR&quot;\nNo good deed goes unpunished for Tommy, the new head of the neighborhood, when he tries to help a woman evict drug dealers from her building.\n\n09. &quot;ALL OF US ARE IN THE GUTTER&quot;\nTommy hopes that his new job at an art studio will help him to separate from the business, so the picture isn't pretty when the Donnellys' new partner will only deal with him.\n\nDISC THREE\n\n10. &quot;WHEN THE DOOR OPENS&quot;\nThe brothers' loyalty and their new partnership with Dokey are put to the test when he asks them to clear an apartment building of its junkie tenants.\n\n11. &quot;WASN'T THAT ENOUGH&quot;\nIn spite of warnings from Dokey and Helen, Tommy agrees to help Reilly after he is told to vacate his building.\n\n12. &quot;THE BLACK DROP&quot;\nTensions rise when Tommy goes after the person he believes is threatening Reilly's diner, Jenny's husbands body is found, and Dokey humiliates Jimmy.\n\n13. &quot;EASY IS THE WAY&quot;\nThe consequences are deadly when Tommy and Jimmy both have their own ideas about how to save the family.\n\nPRODUCT DETAILS\n\nCreators: Paul Haggis, Robert Moresco\nActors: Jonathan Tucker, Olivia Wilde, Bridget Regan\nFormat: AC-3, Box Set, Color, Dolby, DVD, Subtitled, Widescreen, NTSC\nLanguage: English\nSubtitles: English\nRegion: Region 1 (U.S. &amp; Canada)\nAspect Ratio: 1.78:1\nNumber Of Discs: 3\nRated: NR (Not Rated)\nStudio: Universal Studios\nDVD Release Date: January 6, 2009\nRun Time: 571 Minutes","torrent":{"xt":"urn:btih:74d1e339aa917f546513a0f01f5863757a33058a","amp;dn":"The+Black+Donnellys+%5B2007%5D+Season+1+-+Complete+Series+%28DVD+%2F+.IS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d1e339aa917f546513a0f01f5863757a33058a","infoHashBuffer":{"type":"Buffer","data":[116,209,227,57,170,145,127,84,101,19,160,240,31,88,99,117,122,51,5,138]},"announce":[],"urlList":[]}}