{"title":"Chakram 2005 Telugu DVDRip -=DVG=-","uid":8322719,"size":723128593,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75341c3ad29ae49c7a23592c47c71a6d9d831809&amp;dn=Chakram+2005+Telugu+DVDRip+-%3DDVG%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hinaruto","files":11,"time":1364725449,"description":"Punchline: Fleeting philosopher\nGenre: Philosophy\nType: Straight\nBanner: Geeta Chitra International\nCast: Prabhas, Charmy, Asin, Prakash Raj, Padmanabham, Tanikella Bharani, Brahmanandam, Narayana Rao, AVS, MS Narayana, Gowtam Raju, Mallikharjuna Rao, Raghubabu, Venu Madhav, jeeva, Siva Reddy, Srinivasa Reddy, Urvasi, Radha Kumari, Rajyalakshmi, Delhi Rajeswari &amp; Bhuvaneswari\nMusic: Chakri\nLyrics: Sirivennela, Chandrabose &amp; Kandikonda\nCinematography: Ram Prasad, Arvind Krishna &amp; Om Prakash\nEditing: Krishna Reddy\nFights: Stun Siva\nScreenplay: Satyanand &amp; Krishna Vamsi\nPresents: Suryadevara Lalitha Prabhakar Nag\nProducers: C Venkatraju &amp; G Sivaraju\nStory, direction: Krishna Vamsi \nTheatrical release date: 25th March 2005\n\n\nChakram (Prabhas) and Lakshmi I (Asin) are foreign-returned medicos. They want to get married with the consent of their parents. When their marriage is on, Chakram writes a note that he doesn't want to marry Lakshmi I and runs away from his home town. He resurfaces back in Sahara Colony of Hyderabad. There he finds around 25 people with 25 different problems. He finds the root cause for each and every problem and solves all the problems. In the process, Lakshmi II (Charmy) falls in love with Chakram. Lakshmi I traces Chakram back and finds that he is in love with Lakshmi II. Chakram breaks the heart of Lakshmi I by telling her that he would be marrying Lakshmi II. The rest of the story is all about why Chakram became insincere to Lakshmi I. \n\nArtists Performance\n\nPrabhas: Doing this kind of role is really a blessing for any actor as it gives them a wider scope to explore plethora of histrionics. Prabhas performed extremely well. He is looking good with changed hair-do. However, the contact lens used for a few scenes of the film are not appealing enough. His costumes are good.\n\nHeroines: Charmi got more footage in this film compared to Asin. Charmy is good, but she dubbed her voice in Telugu herself. She is not yet ready for self-dubbing. Asin is impressive in her role and half the time, you see her sobbing. SP Sailaja has dubbed her voice.\n\nOthers: It is nice to see veteran artist Padmanabham back on the screen. He is good. Prakash Raj supplied Oxygen into the emotional scenes towards climax by giving a credible and controlled performance. MS Narayana is cool as drunkard and his style of approaching Prabhas with newspaper is hilarious. Brahmanandam's cameo towards climax is excellent. Among the colony mates, Raghu Babu excelled as the conman with his typical personification.","torrent":{"xt":"urn:btih:75341c3ad29ae49c7a23592c47c71a6d9d831809","amp;dn":"Chakram+2005+Telugu+DVDRip+-%3DDVG%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75341c3ad29ae49c7a23592c47c71a6d9d831809","infoHashBuffer":{"type":"Buffer","data":[117,52,28,58,210,154,228,156,122,35,89,44,71,199,26,109,157,131,24,9]},"announce":[],"urlList":[]}}