{"title":"POtHS - Prophetic Times - 98 - Modern Martyers Vol5 - Are Christ","uid":8056436,"size":7377939732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:76e13427712a98e8453ebb95c59f105f7fead173&amp;dn=POtHS+-+Prophetic+Times+-+98+-+Modern+Martyers+Vol5+-+Are+Christ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":-1,"time":1358978767,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 98 - Modern Martyers Vol5 - Are Christians Being Persecuted\n\n\nPOtHS Comments on This one:   100's of Christians Martyred Everyday.\n\nDescription:\nBBC - Are Christians Being Persecuted 2010:\nFor years now, some town halls have been renaming their Christmas Lights as Winter Lights festivals. More and more Christians are ending up in court, defending themselves against what they see as victimisation for not being allowed to wear a cross to work or to pray for a patient. Many Christians feel that Christianity - once the heart of British society - is being pushed to the margins.\n\nIf the Christian faith is being sidelined from the public space, is that a good or a bad thing? Campbell interviews Christians who claim they have been discriminated against, as well as leading religious and secular voices, including Archbishop of Westminster Cardinal Vincent Nichols; Chief Rabbi Jonathan Sacks; Bishop of Rochester Michael Nazir Ali; Shami Chakrabati, Director of the civil rights organistation Liberty; and Polly Toynbee, President of the National Secular Society.\n-----------------------------------------------------------\n\nHated by All Suleiman Abdulai:\nSuleiman Abdulai is a Nigerian Christian who accepts the persecution Christ promised. His Muslim family urged him to deny Jesus' name and even tried to kill him before finally disowning him. But, as Jesus promised in Matthew 10, the Holy Spirit gave him the words to speak when needed. And when he was being sought by killers, the Lord protected him. Although faith in Christ cost Suleiman his family, worldly possessions and reputation, he gained everything by taking up Christ's cross.\n\nIn this video interview Suleiman tells a bit about his life before Christ, his conversion, how he believes Christians should be reaching Muslims, and how he and his family are now.\n-----------------------------------------------------------\n\nState of Union:\nAre we a nation in crisis? God's solution is to build up His church. God builds royalty from refugee bricks, and we His bricks resist temptation, respect His authority, and represent Christ well.\n\nDiscussion Questions\n1. Are you more concerned with building your own treasures, or building in\nGod's kingdom?\n2. What is the &quot;state of the union&quot; in your own heart? Your home? Your\ncommunity group?\n3. How do you see the Lord building you into a &quot;spiritual house&quot;? (1 Peter\n2:5)\n4. How can your community help you live above reproach? How can they\nhelp you resist temptation?\n5. Have you shared your faith to the point that people think you're an alien or\nstranger in the land? What's holding you back?\n6. What do you need to lay at the altar so that God can continue to build you\ninto something new?\n\n\n\n\n\n           \n:thankyou:  :thankyou:   Thank You JESUS\n","torrent":{"xt":"urn:btih:76e13427712a98e8453ebb95c59f105f7fead173","amp;dn":"POtHS+-+Prophetic+Times+-+98+-+Modern+Martyers+Vol5+-+Are+Christ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e13427712a98e8453ebb95c59f105f7fead173","infoHashBuffer":{"type":"Buffer","data":[118,225,52,39,113,42,152,232,69,62,187,149,197,159,16,95,127,234,209,115]},"announce":[],"urlList":[]}}