{"title":"Up with Chris Hayes 12-30-12.mp4","uid":7975777,"size":312484403,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:779cd30ec66b4d4d235b250eef98015591274843&amp;dn=Up+with+Chris+Hayes+12-30-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":-1,"time":1356978789,"description":"Up with Chris Hayes; Sunday, December 30, 2012. Steve Kornacki hosted. \n\nJoining Steve were:\n\nKelly O'Donnell (NBC News) joined via satellite to update on the negotiations. (she did so later as well.\n\nJamelle Bouie (staff writer at The American Prospect, fellow at The Nation Institute), Suzy Khimm (reporter for the Washington Post, writer for Wonkblog), Kevin Williamson (deputy managing editor at The National Review and author of &quot;The Dependency Agenda&quot;), Maya Wiley (founder and president of the Center for Social Inclusion) discussed latest on the last-minute &quot;fiscal curb&quot; negotiations in Washington. \n\nSen. Jeff Merkley (Democrat of Oregon and leading advocate of filibuster reform), joined via satellite about the fiscal negotiations.\n\nAmy Kremer (chairman of the Tea Party Express) joined and replaced Suzy Khim, Fergus Cullen (former chairman of the New Hampshire Republican Party, Yankeeinstitute.org, editorial columnist at the New Hampshire Union Leader) joined and replaced Kevin Williamson on the panel. They discussed House Speaker John Boehner's political troubles. \n\nRep. Keith Ellison (Democrat of Minnesota and co-chair of the Congressional Progressive Caucus) joined via satellite to discussed the fiscal cliff, party differences, and Boehner.\n\nLater, the same panel examined the demise of a once dominant force in American politics: the Tea Party.\n\n\nThe latest panel stayed for 'Now We Know'.","torrent":{"xt":"urn:btih:779cd30ec66b4d4d235b250eef98015591274843","amp;dn":"Up+with+Chris+Hayes+12-30-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"779cd30ec66b4d4d235b250eef98015591274843","infoHashBuffer":{"type":"Buffer","data":[119,156,211,14,198,107,77,77,35,91,37,14,239,152,1,85,145,39,72,67]},"announce":[],"urlList":[]}}