{"title":"The Training of O----ToO-27556 Penny Pax","uid":8119823,"size":3434123781,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:781d438d06c7628340cff8e41902c8e2f22fd1b1&amp;dn=The+Training+of+O----ToO-27556+Penny+Pax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1360372661,"description":"The Training of an Anal Slut, Day One\n\nFeb 8, 2013 - Performers: Penny Pax \n\n\nMP4 and WMV + Pics.\n\n\nPenny Pax loves it in the ass, and I am considering turning her into my little anal slut. Does she have the right stuff? \n\nI the Hydra: \n\nThe Hydra is a seven headed beast. \nShe is tied to the ceiling and made to balance on a 4x6 beem in heels. Her asshole is stuffed with a thick black plug on a stick, and her cute dress is cut to exposed her tits. She is handed a bucket of clothes pegs and twine, and told to put a 50 peg zipper on herself. Then, the Hydra is introduced. Seven hitachis all bundled together are pressed to her tiny cunt. The sound of seven vibes fills the room. Then I start asking questions. \n\nII Key in a Haystack: \nShe is put into chains, taken to a 6 foot stack of hay and told to find the key. She is too slow, and she frustrates me. She is dragged around the set by the nipple in search of the non-existant key. This game begins to bore me and I decide it is more amusing to put her into various stress postions and extract training rules from her. She is quickly overwhelmed and begins to cry. I take pity on her, and put her in the corner with a bucket on her head, and tell her to whistle me a tune while I set up the next scene. \n\nIII All Pussies Must be Shaved: \nSome prospective training goals and a couple of rules begin to take shape. We just need to get a read on the intensity of her orgasms and finalize the evolving curriculum. \n\nShe is tied securely to a hard wooden exam table, her thighs held open, and her labia pinned back to completely expose that wet, pink little clit. I turn a hose on it, the stream of water \n\nHomework: \n- Bio of Emiliy Post\n- Post's definition of etiquette \n\nThis update contains: Anal training, butt plugs, pussy vibrating, erotic manual labor, stress positions, rope bondage, water torment, feet cropping, bastinado\n\nScreens   &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=27556&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=27556&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:781d438d06c7628340cff8e41902c8e2f22fd1b1","amp;dn":"The+Training+of+O----ToO-27556+Penny+Pax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"781d438d06c7628340cff8e41902c8e2f22fd1b1","infoHashBuffer":{"type":"Buffer","data":[120,29,67,141,6,199,98,131,64,207,248,228,25,2,200,226,242,47,209,177]},"announce":[],"urlList":[]}}