{"title":"Adictum Electronic Music Maker v1.1","uid":8011130,"size":2915023,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:793b7eacb0a5ba6581f530fc8d0fff8f1a15f06f&amp;dn=Adictum+Electronic+Music+Maker+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DeTouch","files":1,"time":1357996613,"description":"Requires Android: 2..2+\n\n\nDescription\nThe only app that actually allows you to make and play electronic music live!\n\nModern and attractive user interface which allows the user to play and mix REAL electronic music such as: trance, house, dubstep, dance, techno, etc. App is packed full of high quality sounds, effects, instruments, and beats.\n\nThis app is not just a sound sampler or a simple drum machine, yet it is an actual creator of electronic music for people who are serious about making music.\n\nNo need to have any prior knowledge on creating electronic music, just experiment with the app and you will sound like a pro. User interface is very intuitive and simple to use.\n\nAdictum Electronic Music Maker also includes mini bass and lead synth keyboards with multi-touch pads which allow for the creation of real melodies, harmonies, chords, riffs, and arpeggios.\n\nMix music and choose from beats with various tempos and rhythms to stylize your music. Added loop features permit unlimited hours of jamming, improvising, creativity and enjoyment.\n\nSimply connect speakers to your device and start DJing and producing real electronic music at any live event, rave, or party.\n\nThis is best and most professional electronic music maker, trance music maker, house music maker or dubstep music maker for any professional or amateur DJ, mixer, or electronic musician out there!\n\n\n===================================================================================\n\nPlease SEED &amp; ENJOY! More torrents? Do check me out! \n\n===================================================================================","torrent":{"xt":"urn:btih:793b7eacb0a5ba6581f530fc8d0fff8f1a15f06f","amp;dn":"Adictum+Electronic+Music+Maker+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"793b7eacb0a5ba6581f530fc8d0fff8f1a15f06f","infoHashBuffer":{"type":"Buffer","data":[121,59,126,172,176,165,186,101,129,245,48,252,141,15,255,143,26,21,240,111]},"announce":[],"urlList":[]}}