{"title":"Windows.Firewall.Control.v3.9.0.2.Incl.Keygen","uid":8145692,"size":660928,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d7723a150e374864e0340e0679d0b5d94a8beca&amp;dn=Windows.Firewall.Control.v3.9.0.2.Incl.Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Purplebeanz","files":3,"time":1360919186,"description":"Windows Firewall Control is a nifty little application which extends the functionality of the Windows Firewall and provides quick access to the most frequent options of Windows Firewall. It runs in the system tray and allows user to control the native firewall easily without having to waste time by navigating to the specific part of the firewall. This is the best tool to manage the native firewall from Windows 8, Windows 7 and Windows Vista. Windows Firewall Control offers four filtering modes which can be switched with just a mouse click:\n\nHigh Filtering - All outbound and inbound connections are blocked. This setting blocks all attempts to connect to and from your computer.\nMedium Filtering - Outbound connections that do not match a rule are blocked. Only programs you allow can initiate outbound connections.\nLow Filtering - Outbound connections that do not match a rule are allowed. The user can block the programs he don't want to initiate outbound connections.\nNo Filtering - Windows Firewall is turned off. Avoid using this setting unless you have another firewall running on your computer.\n\nProgram Features\nâˆš  Just one small executable file. All features are packed in the same file.\nâˆš  Intuitive and easy accessible interface in the system tray.\nâˆš  Full support with standard user accounts.\nâˆš  Possibility to create temporary rules.\nâˆš  Disable the ability of other programs to add Windows Firewall rules.\nâˆš  Multiple and easier ways of creating new rules in Windows Firewall.\nâˆš  Full support of creating, modifying and deleting Window Firewall rules.\nâˆš  Lock feature which can disable the access to the settings of the program.\nâˆš  Shell integration into the right click context menu of the executable files.\nâˆš  Search for invalid rules with the possibility to delete them.\nâˆš  Search for executable files through folders and create new rules in seconds.\nâˆš  View recently blocked connections and create new rules from the log.\nâˆš  Choose if you want the program to start at user logon.\nâˆš  Import and export the settings of the program.\nâˆš  Protection to unauthorized uninstallation.\nâˆš  Possibility to restore previous settings at uninstallation.\nâˆš  And many more. Just try it out.\n\nSystem Requirements\nâˆš  Microsoft .NET Framework version 4.0\nâˆš  Compatible with all 32bit and 64bit versions of Windows 8, Windows 7, Windows Vista, Windows Server 2008. Windows XP is not supported.\nâˆš  Windows Firewall service is required to be enabled for Windows Firewall Control to run.\nâˆš  DNS Client service is required to be enabled for the notifications to work properly.\n\nWhat's new in version 3.9.0.2 (14.02.2013)\n\n- Fixed: User settings are not persisted if the user uses the updater to update to\na new version: Manage Rules position, columns order and visibility, etc.\n- Fixed: The recommended rules from the previous version prevented Windows Update\nto check for new updates.\n- Fixed: When the user checks for updates, the download complete message appears\nbefore finishing the download and if the user tries to execute the file, it is still\nincomplete.\n- Fixed: The result dialog after creating a new rule from the Control Panel is\ndisplayed randomly on the screen instead of the Control Panel window.\n- Improved: When creating a new rule, the file name is displayed in front of the name\nfrom the assembly. They were switched for a better readability. \n\n                     - Installation -\n\n\nInstall and run keygen and enter activation id from program..\n","torrent":{"xt":"urn:btih:7d7723a150e374864e0340e0679d0b5d94a8beca","amp;dn":"Windows.Firewall.Control.v3.9.0.2.Incl.Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d7723a150e374864e0340e0679d0b5d94a8beca","infoHashBuffer":{"type":"Buffer","data":[125,119,35,161,80,227,116,134,78,3,64,224,103,157,11,93,148,168,190,202]},"announce":[],"urlList":[]}}