{"title":"Dr. Nikola's Experiment by Guy Newell Boothby","uid":8199862,"size":702655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d843bd45e05aec18e76136c463c7c2d17de4e7e&amp;dn=Dr.+Nikola%27s+Experiment+by+Guy+Newell+Boothby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"imarion","files":-1,"time":1361989687,"description":"This fourth novel of Boothby's Dr. Nikola series reveals that Nikola has discovered all of the facts necessary to extend a human being's life. He has studied science and magic secrets of Tibetan monks. He explains: &quot;It has been a long and tedious search, but such labour only makes success the sweeter. The machinery is now prepared; all that remains is to fit the various parts together. In six months' time, if all goes well, I will have a man walking upon this earth who, under certain conditions, shall live a thousand years.&quot;\n\nTo assist him, he hires a destitute young physician, who explains his predicament: &quot;As ill luck would have it, however, I had got into the wrong set, and before I had been two years in the hospital was over head and ears in such a quagmire of debt and difficulties that it looked as if nothing but an absolute miracle could serve to extricate me.&quot; That miracle seems to have come to him in the person of Dr. Nikola.\n\nThe nefarious and wealthy Nikola has purchased a remote castle in the north of England, where the seclusion will allow him and his new assistant and Nikola's deaf-mute malformed Chinese servant to conduct his grand experiment on a human subject. ","torrent":{"xt":"urn:btih:7d843bd45e05aec18e76136c463c7c2d17de4e7e","amp;dn":"Dr.+Nikola%27s+Experiment+by+Guy+Newell+Boothby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d843bd45e05aec18e76136c463c7c2d17de4e7e","infoHashBuffer":{"type":"Buffer","data":[125,132,59,212,94,5,174,193,142,118,19,108,70,60,124,45,23,222,78,126]},"announce":[],"urlList":[]}}