{"title":"THE ONE TRICK RIP-OFF - DEEP CUTS Hardcover (2013) (Image) (Son ","uid":8034158,"size":673709828,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7eaab78adf3d96d4765a1abf022c0f00745c5d97&amp;dn=THE+ONE+TRICK+RIP-OFF+-+DEEP+CUTS+Hardcover+%282013%29+%28Image%29+%28Son+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1358483297,"description":"English\nCBR\n290 pages\n642.50 MB\n\n------\n\nYoung lovers Tubby and Vim want to escape - escape the mistakes they've made, the lives they've lived, and the dirty city weighing them down. Their plan is simple - all they have to do is rip-off Tubby's pals, the One Tricks - the toughest street gang in LA. If they pull it off, they're set for life. If not, their lives won't matter much anyway. What was going to be a smooth, straight-forward heist becomes a fast-paced battle to the death.\n\nFrom Eisner Award-winning writer/artist PAUL POPE (Batman: Year 100, THB, Heavy Liquid, 100%) and presented for the first time in color by JAMIE GRANT (All-Star Superman). ONE TRICK RIP-OFF/DEEP-CUTS is 288 pages of raw power, of which over 150 pages are comprised of new, rare, and never before seen stories created during POPE's time traveling the world in the '90s. Included in the &quot;Deep Cuts&quot; section is a bounty of unpublished and rare work POPE did in the '90s, including the legendary &quot;Supertrouble&quot; manga, created for Kodansha in Japan, appearing here in print for the first time. It's a tour de force of pure, kinetic storytelling that will keep your eyes peeled until the very last page.\n\n------\n\nSTFmaryville says: Paul Pope is a 3-time Eisner Award winner at DC (for Solo and Batman: Year 100). The main story in this hardcover was originally serialized in Dark Horse Presents #101-112, way back in 1995-96. Image re-presents it in color in this volume, which came out yesterday ... and wow, great job and all credit to Son of Ultron-Empire for releasing the .cbr so swiftly!\n\nPlease seed and share for our friends on TPB.","torrent":{"xt":"urn:btih:7eaab78adf3d96d4765a1abf022c0f00745c5d97","amp;dn":"THE+ONE+TRICK+RIP-OFF+-+DEEP+CUTS+Hardcover+%282013%29+%28Image%29+%28Son+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eaab78adf3d96d4765a1abf022c0f00745c5d97","infoHashBuffer":{"type":"Buffer","data":[126,170,183,138,223,61,150,212,118,90,26,191,2,44,15,0,116,92,93,151]},"announce":[],"urlList":[]}}