{"title":"POtHS - Super Natural Realms - UFOs Angels Spirits Witches and D","uid":8032505,"size":5199681678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82e3de9cc4e53646bd8686eb156269b9375410ab&amp;dn=POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1358449708,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Super Natural Realms - UFOs Angels Spirits Witches and Demons Vol 41 - Spiritual Warfare\n\n\nPOtHS says: Yahweh the Creator needs NO SPACESHIP or Mechanical device to do what He does. There are 2 types of inter-dimensional travelers. Yahweh, Jesus, The Holy Spirit obviously and the unfallen (HEAVENLY) angels that require nothing mechanical to dimension travel, however, The Fallen Angels seem to have lost some of their power and need artificial means to manipulate the different dimensions. EVERYTHING coming in a spaceship is of Satan not The Holy Yahweh.\n\nDescription:\nEph 6:12; &quot;For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.&quot;\n\nRom 12:2; &quot;And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God. &quot;\n\nBetter to prepare yourself for the battles which we face today and those yet to come.  Learn insights from this download to help ready you and your loved ones in these devilish times.  The following files are contained in this download:\n\nCaryl Matrisciana - Spiritual Warfare\n\nComplete Armor - Preached By Pastor Dr Adrian Rogers\n\nDamnable Doctrines of The Matrix Disney World - Gary Price\n\nThe Warfare of Prayer - Dr Adrian Rogers\n\nWhy Some People Wont Get Saved by Dr Dennis Corle\n                     \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:82e3de9cc4e53646bd8686eb156269b9375410ab","amp;dn":"POtHS+-+Super+Natural+Realms+-+UFOs+Angels+Spirits+Witches+and+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e3de9cc4e53646bd8686eb156269b9375410ab","infoHashBuffer":{"type":"Buffer","data":[130,227,222,156,196,229,54,70,189,134,134,235,21,98,105,185,55,84,16,171]},"announce":[],"urlList":[]}}