{"title":"The.Block.All.Stars.AU.S06E19.WS.PDTV.XviD.BF1.avi","uid":8193211,"size":523632742,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:84fa9587f2fcb6bbba302409b154407919c19e72&amp;dn=The.Block.All.Stars.AU.S06E19.WS.PDTV.XviD.BF1.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigfish5","files":1,"time":1361878222,"description":"The Block All-Stars Series 6 Episode 19\n\nEpisode 19 I hear you ask? No, there is nothing wrong, you haven't missed an episode! The pedants amongst us want numbering according to the official site (which I don't look at), so here it is. I just number according to what is in the local program guide, and when it's shown. Hopefully this will shut them up.\n\nThe Block is Back - in the all new All-Stars format. The Block is back to it's root is Sydney, New South Wales.\n\nThe returning couples are:\n\nPhil and Amity are stepping back in time 10 years... and back onto The Block!\n\nMark and Duncan The tradie mates are back, but how will they keep up with their much-younger contestants?\n\nJosh and Jenna Densten (now newlyweds) are back with something to prove.\n\nDan and Dani's win-at-all-costs attitude rubbed their Block neighbours the wrong way in 2012. Now, they're determined to make amends.\n\nFour all star couples are given with the toughest renovation challenge they have ever faced. In just six weeks they will have to completely make over four heritage listed homes in one of the suburbs best streets.\n\nA week this big deserves big prize money and the teams find out just how much they'll win for their formal lounge, hallway and linen cupboards come room reveal. Phil has a special surprise in stall for his fellow Blockheads. \n\n","torrent":{"xt":"urn:btih:84fa9587f2fcb6bbba302409b154407919c19e72","amp;dn":"The.Block.All.Stars.AU.S06E19.WS.PDTV.XviD.BF1.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84fa9587f2fcb6bbba302409b154407919c19e72","infoHashBuffer":{"type":"Buffer","data":[132,250,149,135,242,252,182,187,186,48,36,9,177,84,64,121,25,193,158,114]},"announce":[],"urlList":[]}}