{"title":"The Wolf in Sheeps Clothing 720p","uid":8186834,"size":960784794,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8963c1d7b13dc1e48df03008692c1713aac1c50b&amp;dn=The+Wolf+in+Sheeps+Clothing+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":4,"time":1361741603,"description":"This short video was created to help make people realize how easily manipulated humans are and how &quot;The Powers That Be&quot; use it to their advantage and how &quot;The Powers That Be&quot; use certain techniques to have the average person do things, they wouldn't otherwise do or agree to.\n\nAlso do not believe everything you hear on TV or Radio. They are often owned by the same people that control everything.\n\nThink for yourself and make your own conclusions. Spread this video, upload it on YouTube, Vimeo, your own blog/website. The more widely spread the better. If you want to remix it and make it better, please feel free to do so.\n\nRight now, there's a big push to remove all semi-automatics from the US, claiming it will help reduce gun violence, crimes and mass shootings. After watching this video, maybe you'll realize what's really happening and why they are pushing for these semi-automatics to be removed from the law abiding citizen's hands.\n\nIf you don't realize it, it means you need to keep doing some research and educate yourself on &quot;WHY&quot; the Founding Fathers created the 1st and 2nd Amendment and why they chose the 2nd Amendment for &quot;the right to bear arms&quot;.\n\n\nPeace &amp; Love on Earth\n\n\nNOTE: The uncensored episodes are also available on The Pirate Bay. Search: Spartacus S03\nEpisodes used in this short video are: Spartacus S03E04 &amp; ending Spartacus S03E02","torrent":{"xt":"urn:btih:8963c1d7b13dc1e48df03008692c1713aac1c50b","amp;dn":"The+Wolf+in+Sheeps+Clothing+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8963c1d7b13dc1e48df03008692c1713aac1c50b","infoHashBuffer":{"type":"Buffer","data":[137,99,193,215,177,61,193,228,141,240,48,8,105,44,23,19,170,193,197,11]},"announce":[],"urlList":[]}}