{"title":"stockings.all.over.StreetMeatAsia.com.mp4","uid":8142261,"size":484847616,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:912ad389ecc9382e263cfea719ae7de26df5b3cf&amp;dn=stockings.all.over.StreetMeatAsia.com.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":-1,"time":1360839874,"description":"You might well have heard of David Icke, and the fight against the controlling reptilian lizard people who rule our world, interbreeding with the rich and famous and able to 'shape shift' to change form. These high order reptiles are multi-dimensional beings, who feed off of the negative energy of our pain, suffering and hatred. This is why StreetMeatAsia.com is joining the fight, and helping him with his quest to expose these hideous creatures. Sex produces positive energy. Unhindered sex with gorgeous lithe Asian girlies with soft silky skin makes you feel good. The perfect tits sticking out of this girl's body stockings, well that makes you feel good. So you understand about the positive energy. Lizard people are dead against sex and the enjoyment of life. So David Icke is being asked to perform in one of our movies, to show how sexual energy can be produced, and free the individual from the deadly controlling influence exerted on our world. Now this videos clearly demonstrates both sides of this energy. Please watch. Note how this girl is clearly under remote control at the beginning, looking unhappy with complete lizard bimbo mummification. Then as the sexual energy pervades, she becomes free, excited and happy, and the spirit is fulfilled. ","torrent":{"xt":"urn:btih:912ad389ecc9382e263cfea719ae7de26df5b3cf","amp;dn":"stockings.all.over.StreetMeatAsia.com.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912ad389ecc9382e263cfea719ae7de26df5b3cf","infoHashBuffer":{"type":"Buffer","data":[145,42,211,137,236,201,56,46,38,60,254,167,25,174,125,226,109,245,179,207]},"announce":[],"urlList":[]}}