{"title":"Idle No More~2013 01 16  AJE Inside Story Americas","uid":8038761,"size":73375232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94299b5aa23db0c3af1da82534c8b4078f192e61&amp;dn=Idle+No+More%7E2013+01+16++AJE+Inside+Story+Americas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shunster","files":1,"time":1358573594,"description":"Idle No More~2013 01 16  AJE Inside Story Americas\n\n\n70mb/25ms/mp4\n\n\n\nCan an aboriginal protest movement and the rest of Canada's indigenous community force the Harper government to change? The Idle No More movement in Canada, a nationwide call to action by aboriginals, has gained significant momentum in recent weeks. \n\n\n&quot;Canada has consistently failed to live up to its obligations .... There is not a lot of good faith all the way around in this relationship.&quot; - Pamela Palmater, a spokesperson for the Idle No More movement\n\nIt all began as opposition to a far-reaching set of laws introduced by Stephen Harper, Canada's prime minister. The movement says that among other provisions, Omnibus Bill C-45 threatens aboriginal treaty agreements and sovereignty.\n\nOn December 11, Chief Theresa Spence began a hunger strike in protest against the bill. More protests spread across the country and even internationally.\n\nThe movement has brought together various aboriginal groups in Canada, who are fed up with their living conditions and treatment, in an attempt to secure talks and potential negotiations with Harper over violations of First Nations treaties and protection of land and water claims.\n\n&quot;Essentially what Harper has done is done us a favour. He is bringing all the people together, not just indigenous peoples but Canadians as well, because of the kinds of corrupt laws that he is passing, because he's a majority government and it's an abuse of power, it's a racist attitude.&quot; - Ellen Gabriel, the chief negotiator during the Oka crisis\n\nMany of the more than one million indigenous people live in poverty. They lack clean water, housing and proper sanitation. The movement has also mobilised environmental activists and those who feel the Canadian government has been acting undemocratically.\n\nBut, while the movement is united in its cause not everyone agrees on the best approach to make the Harper government back down. So, can Idle No More and the rest of Canada's indigenous community come together and force the government to act?\n\nJoining Inside Story Americas, with presenter Shihab Rattansi, are guests: Pamela Palmater, a spokesperson for the Idle No More movement; Grand Chief Derek Nepinak from the province of Manitoba; and Tim Powers, a former government adviser on aboriginal affairs. (Edit)\n\nFlv: &lt;a href=&quot; http://www.aljazeera.com/programmes/insidestoryamericas/2013/01/20131167814118428.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.aljazeera.com/programmes/insidestoryamericas/2013/01/20131167814118428.html&lt;/a&gt;\n\nshunster\n","torrent":{"xt":"urn:btih:94299b5aa23db0c3af1da82534c8b4078f192e61","amp;dn":"Idle+No+More%7E2013+01+16++AJE+Inside+Story+Americas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94299b5aa23db0c3af1da82534c8b4078f192e61","infoHashBuffer":{"type":"Buffer","data":[148,41,155,90,162,61,176,195,175,29,168,37,52,200,180,7,143,25,46,97]},"announce":[],"urlList":[]}}