{"title":"Turning Points: A Journey Through Challenges [ mobi &amp; epub]","uid":8130519,"size":3961420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:948aaf499d4325d7bbab29d573008d3ec28e41f3&amp;dn=Turning+Points%3A+A+Journey+Through+Challenges+%5B+mobi+%26amp%3B+epub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"rebel2301","files":1,"time":1360594072,"description":"It was like any other day on the Anna University campus in Chennai. I had delivered a lecture Vision to Mission and the session got extended from one hour to two. I had lunch with a group of research students and went back to class. As I was returning to my rooms in the evening the vice- chancellor, Prof. A. Kalanidhi, fell in step with me. Someone had been frantically trying to get in touch with me through the day, he said. \n\nIndeed, the phone was ringing when I entered the room. When I answered, a voice at the other end said, The prime minister wants to talk with you ... Some months earlier, I had left my post as principal scientific adviser to the government of India, a Cabinet-level post, to return to teaching. Now, as I spoke to the PM, Atal Bihari Vajpayee, my life was set for an unexpected change. \n\nTurning Points takes up the incredible Kalam story from where Wings of Fire left off. It brings together details from his career and presidency that are not generally known as he speaks out for the first time on certain points of controversy. It offers insight not only into an extraordinary personality but also a vision of how a country with a great heritage can become great in accomplishment, skills and abilities through effort, perseverance and confidence. It is a continuing saga, above all, of a journey, individual and collective, that will take India to 2020 and beyond as a developed nation. \n\nAbout the Author\nA.P.J. Abdul Kalam was the eleventh president of India, from 2002 to 2007. He is a recipient of the countrys highest civilian awards, including the Bharat Ratna, and has authored several best-selling books.","torrent":{"xt":"urn:btih:948aaf499d4325d7bbab29d573008d3ec28e41f3","amp;dn":"Turning+Points%3A+A+Journey+Through+Challenges+%5B+mobi+%26amp%3B+epub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"948aaf499d4325d7bbab29d573008d3ec28e41f3","infoHashBuffer":{"type":"Buffer","data":[148,138,175,73,157,67,37,215,187,171,41,213,115,0,141,62,194,142,65,243]},"announce":[],"urlList":[]}}