{"title":"Maia - Maia [2010] [FLAC]","uid":8188123,"size":227182920,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:95fadc3bcd4ad8b7ffad2cd7c44ca57c6b9969df&amp;dn=Maia+-+Maia+%5B2010%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":16,"time":1361769685,"description":"Another one of those albums that appeared on my seedbox somehow\n\nArtist: Maia\nRelease: Maia\nDiscogs: 3206631\nReleased: 2010\nLabel: Vandal Records\nCatalog#: VCD 23\nFormat: CD, Album, Limited Edition\nCountry: UK\nStyle: Folk, World, &amp; Country, Space Rock, Pop Rock, Folk, Disco\n\nTracklisting:\n\n01. In The Springtime\n02. Windowsill Smoke\n03. Dead Centre\n04. Cargo\n05. Fossil Minds\n06. Samba Song\n07. Hearts On The Hook\n08. Ripe Afternoon\n09. Pigs In\n10. Sidelines\n11. Melons\n12. Windmill\n\n\n\nAfter being rather impressed by their late night performance at The Unthanks' Trades Club after-show/tour party in Hebden Bridge, I thought a few words were in order to make up for having missed Maia's debut album when it was first released just over a year ago. Sandwiched between two pieces of plywood, held together in a fragile manner with some flimsy cotton braiding and then branded with the band's distinctive logo, their eponymous debut reveals a dozen highly original songs from the pen of frontman, guitar player and main singer Tom Clegg. \n\nAt the Trade's gig, Maia's so called Sci-Fi Folk was as fresh as the milk served in the Moloko Milk Bar, the Clockwork Orange reference emphasised further by Joe Haig's uncanny resemblance to the young Malcolm McDowell, especially on the first couple of numbers, during which the trumpet/keyboard player donned a black bowler. It wouldn't be too difficult to imagine him heading off for some ultra-violence in the sleepy Calderdale town after the show, or doing a bit of the old in out in out with some unsuspecting Hebden Bridge devotchka. I'm conscious however, of the fact that I have needlessly digressed.\n\nThe music created by these two young players, together with Simon Robinson on guitar, banjo, ukulele and vocals and Will Fletcher on drums and percussion, is refreshingly new and experimental, yet maintains an acoustic feel throughout. The trumpet and banjo provide the band with their distinctive sound, the mariachi-style trumpet sound bringing the same sort of energy to the band's make up as it did for Arthur Lee's Love a few decades ago. The song compositions rarely plod through conventional 4/4 mode, exploring frequent tempo changes and experimental interplay between percussion and keyboards on Ripe Afternoon or banjo and trumpet on Pigs In, to give but two examples.\n\nThe influences are so wide and varied that it's actually difficult to pinpoint a precident for Maia's music. There are obviously Eastern influences coming through on Windmill, as there are Iberian flamenco rhythms present in Dead Centre. Each of the musicians get a fair crack of the whip on MAIA, with none of the instruments taking a back seat. The percussion is always clearly audible, together with each of the melodic instruments, with a consistently crisp acoustic guitar sound throughout. This is clearly a young band who adhere to group democratics, which in turn makes for good listening both live and on record. A band to watch out for.","torrent":{"xt":"urn:btih:95fadc3bcd4ad8b7ffad2cd7c44ca57c6b9969df","amp;dn":"Maia+-+Maia+%5B2010%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95fadc3bcd4ad8b7ffad2cd7c44ca57c6b9969df","infoHashBuffer":{"type":"Buffer","data":[149,250,220,59,205,74,216,183,255,173,44,215,196,76,165,124,107,153,105,223]},"announce":[],"urlList":[]}}