{"title":"Belly by sandra Vol 2 Bellydance Isolations and combinations wit","uid":8321909,"size":705944605,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9a9b17b30a842a2a46f805065365c9f335a05b51&amp;dn=Belly+by+sandra+Vol+2+Bellydance+Isolations+and+combinations+wit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sara_melika","files":1,"time":1364693522,"description":"The second volume in Sandra's popular Belly By Sandra DVD series, Vol. 2: Isolations and Combinations will rapidly improve your bellydance technique with engaging and fun routines that help find the dancer in even the newest of students. This extended length 2 hour, 20 -minute DVD starts with all-new isolations and then combines them into short rhythmic sequences that feel more like dancing and less like simple exercises. By practicing and mastering these combinations you will build a vocabulary of techniques that are the foundation of real-world choreography and performance. More than just an instructional and exercise video, you will learn how to see, feel, and reproduce the movements that make bellydance so beautiful. Sandra explains techniques in comprehensive detail including their grounding in anatomy, muscle control, and internal visualization. By breaking down complex movements into simple transitions, Sandra demystifies even the most complex bellydance concepts and makes them accessible to the widest possible range of dancers. ","torrent":{"xt":"urn:btih:9a9b17b30a842a2a46f805065365c9f335a05b51","amp;dn":"Belly+by+sandra+Vol+2+Bellydance+Isolations+and+combinations+wit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a9b17b30a842a2a46f805065365c9f335a05b51","infoHashBuffer":{"type":"Buffer","data":[154,155,23,179,10,132,42,42,70,248,5,6,83,101,201,243,53,160,91,81]},"announce":[],"urlList":[]}}