{"title":"Garrow's Law - Season 2 -  DutchReleaseTeam-DVDRIP-NLSubs","uid":7969708,"size":2094020504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9c1f866fc4c35f26c808c02fb91fea037897117d&amp;dn=Garrow%27s+Law+-+Season+2+-++DutchReleaseTeam-DVDRIP-NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Recon06","files":10,"time":1356797215,"description":"Garrow's Law - Season 2 -  DutchReleaseTeam-DVDRIP-NLSubs\n\n[img]http://qpbs.imageg.net/graphics/product_images/pPBS3-11104601dt.jpg[/img]\n\nThis a costume drama and period piece based on real people and true facts all set in the 18th century. It is drawn from the actual history of a young lawyer who fundamentally changed the legal system in England at a time when unfair advantage formed the foundation of corruption and defined the war between the classes of rich and landed nobles, and working class people. Not only is it well acted, but the subjects treated in Garrow's cases are pertinent and timely to our own affairs of today. Enjoy a positive story about the struggle for truth, justice and the dignity of honest men and women no matter their lot in life.\n\nActors: Andrew Buchan, Alun Armstrong, Victoria Balnaves, Anthony Bowers, Stephen Boxer\nGenres: Biography, Costume drama\nLanguage: English\nSubtitles: Dutch\nFilming Locations: Dumbarton, West Dunbartonshire, Scotland, UK\n\n[url=http://www.imdb.com/title/tt1477131/][img]http://hetmultimediacafe.nl/images/afbeeldingen/imdb.png[/img][/url]\n\nkCnrtnUyj2M[/youtube]\n\nBarrister William Garrow (Andrew Buchan) was a real-life 18th-century Perry Mason, coining the phrase &quot;innocent until proven guilty.&quot; In this dramatic series based on Garrow's life, the relentless defense attorney takes up a prosecutor's role, when a slave-ship owner is accused of fraud in the deaths of 133 passengers thrown off a ship at sea. Next, he defends a whistleblower who protests abuse of disabled sailors.\n\n\nEpisode #2.1\nGarrow is approached by the directors of the Liverpool Assurance insurance company to prosecute Captain Collingwood for insurance fraud. He threw overboard 133 African slaves whom he was transporting to Jamaica,allegedly to save supplies as he was off-course but the insurers claim this was caused by his poor seamanship. Then Garrow meets Gustavus Vassa,a freed slave who wants the charge altered to murder even though,in the law,slaves are classed as cargo and not persons. Garrow accepts Vassa's plaint and,backed by some surprising witnesses,makes the charge stick,...\n\nEpisode #2.2\nGarrow defends young army captain Robert Jones,who faces the death penalty after David Jasker,whose failing shoe-maker's shop is patronised by Jones,accuses him of sexually assaulting him. Jones seemingly has a girl-friend but Southouse learns that she is a keeper of a Molly-house,or male brothel and that Jones chiefly prefers sex with men. Jones confesses to Garrow that he and Jasker are actually lovers but that Jasker's wife has trumped up the charge so that they do not have to repay a loan from Jones. Garrow depends on that love for Jasker to do the right thing in court and save his lover from the gallows. Hill sets out to sue Garrow and ruin him financially.He employs slimy lawyer Farmer to provide false evidence that Sarah and Garrow were seen embracing in the hotel where she lives after Hill threw her out and bullies Sarah's maid Mary into lying that she witnessed them.\n\nEpisode #2.3\nRetired British sailors at the charitably-run Greenwich Hospital are being starved and abused and when the hospital's manager,honest Captain Baillie,reports the abuse to the Admiralty,he is charged with malicious libel,his main accuser being Hill,the Under Secretary at the Admiralty. Southouse discovers corruption among the governors of the hospital which Garrow exposes in court,exonerating Captain Baillie at Hill's expense. However,Garrow's private life seems less successful as,whilst Sarah has refused to admit that Garrow is Samuel's father,she sees them as having no future together.\n\nEpisode #2.4\nGarrow, despite Sarah's assurances, in a deeply depressed mood having failed to save Thomas Whiley, a twelve-year old-mute boy, from the gallows, enters the civil court to hear Hill's accusation of adultery against him. Silvester, previously his adversary, defends him in the spirit of fair play and does well, demolishing the prosecution witnesses, Hill's Admiralty cronies. Meanwhile, Sarah's loyal maid Mary refuses to perjure herself and it is the dogged and devoted Southouse who saves the day by bringing in a surprise, last minute witness to expose Hill's hypocrisy.\n","torrent":{"xt":"urn:btih:9c1f866fc4c35f26c808c02fb91fea037897117d","amp;dn":"Garrow%27s+Law+-+Season+2+-++DutchReleaseTeam-DVDRIP-NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1f866fc4c35f26c808c02fb91fea037897117d","infoHashBuffer":{"type":"Buffer","data":[156,31,134,111,196,195,95,38,200,8,192,47,185,31,234,3,120,151,17,125]},"announce":[],"urlList":[]}}