{"title":"IMAGE COMICS WEEK OF 2013.03.27","uid":8315812,"size":732247106,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9da22c01a24065c23e8e1c18c9df04729771786e&amp;dn=IMAGE+COMICS+WEEK+OF+2013.03.27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"STFmaryville","files":-1,"time":1364584726,"description":"I get quite a few requests for these titles whenever they haven't been posted. I might do this every Friday morning if it seems useful to the community. Let me know in the comments.  --STFmaryville\n\n------\n\nClone #5\nIn a war he never knew existed, Luke Taylor stands to lose everything. His wife. His baby. His identity. Even if Luke can lead the rebels to victory, will his life ever be the same? Find out in the conclusion of the first CLONE arc!\n\n------\n\nDia De Los Muertos #2 (of 3)\nInspired by the Mexican Day of the Dead, artist extraordinaire, RILEY ROSSMO (DEBRIS, GREEN WAKE, COWBOY NINJA VIKING, REBEL BLOOD) joins forces with nine different writers over three issues to tell tall tales from beyond the grave!\n\nThis issue's featured writers are JEFF MARIOTTE (FADE TO BLACK), ED BRISSON (COMEBACK) and JOSHUA WILLIAMSON (XENOHOLICS).\n\nIn this issue: Cartel soldiers visit the pits of Hell, a visitor to Mexico stumbles onto a black mass, and a man heart broken at the loss of his wife is reunited with her beyond the grave.\n\n------\n\nEast of West #1\n&quot;OUT OF THE WASTELAND&quot;\nThe things that divide us are stronger than the things that unite us. A Sci-Fi Western set in a dystopian America where all hope for the future rests in the Four Horsemen of the Apocalypse...who just happen to be trying to kill the President of the United States.\n\nOne of the most exciting new books of the year, this is EAST OF WEST, a brand new, ongoing, monthly comic from the award-winning team of Marvel's FF, JONATHAN HICKMAN and NICK DRAGOTTA.\n\n------\n\nFatale #13\nIt's the curse of the Femme Fatale in the old west, for those who like horror and noir in their spaghetti western. Another standalone FATALE FLASHBACK issue, and a perfect place for new readers to jump on board!\n\nAnd remember each issue of FATALE contains extra content, articles and artwork that are not available anywhere but the printed single issues.\n\n------\n\nFive Weapons #2 (of 5)\nTyler barely escapes the knife club only to become the target of both the stick club and every teacher in the school of Five Weapons.  This time the faculty plans to beat Tyler at his own game and embarrass him in front of the whole school.\n\nThe latest series from fan-favorite creator, Jimmie Robinson!\n\n------\n\nHack/Slash #25\n&quot;FINAL,&quot; Conclusion\nCassie battles Samhain to the death.\n\nQ: Who will survive and what will be left of them?\nA: Not everyone, and very small bits.\n\nThe blood spattered, panty-flashing saga of HACK/SLASH comes to an end in this epic issue!\n\n------\n\nThe Legend of Luther Strode #4 (of 6)\nLuther versus.....Jack the Ripper?!\n\n------\n\nMorning Glories #25\nDOUBLE-SIZED 25th ISSUE - and the Season One Finale! Featuring three interconnected covers by rising superstar RODIN ESQUEJO!\n\n&quot;8:13&quot;\n\n------\n\nPlanetoid #5\nWarfare ensues as the tyrannical forces of the Ono Mao attempt to wipe out the planetoid's only hope for civilization!\n\n------\n\nSavage Skullkickers #1\nSAVAGE SKULLKICKERS: a modern reinterpretation that gets back to the roots of these timeless characters. It's a bold new direction, a continuing story and a newly added adjective! Our twentieth issue is brand a new #1! Welcome to comic math.\n\n------\n\nThink Tank #6\nSlacker Genius Dr. David Loren can hack into the military industrial complex computer network to reclassify 3-Quinuclidinyl Benzilate from a class 2 pathogen to a class 5 pathogen. He can disassemble the micro-power device of Dr. Sejic to appropriate its extensive battery life for his surface thought reader. But can he save himself from the confines of his own mind?\n\n------\n\nWitch Doctor: Mal Practice #5\nIn one corner: Dr. Vincent Morrow, the Witch Doctor. In the other: the parasite he's been infected with. And you won't believe where the battlefield is! Physician, heal thyself - or else!\n\n &quot;A superbly smart and riveting medical thriller filled with off-the-wall characters&quot; - Fangoria\n","torrent":{"xt":"urn:btih:9da22c01a24065c23e8e1c18c9df04729771786e","amp;dn":"IMAGE+COMICS+WEEK+OF+2013.03.27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da22c01a24065c23e8e1c18c9df04729771786e","infoHashBuffer":{"type":"Buffer","data":[157,162,44,1,162,64,101,194,62,142,28,24,201,223,4,114,151,113,120,110]},"announce":[],"urlList":[]}}