{"title":"Pink Floyd - The Wall [HD] 720X1280 MP4 1.68GB","uid":8081023,"size":1807775191,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9fbff6b05e057e0aa139c4b803ffbd53ee4f4d4f&amp;dn=Pink+Floyd+-+The+Wall+%5BHD%5D+720X1280+MP4+1.68GB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"hubjanopo","files":-1,"time":1359499191,"description":"Pink Floyd The Wall (1982)\n\nThe film depicts the construction and ultimate demolition of a metaphorical wall, representing alienation.\n\nPink, the protagonist (and unreliable narrator) of the film, is a rock star, one of several reasons behind his apparent depressive and detached emotional state. He is first seen in a quiet hotel room, having trashed it. The opening music is not by Pink Floyd, but is the Vera Lynn recording of &quot;The Little Boy that Santa Claus Forgot&quot;. During the following scenes, it is revealed that Pink's father, a British soldier, was killed in action in the course of World War II in Pink's infancy, a reference to the death of Roger Waters' real-life father, Eric Fletcher Waters, in combat in Italy during Operation Shingle (the Battle of Anzio) in February 1944.\n\nThe film then flashes back to Pink as a young English boy growing up in the early 1950s. Throughout his childhood, Pink longs for a father figure after he learns his father died in the war. At school, he is humiliated for writing poems in class. The poems that the teacher seizes from him and reads aloud are lyrics from &quot;Money&quot; from The Dark Side of the Moon. After the teacher reads the poem out loud, Pink starts hallucinating the music video of &quot;Another Brick in the Wall&quot;. Pink is also affected by his overprotective mother. He eventually gets married, but he and his wife grow apart and she has an affair while Pink is on tour. When Pink learns of the affair, he compensates with expensive materialistic possessions and turns to a willing groupie, whom he brings back to his hotel room only to trash it in a fit of violence, causing the groupie to flee in terror.\n\nPink slowly begins to lose his mind to metaphorical &quot;worms&quot;. He shaves off all of his body hair and his eyebrows (an incident inspired by former bandmate Syd Barrett, who appeared at a 1975 recording session of Wish You Were Here, having shaved his eyebrows, head hair, and body hair) and, while watching The Dam Busters (1955) on television, morphs into his neo-Nazi alter-ego. Pink's manager, along with the hotel manager and some paramedics, discover Pink and inject him with drugs to enable him to perform. The drugs cause Pink to hallucinate and he fantasises that he is a dictator and his concert a neo-Nazi rally. His followers proceed to attack ethnic minorities, and Pink holds a rally in suburban London, singing &quot;Waiting for the Worms&quot;. The scene is intercut with images of animated marching hammers that goose-step across ruins. Pink screams &quot;Stop!&quot; and takes refuge in a bathroom stall at the concert venue, reciting poems which would later be used as lyrics on Pink Floyd's &quot;Your Possible Pasts&quot; from The Final Cut album and &quot;5:11 AM (The Moment of Clarity)&quot; from Roger Waters' The Pros and Cons of Hitch Hiking. In an animated sequence, Pink puts himself on trial. He is depicted as a small, pink rag doll that rarely moves.\n\nThe film concludes with several children cleaning up a pile of debris after an earlier riot, with a freeze-frame on one of the children emptying a Molotov cocktail lasting until the credits.\n\nMedia Info:\n\nGeneral\n\nFormat                           : MP4\nFile size                        : 1.68 GB\nDuration                         : 1:35:40\nOverall bit rate                 : 2349 Kbps\nMovie name                       : Pink Floyd - The Wall (1982)\nWriting application              : NCH.VideoPad.2.11\nOriginal source form/Name        : DVD_VIDEO\n\nVideo\n\nWidth                            : 1280 pixels\nHeight                           : 720 pixels\nDisplay aspect ratio             : 1.78:1\nFrame rate                       : 29.976 fps\n\nAudio\nID     \n\nFormat                           : MPEG Audio\nDuration                         : 1h 35mn\nBit rate                         : 165 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 48.0 KHz\n\nscan: \n\nMalwarebytes Anti-Malware 1.70.0.1100\n\nDatabase version: v2013.01.29.10\n\nWindows 7 Service Pack 1 x64 NTFS\n\n1/29/2013 3:37:31 PM\nmbam-log-2013-01-29 (15-37-31).txt\n\nScan type: Custom scan (UsersxxxVideosPink Floyd - The Wall (1982).mp4|)\n\nTime elapsed: 8 second(s)\n\nMemory Processes Detected: 0\n(No malicious items detected)\n\nMemory Modules Detected: 0\n(No malicious items detected)\n\nRegistry Keys Detected: 0\n(No malicious items detected)\n\nRegistry Values Detected: 0\n(No malicious items detected)\n\nRegistry Data Items Detected: 0\n(No malicious items detected)\n\nFolders Detected: 0\n(No malicious items detected)\n\nFiles Detected: 0\n(No malicious items detected)\n","torrent":{"xt":"urn:btih:9fbff6b05e057e0aa139c4b803ffbd53ee4f4d4f","amp;dn":"Pink+Floyd+-+The+Wall+%5BHD%5D+720X1280+MP4+1.68GB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fbff6b05e057e0aa139c4b803ffbd53ee4f4d4f","infoHashBuffer":{"type":"Buffer","data":[159,191,246,176,94,5,126,10,161,57,196,184,3,255,189,83,238,79,77,79]},"announce":[],"urlList":[]}}