{"title":"save2pc Ultimate 5.2.5.1424 Retail [ChingLiu]","uid":8046047,"size":15461034,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a364e4a3bbba42c21c6b02d55edf161c5d773540&amp;dn=save2pc+Ultimate+5.2.5.1424+Retail+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ching_Liu","files":-1,"time":1358748342,"description":"Save2pc (formerly known as YouTube Downloader) allows you to easily grab and save desired youtube video. The user interface of save2pc is very simple, so you don't need any technical knowledge to use it. No need to use scripts for web browsers. Just run save2pc and start downloading! save2pc is a small, fast, useful, practical and powerful. It has a clean, simple interface. save2pc Light is a free tool that downloads videos from Youtube or Google Video and saves it as Avi or Mpeg or Flv file to your local computer. Download High Quality videos and High Definition videos from YouTube. Simply paste the URL of a video into the program, press Start , and the AVI, MPEG or FLV file will be downloaded into the selected folder. You dont need any players to play flash video just play it on the default media player clasic. save2pc is a completly FREE Software. save2pc will work with Windows 95, 98, Me, NT, 2000, XP, 2003, Vista operating systems.\n \nsave2pc doesn't support Adobe's Secure RTMP Measures.\n \n13 reasons why you should get the save2pc:\n 1. Download videos from Youtube and save it as Avi, MPEG, FLV file to your PC or Laptop. Lte \n2. Download videos from Google, Tangle, Godtube, Vimeo, Myspace, Break.com,TeacherTube,Guba, DailyMotion. Std\n 3. Download videos from adult video servers: RedTube, PornoTube, Tube8, xTube, Spankingtube, YouPorn, Megaporn, PornHub, yuvutu. Pro\n 4. Download videos from veoh, xVideos, xHamster, VHO, Rude. Ult\n 5. Download High Quality videos and High Definition videos. Ult\n 6. Automatic URL-parsing and multi-thread downloading. Download several files at the same time. Std\n 7. Convert downloaded videos to iPod, Sony PSP, Zune, PDA, iPhone, cell phone, Palm, Pocket PC. Pro\n 8. Save the downloaded video into various formats: .avi, .mpeg, .flv or even .wmv. Std\n 9. Convert downloaded videos into extra mobile devices and audio formats: mov,mp4,3gp,3g2,mp3,wav. Pro\n 10. Preview selected videos before downloading. Get the size, length, rating, views of a file before downloading it! Std\n 11. Youtube flagged content age verification bypass. You don't even need to create an account to download such videos. Std\n 12. save2pc is a small, fast, useful, practical and powerful. It has a clean, simple interface. Lte\n 13. Free lifetime technical support. Registred users can suggest new video sites or any other features. Std\n\nUltimate: The Ultimate edition is the best edition available, packed with features and benefits. It allows the user to download High-Definition and High-Quality videos and supports for more than 30+ top video sharing sites. Another great feature is an adaptive download accelerator, that will increase the speed of your downloads by 200%.\n \nLanguage : English\n \nHomepage :  &lt;a href=&quot;\nhttp://www.save2pc.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.save2pc.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:a364e4a3bbba42c21c6b02d55edf161c5d773540","amp;dn":"save2pc+Ultimate+5.2.5.1424+Retail+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a364e4a3bbba42c21c6b02d55edf161c5d773540","infoHashBuffer":{"type":"Buffer","data":[163,100,228,163,187,186,66,194,28,107,2,213,94,223,22,28,93,119,53,64]},"announce":[],"urlList":[]}}