{"title":"Retrovirus-COGENT","uid":8157389,"size":1079363501,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a47ecbbcdf4a302bd6cb66002c64312b993da018&amp;dn=Retrovirus-COGENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gh0stNet","files":2,"time":1361187517,"description":"    Retrovirus\n     \n    Release Date: 31/01/2013\n    Protection: Steam API\n     \n    Info\n    =====\n    Retrovirus is a six degrees of freedom shooter which sends players into the depths of a computer on a search and destroy mission against an invasive virus. Retrovirus is being created by Cadenza Interactive, the indie studio behind the popular tower defense game Sol Survivor\n     \n    Players take command of an antivirus program, armed with the tools necessary to erase the virus very existence from the system. Movement and exploration are core to the gameplay, and players are encouraged to adapt to the demands of a world where free flight is the norm. Of course, the virus is armed to fight back, and first person shooter combat features heavily as players test their level of comfort with movement within the machine environment. Each player is able to customize their antivirus program with different plugins, allowing for a variety of approaches to a given situation\n     \n    The Retrovirus single player campaign focuses on the core story of the game, with the players goal being the eradication of the virus and the discovery of its origins. To defeat the virus, the player must solve puzzles, engage in dogfight-style combat, and explore the depths of the virtual world\n     \n    Retrovirus also features multi-player modes, designed to engage players social and competitive sides. Co-operative multi-player allows players to complete the campaign of the game with a friend, teaming up to restore the system to working order. Competitive multi-player will focus on the core of the six degrees of freedom shooter, hearkening back to the action-oriented shooters of the late 90s and early 00s.\n     \n    More info\n    ==========\n   &lt;a href=&quot; http://store.steampowered.com/app/227800/?snr=171513&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://store.steampowered.com/app/227800/?snr=171513&lt;/a&gt;\n     \n    Install\n    ========\n    1. Extract\n    2. Install\n    3. Copy Contents of Crack directory to the install directoy\n    4. Play the game\n     \n    Notes\n    ==========\n    Don't forgent to install XNA4.0 from the folder Redistributables ","torrent":{"xt":"urn:btih:a47ecbbcdf4a302bd6cb66002c64312b993da018","amp;dn":"Retrovirus-COGENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a47ecbbcdf4a302bd6cb66002c64312b993da018","infoHashBuffer":{"type":"Buffer","data":[164,126,203,188,223,74,48,43,214,203,102,0,44,100,49,43,153,61,160,24]},"announce":[],"urlList":[]}}