{"title":"00 CAVE MAPS","uid":8060893,"size":635809447,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:a58d884add3abc8fc9fbf35bedf5b1cb83194109&amp;dn=00+CAVE+MAPS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jjijj","files":-1,"time":1359063088,"description":"700+ maps of caves from the Missouri department of natural resources.\n\n\nAdditional screens:\n &lt;a href=&quot;\nhttp://i.imgur.com/3SJx5uN.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/3SJx5uN.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/B2ry2uC.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/B2ry2uC.png&lt;/a&gt;\n\n\nFrom the text file:\n\n\nThis CD includes cave maps on file with the Missouri Department of Natural Resources for the specified counties as of August 15, 2005.  Maps that are part of individual cave files and not recorded with the map files have not been included.  \n\nThe maps on this CD were created by many different authors.  They include employees of government agencies, the Cave Research Foundation, the Missouri Speleological Survey and its affiliated grottos and members, and many independent cavers.  The authors are identified in the titling on the maps and in the map index.  Many of the maps are copyrighted and should not be reproduced for distribution or publication without permission of the author.  Please respect all of the authors and credit their work if the maps are used in any publication.\n\nThe maps are all in a jpeg image format.  Many of the file sizes are large and cannot be viewed with the freeware image viewers.  Most commercially available software for working with images will accommodate these files.\n\nIndices to the maps include an ACCESS database and a text file.\n\nFile names consist of the Missouri Speleological Survey accession number, followed by the date, and then page numbers and letters if the map was scanned or mapped in segments.  Maps that were scanned in sections were not pieced back together and must be spliced by the user if so desired.\n\nIndividuals or groups who use these maps to visit the caves are expected to respect the caves and the property owners.  Care should be taken to not damage the cave or its contents and permission should always be obtained before visiting a cave.  Many of the caves are seasonally closed to protect endangered species and/or are gated.  Cave locations are not included on this CD.  Locations must be obtained from the Missouri Speleological Survey or one of its affiliated grottos (www.mospeleo.org).\n\nThe maps on this CD were scanned and edited for alignment and image quality by Phillip Streamer, Missouri Department of Natural Resources, Geological Survey and Resource Assessment Division, Rolla, MO.  The CD was originally compiled by Hal Baker with additional editing and file naming by Tom Clifton and Hal Baker, Missouri Caves and Karst Conservancy.  This file was updated in August 2005 by Tim Bixler and Jeff Crews.","torrent":{"xt":"urn:btih:a58d884add3abc8fc9fbf35bedf5b1cb83194109","amp;dn":"00+CAVE+MAPS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a58d884add3abc8fc9fbf35bedf5b1cb83194109","infoHashBuffer":{"type":"Buffer","data":[165,141,136,74,221,58,188,143,201,251,243,91,237,245,177,203,131,25,65,9]},"announce":[],"urlList":[]}}