{"title":"The Dark Night Saga [1080p] Upload By [Spectre]","uid":8071384,"size":37590162935,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a65ff82726d784e3a175ec10bb2f7bc264a87e55&amp;dn=The+Dark+Night+Saga+%5B1080p%5D+Upload+By+%5BSpectre%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spectre07","files":32,"time":1359284986,"description":" Batman Begins (2005)\nMain article: Batman Begins\n\nDirector/writer Christopher Nolan and co-writer David S. Goyer began work on Batman Begins in early 2003[68] and aimed for a darker and more realistic tone, with humanity and realism being the basis of the film.[69] The film, which was primarily shot in the United Kingdom and Chicago,[70][71] relied on traditional stunts and scale models. Computer-generated imagery was used minimally. Christian Bale starred as Batman. Liam Neeson starred as Ra's al Ghul (albeit masquerading as Henri Ducard) and Cillian Murphy starred as The Scarecrow. Katie Holmes also starred in the movie as Bruce's love interest, Rachel Dawes. A new Batmobile (called the Tumbler) and a more mobile Batsuit were both created specifically for the film.[72][73]\n\nBatman Begins was both critically and commercially successful. The film opened on June 15, 2005, in the United States and Canada in 3,858 theaters. It grossed $48 million in its opening weekend, eventually grossing over $372 million worldwide. The film received an 85% overall approval rating from Rotten Tomatoes. Critics noted that fear was a common motif throughout the film, and remarked that it had a darker tone compared with previous Batman films. The film was nominated for the Academy Award for Best Cinematography and for three BAFTA awards.[74] It was also listed at No. 81 on Empire's &quot;500 Greatest Movies of All Time&quot;[75] and has maintained a standing on IMDb's &quot;Top 250&quot;.[76]\nThe Dark Knight (2008)\nChristian Bale as Batman in The Dark Knight.\nMain article: The Dark Knight (film)\n\nChristopher Nolan reprised his duties as director, and brought his brother, Jonathan, to co-write the script for the second installment. The Dark Knight featured Christian Bale reprising his role as Batman/Bruce Wayne, Heath Ledger as The Joker and Aaron Eckhart as Harvey Dent / Two-Face. Principal photography began in April 2007 in Chicago and concluded in November. Other locations included Pinewood Studios, Ministry of Sound in London and Hong Kong. On January 22, 2008, after he had completed filming The Dark Knight, Ledger died from a bad combination of prescription medication. Warner Bros. had created a viral marketing campaign for The Dark Knight, developing promotional websites and trailers highlighting screen shots of Ledger as the Joker, but after Ledger's death, the studio refocused its promotional campaign.[77][78]\n\nConsidered one of the greatest films of all time,[79][80][81] the film received highly positive reviews and set numerous records during its theatrical run.[82] With over $1 billion in revenue worldwide, it is the thirteenth highest-grossing film of all time, unadjusted for inflation.[83] The film received eight Academy Award nominations; it won the award for Best Sound Editing and Ledger was posthumously awarded Best Supporting Actor.\nThe Dark Knight Rises (2012)\nMain article: The Dark Knight Rises\n\nNolan wanted the story for the third and final installment to keep him emotionally invested. &quot;On a more superficial level, I have to ask the question,&quot; he reasoned, &quot;how many good third movies in a franchise can people name?&quot;[84] He returned out of finding a necessary way to continue the story, but feared midway through filming he would find a sequel redundant.[85] The Dark Knight Rises is intended to complete Nolan's Batman trilogy.[86] By December 2008, Nolan completed a rough story outline, before he committed himself to Inception.[87] In February 2010, work on the screenplay was commencing with David S. Goyer and Jonathan Nolan.[88] When Goyer left to work on the Superman reboot, Jonathan was writing the script based on the story by his brother and Goyer.[89] Tom Hardy was cast as Bane and Anne Hathaway plays Selina Kyle.[90] Joseph Gordon-Levitt was cast as John Blake,[91][92] and Marion Cotillard was cast as Miranda Tate. Filming began in May 2011 and concluded in November.[93] Nolan chose not to film in 3-D but, by focusing on improving image quality and scale using the IMAX format, hoped to push technological boundaries while nevertheless making the style of the film consistent with the previous two.[94] Nolan had several meetings with IMAX Vice-President David Keighley to work on the logistics of projecting films in digital IMAX venues.[95] The Dark Knight Rises featured more scenes shot in IMAX than The Dark Knight.[95] Cinematographer Wally Pfister expressed interest in shooting the film entirely in IMAX.[96][97]\n\nUpon release, The Dark Knight Rises received positive reviews and was successful at the box office, going on to outgross its predecessor and become the seventh-highest-grossing film of all time grossing over $1.08 billion.","torrent":{"xt":"urn:btih:a65ff82726d784e3a175ec10bb2f7bc264a87e55","amp;dn":"The+Dark+Night+Saga+%5B1080p%5D+Upload+By+%5BSpectre%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65ff82726d784e3a175ec10bb2f7bc264a87e55","infoHashBuffer":{"type":"Buffer","data":[166,95,248,39,38,215,132,227,161,117,236,16,187,47,123,194,100,168,126,85]},"announce":[],"urlList":[]}}