{"title":"Infinite Design v2.0.1 Android","uid":8150517,"size":2833328,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a8d10c188b3921b6fcc6045b8c20f175a2eb0043&amp;dn=Infinite+Design+v2.0.1+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Purplebeanz","files":1,"time":1361024428,"description":"Infinite Design v2.0.1\n\nRequirements: 2.1 and up\nOverview: Take your creative passion to a whole new world. This app seeks to put the power back in your hands, allowing you to create complex and beautiful designs effortlessly.\nImage\n\nIt offers a variety of different brushes. It has five different types of symmetries you can use (X-Axis, Y-Axis, Arbitrary Angle, Radial, and Kaleidoscopic). It utilizes a smart menu system and a fluid interface, seeking to make work flow on the go much easier. Since all the paths created are vector-based graphics, you can zoom in, zoom out, or pan over infinitely thus making your phone a window to an entire world for your imagination to run free. Those who are fond of Photoshop will find comfort in the Layers system which allows you to work on different aspects of a project with out messing with other ones. The eraser also has a built in softness function that allows you to define which paths can be erased and which ones cannot be. The various special paint attributes consist of four types of blurring, embossing or inner/outer shadowing. The auto save feature allows for peace of mind, allowing you to freely leave the app. It will save the project for you and load it on your return. This is one design app that should not be taken lightly. I hope you enjoy.\nKey Features:\n-Infinite canvas (pan, zoom, or rotate)\n-Infinite layers and unique layer options: Split, Merge, Flip, Duplicate, and the ability to apply a perspective transformation to a layer.\n-Carefully designed brushes to ensure optimal workflow on the go.\n-Five types of symmetry: X-Axis, Y-Axis, Arbitrary Angle, Radial, and Kaleidoscopic.\n-Infinite undo/redo system.\n-A relative menu system.\n-Import images.\n-Special Effects include four types of blurring, inner or outer shadowing, and embossing.\n-A fluid interface designed for fluidity and fully optimized for touchscreen devices.\n-Path editing and a standard Pen Tool.\n-Save as JPEG or PNG (with background or without background).\n-Export to SVG for editing in your favorite graphics editor. Tested and works in Adobe Illustrator and Inkscape.\n-Export image to Infinite Painter.\n-Import SVG documents for viewing or editing.\n\n\nWhat's in this version:\nv2.0\n-New Project Manager\n-Redesigned Layers Bar\n-New Menu System\n-Added Grids\n-Improved SVG importing\n-New Help Center\n-Redesigned Style Manager and Styles (now includes both fill and stroke)\n-Added Swatch-support\n-Fixed major glitches where design was breaking randomly\n-New file format to handle extremely large projects\n-Lasso Select Tool\n-Multiple object selection\n-New edit options\n-5 new tools (Shape Warper, Shape Sprayer, Shape Roller, Line Pen, and Smart Pen)\n\n\nMore Info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.brakefield.id&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.brakefield.id&lt;/a&gt;","torrent":{"xt":"urn:btih:a8d10c188b3921b6fcc6045b8c20f175a2eb0043","amp;dn":"Infinite+Design+v2.0.1+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d10c188b3921b6fcc6045b8c20f175a2eb0043","infoHashBuffer":{"type":"Buffer","data":[168,209,12,24,139,57,33,182,252,198,4,91,140,32,241,117,162,235,0,67]},"announce":[],"urlList":[]}}