{"title":"Latin virgins #3 (2003)","uid":8189996,"size":729100288,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:aaccd02809c05fb5071796025ec53d50a1aa33e7&amp;dn=Latin+virgins+%233+%282003%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":null,"files":-1,"time":1361803357,"description":"The latest offering from this ongoing series doesn't fail to delight. Fans of cinnamon-skinned newbie girls getting fucked hard in a variety of situations will certainly be pleased with the content here.\n\nWhile frolicking down the beach nude, Yaneles comes upon a fenced off house with some curious parties taking in the sights with binoculars. She approaches, shimmies and charms her way into the appreciative arms of a geezer type who gets some oral but then is usurped by much younger Ricardo. The vixen is brought inside for some muy caliente doggie-style ass-reaming on the couch.\n\nNext up, Marco throws cute little Rosa around the bed for their action sequence. He crams his chorizo in her waiting mouth and pumps furiously prior to the litany of positions he puts her through. The approach has a take-no-prisoners attitude the way he tosses her around like a rag doll. He leaves Rosa begging for more as he unloads the gooey facial.\n\nWilling and able Natallye and business-like Ricardo make a good pairing to finish up the vid with some mish, reverse cowgirl and eager ass stabbin' in the steamy hot tub.\n","torrent":{"xt":"urn:btih:aaccd02809c05fb5071796025ec53d50a1aa33e7","amp;dn":"Latin+virgins+%233+%282003%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaccd02809c05fb5071796025ec53d50a1aa33e7","infoHashBuffer":{"type":"Buffer","data":[170,204,208,40,9,192,95,181,7,23,150,2,94,197,61,80,161,170,51,231]},"announce":[],"urlList":[]}}