{"title":"POtHS - Creation - 61 - Light Speed - Million times Faster 10000","uid":8040895,"size":8080205554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad20bbff6121f7e2d8ae206dc120af3637b0f4e4&amp;dn=POtHS+-+Creation+-+61+-+Light+Speed+-+Million+times+Faster+10000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1358626117,"description":"\n\n\n\nPOtHS - Creation 61\n\nLight Speed - Million times Faster 10000 years ago = 6 days of Creation\n\n\n\n\nPOtHS Comments on This oneBarry Setterfield has solved the Age of The Universe controversy. Time is calculated using the Speed of Light which everyone used to think was constant. The Creator God Yahweh spoke to him and said to him &quot;who said the speed of light is constant?&quot; This led him to discovering that light IS SLOWING DOWN. He calculated how fast the speed light would have been about 10,000 years ago which is a Biblical View of when Creation happened. With the new speed of light, which was 1,000,000 times faster then, he proceeded to run the time calculation. When calculating the Age of The Universe (they say 16 billion years)with the NEW Speed if Light. The Age of the Universe calculates  to 6 (six) days. And on the 7th Day he did rest.\n\n\n......... There is truth here for all ages and beliefs. If Darwin was wrong...........then the Schools have been intentionally lying to our Children. If the schools teach Darwinism which says there is NO CHRIST. Then they are of The Anti-Christ. Public Schools teaching books CHANGE EVERY YEAR. The Bible never changes. So where is truth??? In Evolution Theories??? If you believe in Evolution you are denying The Father, The Son and The Holy Spirit of the Praise They are entitled too for making everything you understand and can see and more than that, everything you don't understand and can't see. If you have never thanked the CREATOR for his Creation now is your chance to thank Him.\n\nDescription:\n\nPOtHS - Creation - 61 - Light Speed - Million times Faster 10000 years ago = 6 days of Creation\n\n\nThe Decreasing Speed of Light - The Evidence by Barry Setterfield:\nRecorded live at the Time and Creation Research Conference Sydney NSW Australia. Subjects include: LIGHT SLOWS DOWN, EARTH YOUNG, CREATION VALID 2 DVD's set (suits college +)\n\nIn 1982 we published Barry Setterfield's controversial theory that light was slowing down therefore rocks are much younger and creation is valid. Physic leaders such as Professor Davies mocked. Twenty years later the world began to catch up. Professor John D Barrow ( Manchester Uni) said in New Scientist 24th July, 1999. p29. all the big cosmological problems will simply melt away , if you break one rule, the rule that says the speed of light never varies. Since then many astromers have begun to accept the slowing of light. Now you can see Barry Setterfield's latest works filmed live along with Creation Research team support programs.\n\nSee GREAT DVDs for sale at http://shop.askjohnmackay.com click on DVDS and scroll down titles:To return to http://www.creationresearch.net or click arrow in to left hand corner of your computer screen\n-----------------------------------------------------------\n\n\n:thankyou:    :thankyou:     Thank You JESUS  \n\n\n \n","torrent":{"xt":"urn:btih:ad20bbff6121f7e2d8ae206dc120af3637b0f4e4","amp;dn":"POtHS+-+Creation+-+61+-+Light+Speed+-+Million+times+Faster+10000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad20bbff6121f7e2d8ae206dc120af3637b0f4e4","infoHashBuffer":{"type":"Buffer","data":[173,32,187,255,97,33,247,226,216,174,32,109,193,32,175,54,55,176,244,228]},"announce":[],"urlList":[]}}