{"title":"CD-adapco SPEED","uid":8178569,"size":277925868,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:adf6059ee4cf9304b0c61c6ae245ddc87c2cfe31&amp;dn=CD-adapco+SPEED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cheng1234","files":1,"time":1361578222,"description":"\nSPEED is the specialized analysis tool for the design of electric machines such as motors, generators and alternators including the drive with inverters and their control.\n\nBacked by 25 years of experience within the SPEED Lab at the University of Glasgow, SPEED has 1500+ international users, including leading manufacturers, designers, developers and users of electric machines.\n\nThousands of machines have been designed with SPEED, and millions have been produced. SPEED is a simple, intuitive, fast and efficient tool for:\n\n\n\n- Sizing and preliminary design of new prototypes.\n\n- Characterization of new &amp; existing products: performance study and quick assessment of the effect of parameter changes.\n\nFurthermore, its highly organized data in both numerical and graphical form facilitates communication between company sites, and often between supplier and customer.\n\nFinally, SPEED can be used in conjunction with high-powered specialist CAE tools such as STAR-CCM+ for the exhaustive analysis of difficult electromagnetic, mechanical, or thermal problems.\n\nAbout CD-adapco\n\nCD-adapco is the world's largest independent CFD-focused provider of engineering simulation software, support and services. We have over 30 years of experience in delivering industrial strength engineering simulation. The scope of our activities extends well beyond software development to encompass a wide range of CAE engineering services in both CFD and FEA.\n\nWe have over 7000 users of our software, working at 3000 different companies, spending over $100 million on our software and services. Our customer approval ratings are very high; in our last customer survey 93% of our customers declared themselves satisfied, or very satisfied with our software and services, a fact reflected in a consistently high customer retention rate.\n\nConsistently growing at an organic rate of over 17% per year, CD-adapco employs over 550 talented individuals, working at 21 offices around the globe, involved in dedicated support, software development and engineering services.\n\nName: CD-adapco SPEED\n\nVersion: 2011\n\nHome: www.speed-emachine-design.com\n\nInterface: english\n\nOS: ShiChuang XP / Vista / Seven\n\nSize: 265.0 mb","torrent":{"xt":"urn:btih:adf6059ee4cf9304b0c61c6ae245ddc87c2cfe31","amp;dn":"CD-adapco+SPEED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adf6059ee4cf9304b0c61c6ae245ddc87c2cfe31","infoHashBuffer":{"type":"Buffer","data":[173,246,5,158,228,207,147,4,176,198,28,106,226,69,221,200,124,44,254,49]},"announce":[],"urlList":[]}}