{"title":"The Science of Fitness with Tamilee - I Want That Body! (2001)","uid":7970585,"size":333129006,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:af88805ca9c85dc984d3b4a165a62aa41466a0b2&amp;dn=The+Science+of+Fitness+with+Tamilee+-+I+Want+That+Body%21+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"acer47x","files":1,"time":1356819039,"description":"Renowned fitness instructor Tamilee Webb has used groundbreaking scientific research to find the best possible workouts for each part of the body and every level of student. By going into the lab to study each muscle group and test every exercise, Tamilee has been able to develop fitness routines that will provide the maximum benefit for your body, inside and out.\n\nThis high-energy workout includes three sections:\n\nI Want Those Abs\n\nNo one knows how to get rock hard abs better than Tamilee Webb. With I Want Those Abs, she has taken every abdominal exercise into the lab and tested each one to design the most efficient ab workout ever. Just two to three times a week and you'll be showing off your flat, firm abs to the world. What are you waiting for?\n\nI Want Those Arms\n\nDo you find yourself wishing that you could wear strappy or sleeveless tops, but are embarrassed by your arms? I Want Those Arms will help you tone and firm your arms and shoulder muscles for a sleek, sexy look you'll be proud to show off. Tamilee has researched every exercise to create the most effective arm and shoulder workout ever. Get the arms you want today!\n\nI Want Those Buns\n\nLooking for a workout that gives you the look you want in your jeans? I Want Those Buns was designed in an exercise science lab to find the best possible exercise for firming, toning, and shaping your buttocks. Focus on strengthening and firming your buttocks, toning and shaping, or do both routines for a complete workout. Get the buns you want today!","torrent":{"xt":"urn:btih:af88805ca9c85dc984d3b4a165a62aa41466a0b2","amp;dn":"The+Science+of+Fitness+with+Tamilee+-+I+Want+That+Body%21+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af88805ca9c85dc984d3b4a165a62aa41466a0b2","infoHashBuffer":{"type":"Buffer","data":[175,136,128,92,169,200,93,201,132,211,180,161,101,166,42,164,20,102,160,178]},"announce":[],"urlList":[]}}