{"title":"Idol (epic Comics)","uid":8217779,"size":62173138,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b00657ba654200087bc7b83f4fc4d5ba3260b185&amp;dn=Idol+%28epic+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ichthypod_Crane","files":3,"time":1362383853,"description":"Three-issue series written by Gerard Jones and Steve Mattsson, illustrated by Ron Randall and Rick Maygar and published by epic Comics in 1992.\n\nSomeone desperately trying to sell this on ebay says:\n\nMany strange things lie asleep in the deep...\n\nContractually obligated to film a sequel to a B-movie which was her first acting job, popular actress Rachel Ahmed hires a film making crew to finish the movie so she can return to work on her other projects.   \n \nHowever, the filming hits minor snags with some creative differences but after these are resolved, more problems arise in the form of accidents occuring on the undersea Military installation which previously had been owned and operated by the Soviets for undisclosed research.   \n \nPresent are some Naval personnel to oversee the safety of the people involved with the film shoot as the location is now US Government property but even they cannot prevent some strange occurrences which end up being more than just simple accidents on the set.\n\n\nKudos to the creative team and the scanner. Get it, seed it.","torrent":{"xt":"urn:btih:b00657ba654200087bc7b83f4fc4d5ba3260b185","amp;dn":"Idol+%28epic+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b00657ba654200087bc7b83f4fc4d5ba3260b185","infoHashBuffer":{"type":"Buffer","data":[176,6,87,186,101,66,0,8,123,199,184,63,79,196,213,186,50,96,177,133]},"announce":[],"urlList":[]}}