{"title":"HISTORY OF POP AND ROCK MUSIC - part 477","uid":8212491,"size":745540239,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b0834cbbf6f8a3edb4876229d0f45cf8e8de30fc&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+477&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":11,"time":1362267547,"description":"  \n\n                    PART  477\n\n\n\n         BOSTON  - More Than A Feeling  (1976)\n         LINDA RONSTADT  -  It's So Easy  (1977)\n         SUPERTRAMP  -  Breakfast In America  (1979)\n         GYM CLASS HEROES  -  Cupid's Chokehold / Breakfast in America  (2005)\n\n\n\n           &quot;More Than a Feeling&quot; is a song written by Tom Scholz and first released by the rock band Boston as the lead single from their self-titled debut album on Epic Records in September 1976, with &quot;Smokin'&quot; on the flipside. The single peaked at number five on the Billboard Hot 100. The track is now a staple of classic rock and in 2009 it was named the 39th best hard rock song of all time by VH1.\n\n          &quot;Breakfast in America&quot; is the title track from Supertramp's 1979 album of the same name. It was a minor hit on the singles charts in the US but was a Top 10 hit in the UK. The song was written by Roger Hodgson before Supertramp were formed, during his late teens, but is jointly credited to him and his bandmate/songwriting partner Rick Davies. Davies wanted Hodgson to re-write the by-then over a decade old lyrics, but Hodgson refused, feeling that they were too intrinsic to the song and captured the innocence of his adolescence. The lyrics tell about a person who has never been to America and fantasises about it.\n\n\n         &quot;Cupid's Chokehold&quot; (also known as &quot;Cupid's Chokehold / Breakfast in America&quot;) is a single performed by Gym Class Heroes, featuring Patrick Stump of Fall Out Boy. The song relies heavily on the music and chorus from Supertramp's hit song &quot;Breakfast in America&quot;. It peaked at #4 on the Billboard Hot 100, #4 on the Billboard Pop 100, #3 on the UK Singles Chart, and #3 on the Canadian Hot 100. It was first released in 2005 on The Papercut Chronicles, and re-recorded for their album As Cruel as School Children (which was re-released on November 4, 2006 with &quot;Cupid's Chokehold&quot; as an additional track). \n        There are two music videos for this song, one for each version. The second version includes female backing vocals which are not included in version one. The second version of the video does contain the backing vocals of the first video. However, the female voice is integrated into the chorus behind Patrick Stump's vocals. The song has been featured on Discover and Download and Total Request Live.\n         The song won an ASCAP award on April 9, 2008 for being one of the most played songs in ASCAPs repertory from the 4th Quarter 2006 through the 4th Quarter 2007. As of September 2011, the song has sold 1,936,000 digital downloads.","torrent":{"xt":"urn:btih:b0834cbbf6f8a3edb4876229d0f45cf8e8de30fc","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+477","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0834cbbf6f8a3edb4876229d0f45cf8e8de30fc","infoHashBuffer":{"type":"Buffer","data":[176,131,76,187,246,248,163,237,180,135,98,41,208,244,92,248,232,222,48,252]},"announce":[],"urlList":[]}}