{"title":"POtHS - Apostasy The Great Falling Away Vol 20 - HYPOCRITES","uid":8052006,"size":10878846798,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b0f234895550a111587ebfa6ba06151f5b9fc67b&amp;dn=POtHS+-+Apostasy+The+Great+Falling+Away+Vol+20+-+HYPOCRITES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1358875834,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Apostasy The Great Falling Away Vol 19 - HYPOCRITES\n\n\nPOtHS says: The Falling away is running at Full Speed.\n\nDescription:\n\nChurch of Tares Purpose Driven, Seeker Sensitive, Church Growth &amp; New World Order:\nCan the Church borrow the marketing tools of the world and apply them to the Church? What is the history of the Church Growth movement and its false premises? Who is involved in the new evangelicalism and second reformation? Why are these movements embracing contemplative mysticism? How does this movement play into the New World Order? These questions and more are answered in Church of Tares: Purpose Driven, Seeker-Sensitive, Church Growth &amp; New World Order.\n\nChurch of Tares chronicles the man-centered pragmatism of these evangelical Christian movements in comparison to the Bible's instruction for building the Church of Jesus Christ.As a sequel to The Real Roots of the Emergent Church, Church of Tares documents the connections between the liberal Emergent Church movement and the Church Growth movement. Both movements' leadership were discipled by business management guru Peter Drucker, who was attracted to the megachurch movement as a social phenomenon that could bring about his &quot;new society&quot; and New World Order. Megacurch pastors Rick Warren and Bill Hybels as well as Leadership Network founder Bob Buford all acknowledge Drcuker (who professed not to be a Christian) as their mentor and have built their organizations upon his secular business management philosophies rather than the foundation of Jesus Christ.\n\nThe fruit of these movements is great compromise of the Gospel and the Great Commission. Rick Warren claims to be ushering in a new spiritual awakening and second reformation with his P.E.A.C.E. Plan. But this reform appears to be a social reformation rather than a spiritual one by joining together in ministry with unbelievers to fight global giants. Such compromise has led to the affirming response letter to the Common Word document which declares Muhammad to be a prophet and the Bible and Qur'an to be of the &quot;same Divine origin.&quot;\n\nWritten, edited, narrated and directed by Elliott Nesch. Original interviews with:\nPaul Smith, leader in the Calvary Chapel movement founded by his brother Chuck Smith, who also wrote the foreword to Paul Smith's book New Evangelicalism: The New World Order.\n\nPhil Johnson, executive Director of Grace to You, a Christian tape and radio ministry featuring the preaching ministry of John MacArthur.\n\nChris Rosebrough, Captain of Pirate Christian Radio and Host of the Fighting for the Faith radio program, holds a degree in Religious Studies and Biblical Languages from Concordia University.\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:b0f234895550a111587ebfa6ba06151f5b9fc67b","amp;dn":"POtHS+-+Apostasy+The+Great+Falling+Away+Vol+20+-+HYPOCRITES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0f234895550a111587ebfa6ba06151f5b9fc67b","infoHashBuffer":{"type":"Buffer","data":[176,242,52,137,85,80,161,17,88,126,191,166,186,6,21,31,91,159,198,123]},"announce":[],"urlList":[]}}