{"title":"Coast to Coast AM January 09 2013","uid":8003668,"size":57278062,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b0f267151b33a8d5fe057a0c4a2518e895843c76&amp;dn=Coast+to+Coast+AM+January+09+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1357835306,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-09-13\nHost: \tJohn B. Wells\nGuests: \tRobert Young Pelton, Stewart Rhodes\n\nAuthor and adventurer Robert Young Pelton discussed the geopolitical situation in various countries such as Afghanistan, his experiences working with private military contractors, and the war trends he currently sees happening. The mistake the US made with Afghanistan was getting into the nation-building business, installing Hamid Karzai as the president, and creating a kind of &quot;kleptocracy,&quot; he said. Currently, US soldiers go out and arrest or kill people identified as murderers or terrorists, yet at the same time the Afghan government is working diligently to bring these murderers and terrorists into political power, so it's a no-win situation for the US, he commented.\n\nRegarding, the Benghazi assault in Libya, repeated requests for increased security were turned down by Sec. of State Hillary Clinton, Pelton noted. Then, &quot;instead of admitting that this had been a predictable and expected situation, the State Dept. came up with a ridiculous story about a video that incited these people to riot, even though the actual al-Qaeda insurgents were saying, 'no, that's not why we attacked your Embassy,'&quot; he detailed. The problem with al-Qaeda, he continued, is that they are now spread across the globe like a franchise, and can't be attacked on a single battlefield.\n\nPelton analyzed the situation in countries such as Russia, and Mexico, as well as various nations in Africa, and how AFRICOM (United States Africa Command) has been deployed. He also talked about how private contractors are often ex-military personnel who discover that they can make more money as a contractor, and won't have to be constrained by military regulations. There has been an increase in the use of proxy forces, where for instance in Uganda, the US hired the Ugandan army to go after the Al-Shabaab terrorists in Somalia, he reported.\n2nd Amendment Rights\n\nFirst hour guest, Stewart Rhodes, founder of the Oath Keepers, talked about 2nd Amendment rights, and reacted to the news that Pres. Obama could use executive orders to restrict guns. He suggested that citizens should resist any orders to disarm, and that the administration may be trying to take people's guns away before a coming collapse. Further, he argued that military semiautomatic rifles like the AR15 or AK47 are exactly the kind of arms people might need to defend themselves against tyranny.\nWebsite(s):\n\n    comebackalive.com\n    oathkeepers.org\n\nBook(s):\n\n    Licensed to Kill: Hired Guns in the War on Terror\n    Come Back Alive\n    The Adventurist: My Life in Dangerous Places\n    The World's Most Dangerous Places\n\n","torrent":{"xt":"urn:btih:b0f267151b33a8d5fe057a0c4a2518e895843c76","amp;dn":"Coast+to+Coast+AM+January+09+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0f267151b33a8d5fe057a0c4a2518e895843c76","infoHashBuffer":{"type":"Buffer","data":[176,242,103,21,27,51,168,213,254,5,122,12,74,37,24,232,149,132,60,118]},"announce":[],"urlList":[]}}