{"title":"Protectors #1-20 + Handbook (1992-1994) (Requested)","uid":7991234,"size":343059689,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b265198330d88ad7bad35909c28c4f4d41b488b2&amp;dn=Protectors+%231-20+%2B+Handbook+%281992-1994%29+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"blackcanary","files":-1,"time":1357424528,"description":"English | CBR | 21 Issues\n\nProtectors #1-20 + Handbook (1992-1994)\nPublisher:  Malibu Comics\nPublication Date:  September 1992 - May 1994\n\nWriter:  R.A. Jones\nPencils:  Thomas Derenick, Robert E. Brown, Jim Hall, Tom Lee, Willie Peppers\nInks:  Mike Deodata, Emir Ribeiro, Bobby Rae, W. &quot;Moose&quot; Bauman, Mike S. Miller, Larry Welch\nLetters:  Clem Robins, Tim Eldred, Mike DeLepine, Patrick Owsley\n\nThe Protectors was a 20-issue comic book series published by Malibu Comics from 1992 until 1994. Originally meant to be a six-issue series, response was positive enough that Malibu decided to make the series ongoing. The series was cancelled (along with the rest of the &quot;Genesis&quot; titles) so that, according to Malibu, they could focus more on the &quot;Ultraverse&quot; line.\n\nMany of the characters included in the series were taken from heroes created by Centaur Publications, and had fallen into the Public Domain. Some heroes were given new names, such as: Gravestone (formerly Fantom of the Fair, Fantom or Fantoman), Nightmask (Masked Marvel), Thresher (aka Shark), and Midnight Blue (formerly Blue Lady). In the case of Gravestone, the name was changed to avoid confusion with Lee Falk's Phantom (although there were a few instances when the hero was referred to as &quot;Fantom&quot; within the pages of the first few issues). Nightmask was changed from Masked Marvel to avoid any potential legal problems with Marvel Comics (both explanations appeared in the letter column page of the first issue of The Protectors). Many of Centaur's heroes received updated costumes but retained their original names, including Zardi The Eternal Man, Amazing Man, Mighty Man, Man of War, Iron Skull, Mantoka, Arrow, Witch and Airman, along with the villains The Great Question and Conqueror.\n\nMalibu also made use of the Rocket Ranger (a character created by the video game company Cinemaware) within the pages of Man of War's series and Miss Fury, who they had licensed for a previous series.\n\nWith the 13th issue of the series, Malibu started the &quot;Genesis&quot; cross-over, which incorporated the books &quot;Dinosaurs for Hire&quot; and &quot;Ex-Mutants&quot; as part of the six-issue story. At the end of the cross-over, characters from the Protectors would appear in the pages of Ex-Mutants (and vice-versa).\n\nThe Protectors was cancelled with issue 20 in 1994 (the year Malibu was purchased by Marvel Comics), with readers witnessing the destruction of the Earth, making any type of continuation of the heroes' story highly unlikely.","torrent":{"xt":"urn:btih:b265198330d88ad7bad35909c28c4f4d41b488b2","amp;dn":"Protectors+%231-20+%2B+Handbook+%281992-1994%29+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b265198330d88ad7bad35909c28c4f4d41b488b2","infoHashBuffer":{"type":"Buffer","data":[178,101,25,131,48,216,138,215,186,211,89,9,194,140,79,77,65,180,136,178]},"announce":[],"urlList":[]}}