{"title":"Fun. - Some Nights (2012) [24 bit FLAC] vinyl","uid":8160712,"size":996995250,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b39dab47c46e7915c6ffd954d3cd7afec4ecdf8b&amp;dn=Fun.+-+Some+Nights+%282012%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"24.96","files":-1,"time":1361243972,"description":"  Fun. - Some Nights (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Duration: 45:56\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 - 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Some Nights (Intro)\n  02. Some Nights\n  03. We Are Young\n  04. Carry On\n  05. It Gets Better\n  06. Why Am I the One\n  07. All Alone\n  08. All Alright\n  09. One Foot\n  10. Stars\n  11. Out on the Town\n\n  Fun.'s debut album Aim and Ignite was an interesting blend of seemingly divergent styles topped by a healthy dose of grandiose ambition and performed with a precise abandon. The trio made an album that was truly progressive and also super catchy and fun. The follow-up, Some Nights, ramps up the ambition and sonic bombast, but also manages to be even more powerful and impressive. While writing and planning the album, singer Nate Ruess, guitarist Jack Antonoff, and multi-instrumentalist Andrew Dost were heavily influenced by both the sound and scope of Kanye West's My Beautiful Dark Twisted Fantasy and made every attempt to achieve something similar, even to the point of hiring that album's co-producer Jeff Bhasker to produce and craft beats for them. (Also Emile Haynie, who has worked with Eminem among others) Though the album has more of a hip-hop influence than Aim and Ignite did, there are still large doses of Queen and ELO coursing through the band's blood, both in the machine-crafted vocal harmonies and the ornate bigness of the sound. The album is overloaded with strings and horns, backing vocals, keyboards, and programmed drums surrounding Ruess like a clamoring crowd, but never drowning out his innately sincere vocals and painfully honest lyrics. He has the kind of voice that could cut through any amount of noise, not by using volume but honesty. Even when he's fed through Auto-Tune, you know he's telling you the truth all the time. On songs like the lead single &quot;We Are Young&quot; or the rollicking &quot;All Alone,&quot; he provides a very human core that grounds things even as the music builds to ornate crescendos. Indeed, the album is really, really big sounding and could easily have ended up collapsing under its own weight and pretension, but the opposite happens and Some Nights takes flight instead. The songs are both anthemic and human-sized, the heartfelt words and naked emotions are never buried, and the music is uplifting, not overpowering. The trio has crafted a record that measures up to My Beautiful Dark Twisted Fantasy musically and delivers enough emotional charge to power a small town for a month. It's an impressive achievement and Fun. deserves every bit of acclaim that comes its way because of it.","torrent":{"xt":"urn:btih:b39dab47c46e7915c6ffd954d3cd7afec4ecdf8b","amp;dn":"Fun.+-+Some+Nights+%282012%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39dab47c46e7915c6ffd954d3cd7afec4ecdf8b","infoHashBuffer":{"type":"Buffer","data":[179,157,171,71,196,110,121,21,198,255,217,84,211,205,122,254,196,236,223,139]},"announce":[],"urlList":[]}}