{"title":"The Ed Show 1-9-13.mp4","uid":8002968,"size":181292942,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b4350d0cde9c0a9e496fb7c6ccc64e7d24e3648f&amp;dn=The+Ed+Show+1-9-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1357776459,"description":"The Ed Show; January 9, 2013.\n\nVice President Joe Biden said the president is serious about guns. But Republicans are still blaming video games. The time for excuses is over.\n\nEd Schultz welcomed Katrina Vanden Heuvel (Editor and Publisher of The Nation), to &quot;The Ed Show&quot; to talk about what it will take to keep the gun debate from going in circles.\n\nAnd Carolyn Cain (grade school teacher from Utah), told Ed why she wants to carry a weapon in school.\n\nThe war on women was a big loser for Republicans in 2012, but they're not giving up their fight against Planned Parenthood. Cecile Richards (President of Planned Parenthood), responded to the GOP's latest attack on the organization.\n\nThe Obama administration shows no signs of dropping its drone program. But is it good policy? Ed ask Robert Greenwald (documentary filmmaker and Director of the Brave New Foundation).\n\nRepublican National Committee Chair Reince Priebus touts the GOP success of 2012. What planet was he on?\n\nAnd in the BIG finish, Michele Bachmann kept her seat on the House Intelligence Committee, and progressive groups are speaking out. Karen Finney (MSNBC Political Analyst and former DNC Communications Director), had reaction and analysis.","torrent":{"xt":"urn:btih:b4350d0cde9c0a9e496fb7c6ccc64e7d24e3648f","amp;dn":"The+Ed+Show+1-9-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4350d0cde9c0a9e496fb7c6ccc64e7d24e3648f","infoHashBuffer":{"type":"Buffer","data":[180,53,13,12,222,156,10,158,73,111,183,198,204,198,78,125,36,227,100,143]},"announce":[],"urlList":[]}}