{"title":"FakeAgent Danielle c1067_danielle_720 {ImgZilla}","uid":8326365,"size":679285819,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bd5be821490944115474d434784ea0d93302538f&amp;dn=FakeAgent+Danielle+c1067_danielle_720+%7BImgZilla%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":-1,"time":1364808322,"description":"Size: 679285819 bytes (647.82 MiB), duration: 00:46:31, avg.bitrate: 1947 kb/s\nAudio: aac, 44100 Hz, mono (eng)\nVideo: h264, yuv420p, 1280x720, 25.00 fps\n\n\nDanielle (46mins) My first impression of Danielle is that she looked quite artificial. I would imagine she spends a good proportion of time on a sun bed thinking of ways to enhance her look. She was a bit on edge when she walked in, mind you, that's is perfectly normal in this environment. All I could think of when I looked at her was 'bronze duck', which almost made me laugh out loud on a few instances. When I found out she had a boyfriend I was a little bit surprised, I asked her if he knew she was here and she giggled and said 'no'. I felt quite bad for a split second, but soon got back into trying to get in her g string. I noticed that she was getting fed up with my constant barrage of questions; I was getting bored of her one word answers, as a result the interview didn't seem to going to well. However, it started to get a lot more interesting when she took her clothes off. Unfortunately, her tits were as fake as my promises, the only real thing in this room was the orgasms. There was a bit of an awkward moment at the end when she said she would swallow my sperm, but the sneaky duck tried to spit it out on the sly. Her guilt was written all over her face. She used the excuse that it was too much, maybe it was, and I can't imagine it tasted very good as my diet has mainly consisted of kebab meat and coleslaw for the last couple of weeks. Lucky girl.","torrent":{"xt":"urn:btih:bd5be821490944115474d434784ea0d93302538f","amp;dn":"FakeAgent+Danielle+c1067_danielle_720+%7BImgZilla%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd5be821490944115474d434784ea0d93302538f","infoHashBuffer":{"type":"Buffer","data":[189,91,232,33,73,9,68,17,84,116,212,52,120,78,160,217,51,2,83,143]},"announce":[],"urlList":[]}}