{"title":"XYplorer v12.20.0200 + Portable with Key","uid":8210011,"size":9572248,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c00bab6af73498ede7163686140c7e902f2fbc35&amp;dn=XYplorer+v12.20.0200+%2B+Portable+with+Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Heartofthorns","files":-1,"time":1362220935,"description":"XYplorer is a tabbed file manager for Windows. It features a powerful file search, a versatile preview, a highly customizable interface, optional dual pane, and a large array of unique ways to efficiently automate frequently recurring tasks. It's fast and light, it's innovative, and it's portable.\n\nHere is a selection of XYplorer's features:\n1. Navigation\nTabbed Browsing. Cutting-edge file management using a true multi-tabbed interface.\nThe optional Dual Pane mode spells productivity and ease of use, especially for those coming from an orthodox file manager. \nIntroducing 6 Key Navigation, a way to navigate the whole file system one-handedly by just 6 keys. \nMini Tree, the author's favorite feature, is a folder tree displaying only the paths you have actually used. \n\n2. Searching\nThe powerful and speedy File Search supports Boolean Logic, Regular Expressions, Content Search, and more...\nThe Duplicate File Finder quickly lists duplicate files in any location. \nBranch View lets you see the contents of all subfolders of a folder in one list. \nCustomizable Power Filters let you quickly focus subsets of files. \n\n3. File Operations\nQueued File Operations with background processing. Enjoy the speed and safety of a Copy Queue. \nCustom Copy, an alternative copy method featuring verification, reporting, logging, and more. \nQuickly create New Items from a configurable menu, a major time saver.\nBatch Rename using wildcard patterns, variables, and Regular Expressions. Preview included. \n\n4. Organization\nTag-Based File Management supports assigning individual labels, tags, and comments to any file and folder. \nColor-code your files by Name, Size, Date, Age, or Attributes to quickly spot what's important for you now. \nThe Catalog is a favorites panel on steroids, serving as launch panel, drop target, and scripts library. \n\n5. Information\nFolder Sizes and Item Counts can be shown right in the file list.\nOne-click Previews of all important image, audio, video, web, office, and font file formats. \nThe Floating Preview is a sizeable preview pane separate from the main window for images and documents.\nMouse Down Blow Up is supported for thumbnails and image previews. Learn more...\nOne-click Reports on folders or search results, including directory print in various formats. \n\n6. Automation\nUser-Defined Commands will reduce your daily routines to simple keystrokes. \nFolder View Settings. Save and auto-restore the view settings of any particular folder.\nScripting. Advanced solutions for advanced tasks. A power user's dream.\n\n7. Configuration\nPortable File Associations. Home is where your double-click is.\nToolbar. A configurable toolbar where most buttons have a specific right-click menu.\nKeyboard. Customizable Keyboard Shortcuts for nearly 600 functions. Have it your way!\n\n8. Safety and Accessibility\nMulti-Level Undo/Redo for file operations, stored between sessions, allows you to fix today what you broke yesterday.\nWipe is a method to securely delete files and folders beyond recovery.\nAccess Control. Control which paths can be accessed, and which file operations are allowed. A corporate feature.\nAdjust Font Sizes on the fly by Ctrl+Wheel, Line Heights by Ctrl+Shift+Wheel. The Toolbar supports Large Icons.\n\n9. Last Not Least\nSimple key-based registration, 100% trouble-free. No DRM hassle. Paying customers are not treated like pirates.\nA clean and user-friendly interface, simple and elegant, makes working with XYplorer easy and intuitive.\nXYplorer is continuously enhanced and users are taken seriously.\n\nSupported OS: \nWindows 8, 7, Server 2008, Vista, XP, Server 2003, 2000, NT, Me, 98. Both 32-bit and 64-bit versions, where applicable, are supported.\n\nWebsite : &lt;a href=&quot; http://www.xyplorer.com/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.xyplorer.com/index.php&lt;/a&gt;\n-------------------------\nInstallation Instructions\n-------------------------\n1. Install Program.\n2. Use given serial to register application.\n3. Done, Enjoy.\n--------------------------\n\nIF YOU LIKE THE SOFTWARE AND CAN AFFORD TO BUY IT, PLEASE BUY IT AND SUPPORT THE DEVELOPERS.\n\n------------------------------------------------------\nScanned with Kaspersky and found to be 100% clean.\n------------------------------------------------------","torrent":{"xt":"urn:btih:c00bab6af73498ede7163686140c7e902f2fbc35","amp;dn":"XYplorer+v12.20.0200+%2B+Portable+with+Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c00bab6af73498ede7163686140c7e902f2fbc35","infoHashBuffer":{"type":"Buffer","data":[192,11,171,106,247,52,152,237,231,22,54,134,20,12,126,144,47,47,188,53]},"announce":[],"urlList":[]}}