{"title":"Bitches In Uniform 2 XXX DVDRip x264-Jiggly","uid":8000094,"size":1629889280,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c3d270ae20632cc16b810a987d622f68b532ad97&amp;dn=Bitches+In+Uniform+2+XXX+DVDRip+x264-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1357728649,"description":"Category All Sex Movies, Anal, Foreign, Threesomes &amp; More \n  \nDirector Rocco Reed \n\nStarring Rocco Siffredi, Aletta Ocean, Tarra White, Blue Angel, Dona Bell, Irina Bruni, Linet Slag, Milla Yul, Valentina Nappi \n\nBitches In Uniform # 2 porn 'Power always brings a sexy vision. Bitches In Uniform # 2 DVD video Tarra White was fantqstic as the leader in the paint ball scene. Bitches In Uniform # 2 movie Russian policewoman Irina Bruni was absolutely fantastic. Bitches In Uniform # 2 adult DVD I love the two nurses, Blue Angel and Lnett Slag. Bitches In Uniform # 2 buy Who doesn't dream about waking up to two nurses like this? Russian Mila Yul makes me love Russia Forever!' -Rocco Siffredi Legendary performer/director Rocco Siffredi is known for his nasty anal adventures and extreme fetish play. Bitches In Uniform # 2 porn But sometimes this icon of adult video just likes to goof off with a gaggle of gorgeous sluts. His latest such batch of silly vignettes, 'Rocco's World,' features lighthearted stories of adorable young beauties getting into sexy trouble with the Italian stud and his mates. First, Rocco meets up with two fake sailors who've concocted a great scam. Rocco poses as a foreign ship's admiral ... and a mob of six stunning girls who can't resist a man in uniform Rocco surround the 'seamen. ' Their subsequent orgy is a mess of butt fucking, cocksucking and one delicious cake that gets smeared in every crevice! Next, fishnet-clad domme bitch Angel Rivas wields a strap-on dildo to subjugate foxy Ferrera Gomez and nerdy model Tiffany Doll. She plunders their assholes using various toys. Rick Angel and Frenk Torelli help out by anally reaming the trio of lusty ladies and decorating their faces with cum. Christian Devil trains Steve Holmes' big-assed American maid, Delilah Strong, in some kitchen wizardry. After using Delilah's phat, round booty to crack eggs, he joins Steve in giving the slutty servant a double measure of cock meat. Finally, lovely Lucie and Lisa are slender roommates who eagerly take the director's huge pole in every orifice. 'This is not a fetish movie - the whole concept was to show fun,' says Rocco. For a good fucking time, pay a visit to 'Rocco's World!' This is the only Valentina Nappi video. \n\nSize          : 1.52 GiB                       \nRuntime       : 2h 19mn 4s 490ms               \nVideo Bitrate : AVC at 1 462 Kbps              \nAspect        : 704 x 386 (1.824) at 29.970 fps\nAudio Bitrate : AAC at 96.0 Kbps               \nInfos         : 2 channels, 48.0 KHz \n\n\n &lt;a href=&quot;\nhttp://www.forload.net/?v=jigglybitc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=jigglybitc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.forload.net/?v=jigglylvl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=jigglylvl.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.forload.net/?v=jigglyppp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.forload.net/?v=jigglyppp.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c3d270ae20632cc16b810a987d622f68b532ad97","amp;dn":"Bitches+In+Uniform+2+XXX+DVDRip+x264-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3d270ae20632cc16b810a987d622f68b532ad97","infoHashBuffer":{"type":"Buffer","data":[195,210,112,174,32,99,44,193,107,129,10,152,125,98,47,104,181,50,173,151]},"announce":[],"urlList":[]}}