{"title":"FakeAgent - Lucie c1062_lucie_720 {ImgZilla}","uid":8323604,"size":603611957,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c5d3af42a7e85b32f454716a7e73ef69c757f8cd&amp;dn=FakeAgent+-+Lucie+c1062_lucie_720+%7BImgZilla%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":-1,"time":1364748864,"description":"Size: 603611957 bytes (575.65 MiB), duration: 00:44:35, avg.bitrate: 1805 kb/s\nAudio: aac, 44100 Hz, stereo (eng)\nVideo: h264, yuv420p, 1280x720, 25.00 fps\n\n\nLucie (44mins) This 20-year-old European hipster chick was pretty cool until she freaked out at the end of this casting. She wore a bullet around her neck and I was kind of worried about fucking her too hard in case it went off! During the interview. She was hanging on my every word, totally sucked in by my Fake Agent act. She had a vulnerable, nervous laugh, and smiled a lot, fascinated by my cameras! Maybe an exhibitionist I thought, perfect for making porn. When she told me how old she was when she lost her virginity I came a little bit in my pants. Then her clothes came off and she showed me her natural teen body and perky nipples, she had an ass like a Chinese boy. After she sucked me I slid inside her pussy and I could feel her excitement. When I fucked her anally it made her mascara run. I'll be honest, I got into this casting so much that I shot my sperm deep inside her womb without thinking and that's when the bubble burst. She went totally crazy, becoming terrifying and psychotic, shouting at me and swearing in Czech while my cum was dripping out of her cunt and down her legs. I could do nothing but stand there with a limp cock apologizing. Then I felt her hand across my face and for the rest of the night there was ringing in my ears. Now I am paranoid, again. Fuck.","torrent":{"xt":"urn:btih:c5d3af42a7e85b32f454716a7e73ef69c757f8cd","amp;dn":"FakeAgent+-+Lucie+c1062_lucie_720+%7BImgZilla%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d3af42a7e85b32f454716a7e73ef69c757f8cd","infoHashBuffer":{"type":"Buffer","data":[197,211,175,66,167,232,91,50,244,84,113,106,126,115,239,105,199,87,248,205]},"announce":[],"urlList":[]}}