{"title":"Lineage 1 [Classic 1998] L1.5","uid":8048150,"size":1606130625,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c67381e7c2d9aef9f734b01ba825e7c15bc51408&amp;dn=Lineage+1+%5BClassic+1998%5D+L1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CrazyN00b4WiN","files":-1,"time":1358799114,"description":"â–’â–ˆâ–‘â–‘â–‘ â–„â–ˆâ–‘ â–‘ â–ˆâ–€â–€ ã€€ \nâ–’â–ˆâ–‘â–‘â–‘ â–‘â–ˆâ–‘ â–„ â–€â–€â–„ ã€€ \nâ–’â–ˆâ–„â–„â–ˆ â–„â–ˆâ–„ â–ˆ â–„â–„â–€ \n\nLineage (Korean: ë¦¬ë‹ˆì§€) is a medieval fantasy, massively multiplayer online role-playing game (MMORPG) released in the United States in 1998 by the South Korean computer game developer NCsoft. It is most popular in Korea and is available in Chinese, Japanese, and English language versions. The game was designed by Jake Song, who had previously designed Nexus: The Kingdom of the Winds, another MMORPG.\nLineage features 2D isometric-overhead graphics similar to those of Ultima Online and Diablo II. Lineage II: The Chaotic Chronicle, a &quot;prequel&quot; set 150 years before the time of Lineage, was released in 2003. To date, the Lineage franchise has attracted 43 million players. Lineage Eternal, a sequel will be set the time after Lineage and will be the last game in Lineage series.\nNCSoft announced that due to unprofitability the North American Servers would be shut down on June 29, 2011.\n\nL1.5 is a private Lineage server that was started on July 27, 2009 by James (GM Zajako). Since starting out, the population of the server has grown to maintain many users online during both peak hours and off hours. The server has maintained a consistent uptime for 2 years, and has never had a wipe after going live. The longest downtime the server has ever had is 2 hours, which occurred during a server switchover. Overall total down time in the past 2 years is less than 5 hours. All this is thanks to a dual-dedicated-server system which reduces stress on the server and shares the workload.\n\nThe 1.5 server is the only private server available that offers a dynamic environment. New areas and monsters are constantly being added, along with a plethora of new items and other content. The server features several systems that are exclusive among Lineage 1 servers. These include: A PvP Arena, Luck, Soul Weapons, Graded Equipment, and an updated Elixir/Stats system.\n\nThis server caters to both hardcore Lineage players, and those who have never played the game before. There are specialized newbie areas where players can learn the basics of the game, as well as high level hunting zones that require a party of several very strong players.\n\nWe hope you take the time to play the server and enjoy the many experiences it has to offer. We look forward to seeing you in the game!\n\n\n\n\n\n________________________________Server Info________________________________________\n\nIP: 69.175.26.10 (Connect)\nVoice: l15.org (TeamSpeak)\nVote: l15.uservoice.com\n\n\n________________________________Current Events_____________________________________\n\nEXP Event: 1.5x\nSXP Event: 1.5x\nDXP Event: 2x\nVIT Event: 3x\nFree Crack Event!\nFree Death Event!\n\nsite:\n_____www.l15server.com\n\nAbout L1.5\n &lt;a href=&quot;\nhttp://www.l15server.com/guides/about.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.l15server.com/guides/about.html&lt;/a&gt;\n\nAlternative_Download_Link:\n &lt;a href=&quot;\nhttp://v.ht/LineageClassic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://v.ht/LineageClassic&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c67381e7c2d9aef9f734b01ba825e7c15bc51408","amp;dn":"Lineage+1+%5BClassic+1998%5D+L1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c67381e7c2d9aef9f734b01ba825e7c15bc51408","infoHashBuffer":{"type":"Buffer","data":[198,115,129,231,194,217,174,249,247,52,176,27,168,37,231,193,91,197,20,8]},"announce":[],"urlList":[]}}