{"title":"The Gender of Crime","uid":8040761,"size":3352855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c70d81162ec95ecf6261d82ef9aff438942117e7&amp;dn=The+Gender+of+Crime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"imarion","files":-1,"time":1358623684,"description":"Dana M. Britton, &quot;The Gender of Crime&quot;\nEnglish | ISBN: 1442209704 | 2011 | PDF | 192 pages | 3 MB\n\n\nThe Gender of Crime introduces students to how gender shapes our understanding of every aspect of crime. Moving beyond criminological theories and research that have often neglected gender, this dynamic and provocative book shows that gender is central to the definition, prosecution, and sentencing of crimes, that it shapes how victimization is experienced and understood, and that it structures the institutions of the criminal justice system and the experiences of workers within that system. Discussing the intersections of race, class, gender, and sexuality with crime and punishment, this book demonstrates that crime, victimization, and crime control are never generic_they are instead produced and experienced by gendered (and race, and classed, and sexualized) actors within contexts of social inequality. This book highlights key concepts for students and encourages them to think critically through a range of compelling real-life examples, from school violence to corporate crime. The Gender of Crime provides essential reading for students of gender, criminology, and criminal justice alike. ","torrent":{"xt":"urn:btih:c70d81162ec95ecf6261d82ef9aff438942117e7","amp;dn":"The+Gender+of+Crime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c70d81162ec95ecf6261d82ef9aff438942117e7","infoHashBuffer":{"type":"Buffer","data":[199,13,129,22,46,201,94,207,98,97,216,46,249,175,244,56,148,33,23,231]},"announce":[],"urlList":[]}}