{"title":"Jasmine's Threeway Riding Lesson (anal) [720p].wmv","uid":8032411,"size":463599216,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c7e58ae35370e2b1998272af0f4002f0b9f04e87&amp;dn=Jasmine%27s+Threeway+Riding+Lesson+%28anal%29+%5B720p%5D.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1358447434,"description":"\nJasmine's Threeway Riding Lesson (anal) [720p].wmv\n\n\n\nCast:\n\nJasmine Black\n\n\nDescription:\n\n&quot;Master of Busty Riding Academy Lord  Chandler is in his bedroom with beautiful Jasmine. He wants to know what  is under her long white cloak. She takes it off her shoulders and drops  it to the floor. Now he knows. She's wearing black boots and a skimpy  two piece, as tiny as a string bikini. Her large breasts bulge against  the flimsy fabric. In her hand is a riding crop that she runs along Lord  Chandler's chest, teasing him. He comes behind her to play with her  tits and grind his pelvis into hers; she spanks her boobs with the crop  as he kisses her neck from behind. Laying her down on the bed, Lord  Chandler removes her bottoms and fingers her shaven pussy with expert  digits, sucking greedily on her nipples. Jasmine herself sucks on them  too. He stands, his cock dangling out of his fly. Jasmine sits on the  bed, her black boots still on, and hungrily engulfs his shaft into her  wet mouth sliding her hand to the base and back again. The sexy, slim  brunette beauty queen makes sounds of intense pleasure as she tongues  the Lord. As he pulls her head closer to him to swallow every inch, Lord  Chandler's valet enters the bedroom with the evening beverage. &quot;I'm  sorry, sir&quot; he says, an embarrassed look shadowing his face. &quot;I told you  about knocking,&quot; admonishes Chandler. Jasmine, on the other hand, is  excited to see the servant. &quot;Come here,&quot; she orders him. &quot;Yes, miss?&quot; As  soon as he makes his way over to the couple, she reaches out to squeeze  his package. &quot;It looks like she wants an extra,&quot; Chandler observes  matter-of-factly. Cock is removed from trousers and now Jasmine has two  stiff clubs to suck and stroke. She will have her hands full tonight  with these two ramrods. They, in turn, will take her pussy and ass in a  furious double penetration.&quot;\n\n\n\nResolution:   1280x720\n\nDuration:     00:28:31\n\t\nSize:\t      442 MB\n\n\nScreens:\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=90499491139071667754.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=90499491139071667754.jpg&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:c7e58ae35370e2b1998272af0f4002f0b9f04e87","amp;dn":"Jasmine%27s+Threeway+Riding+Lesson+%28anal%29+%5B720p%5D.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7e58ae35370e2b1998272af0f4002f0b9f04e87","infoHashBuffer":{"type":"Buffer","data":[199,229,138,227,83,112,226,177,153,130,114,175,15,64,2,240,185,240,78,135]},"announce":[],"urlList":[]}}