{"title":"Defensive Database Programming with SQL Server by Alex Kuznetsov","uid":8314247,"size":5665825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8e917446e8d9b9e3a58e9dfb771273d53fcd8a8&amp;dn=Defensive+Database+Programming+with+SQL+Server+by+Alex+Kuznetsov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"wadenvan","files":-1,"time":1364548280,"description":"INTRODUCTION\n\nResilient T-SQL code is code that is designed to last, and to be safely reused by others. The goal of defensive database programming, and of this book, is to help you to produce resilient T-SQL code that robustly and gracefully handles cases of unintended use, and is resilient to common changes to the database environment.\n\nToo often, as developers, we stop work as soon as our code passes a few basic tests to confirm that it produces the &quot;right result&quot; in a given use case. We do not stop to consider the other possible ways in which the code might be used in the future, or how our code will respond to common changes to the database environment, such as a change in the database language setting, or a change to the nullability of a table column, and so on.\n\nIn the short-term, this approach is attractive; we get things done faster. However, if our code is designed to be used for more than just a few months, then it is very likely that such changes can and will occur, and the inevitable result is broken code or, even worse, code that silently starts to behave differently, or produce different results. When this happens, the integrity of our data is threatened, as is the validity of the reports on which critical business decisions are often based. At this point, months or years later, and long after the original developer has left, begins the painstaking process of troubleshooting and fixing the problem. ","torrent":{"xt":"urn:btih:c8e917446e8d9b9e3a58e9dfb771273d53fcd8a8","amp;dn":"Defensive+Database+Programming+with+SQL+Server+by+Alex+Kuznetsov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8e917446e8d9b9e3a58e9dfb771273d53fcd8a8","infoHashBuffer":{"type":"Buffer","data":[200,233,23,68,110,141,155,158,58,88,233,223,183,113,39,61,83,252,216,168]},"announce":[],"urlList":[]}}