{"title":"James Kochalka Miscellany Vol 1","uid":8008582,"size":142186155,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cc6215bb6d93182b0e944d6d7e89b4a1ecf3437e&amp;dn=James+Kochalka+Miscellany+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1357950042,"description":"Everything Written and Illustrated by James Kochalka (except where noted otherwise)\n\n'Quit Your Job'\nTop Shelf Productions, 1998, 98 pages \n\nJeff Smith provides the introduction to one of the finest new graphic novels this year. Ignatz Award winner James Kochalka has been called &quot;one of the brightest lights of independent comics&quot; and Quit Your Job is a shining example of his genius. On his way to work at the Chinese restaurant, Magic Boy discovers an enchanted ring and determines to make an expedition to the North Pole. He only gets as far as the coffee shop on the next block, but his world is forever changed in the short journey. Special cover design by Michel Vrana.\n\n\n'Fantastic Butterflies'\nTop Shelf Productions, 2002, 164 pages\n\nOne of the finest new graphic novels this year. James Kochalka has been called &quot;one of the brightest lights of independent comics&quot; and Fantastic Butterflies is a shining example of his genius. Magic Boy wanders drunkenly through a hallucinogenic nightmare world of Cancer Robots, softball showdowns, dance parties, barbecues, time machines, testicular injury, and cake-baking kung-fu cuties! The graphic novel has twists and turns so bizarre you'll be shouting out &quot;OH MY GOD!&quot; and scaring your roommates. It also happens to be hilariously funny and infectious in its bubbly charm, combining autobiography with a kind of magic science-fiction.\n\n'Peanutbutter and Jeremy's Best Book Ever'\nTop Shelf Productions, 2003, 282 pages\n\nAbsolutely adorable! On the surface the story is silly and fun for kids, but for adults it's a clever critique of modern society. Peanutbutter is the hardworking office cat, and Jeremy is the trouble-making crow.\n\n\n'Monkey vs Robot and the Crystal of Power'\nTop Shelf Productions, 2003, 180 pages\n\nThis thought-provoking story is told almost completely without words, relying on Kochalka's expressive illustrations of the title characters. For all the book's humorous and charming appearance, beneath the entertaining veneer lies a stirring examination of the dual nature of existence, the dichotomy within the human mind, and our profound effect on the ecological environment. A modern day fable for readers of all ages, based on the age-old struggle between nature and technology.\n\n\n'Conversation #1'\nTop Shelf Productions, 2004, 28 pages\nWritten and Illustrated by James Kochalka and Craig Thompson\n\nA delightful adult comic book about life and art. &quot;Art gives us a way to process life, to understand it and to gain some control over the pounding wave of experience.&quot;\n\n'Conversation #2' can be found here http://thepiratebay.se/torrent/7617141/Jeffery_Brown_-_Conversation_No_2\n\n\n'James Kochalka Superstar - Don't Trust Whitey'\nMimi-comic from the 2010 James Kochalka Superstar album, 'Don't Trust Whitey' ","torrent":{"xt":"urn:btih:cc6215bb6d93182b0e944d6d7e89b4a1ecf3437e","amp;dn":"James+Kochalka+Miscellany+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc6215bb6d93182b0e944d6d7e89b4a1ecf3437e","infoHashBuffer":{"type":"Buffer","data":[204,98,21,187,109,147,24,43,14,148,77,109,126,137,180,161,236,243,67,126]},"announce":[],"urlList":[]}}