{"title":"Dark Shadows - 2012 - DVDRip - NTSC","uid":8123461,"size":5552930816,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cea881ae5df33d116f07e32c03ab5f7a23385e0c&amp;dn=Dark+Shadows+-+2012+-+DVDRip+-+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EvilUploader","files":-1,"time":1360439855,"description":"Synopsis of Dark Shadows\nTransformed into a vampire and entombed for 200 years after betraying vengeful witch Angelique Bouchard (Eva Green), 18th century fishing magnate Barnabas Collins (Johnny Depp) returns to Collinwood Manor in 1972, only to find his once proud estate in ruins and his family plagued by macabre secrets. It was the year 1752 when Barnabas' parents came to America to expand their business empire. But after establishing the thriving New England fishing town of Collinsport, the family experienced a series of misfortunes when Barnabas fell for the gorgeous Josette DuPres (Bella Heathcoate) and cast aside beautiful witch Angelique, who cursed him with eternal life and buried him deep in the earth. Returning home to Collinwood Manor after being dug up by a construction crew in 1972, Barnabas learns that Angelique has nearly driven his family out of business, and turned the townspeople against them. Determined matriarch Elizabeth Collins Stoddard (Michelle Pfeiffer) employs live-in psychiatrist Dr. Julia Hoffman (Helena Bonham Carter) and enchanting governess Victoria Winters (Heathcoate) to try and help young David Collins (Gully McGrath) get over the mysterious death of his beloved mother, but as Barnabas gets acquainted with his distant ancestors -- including Elizabeth's black-sheep brother Roger (Jonny Lee Miller) and headstrong teenage daughter Carolyn Stoddard (Chloe Moretz) -- their suffering weighs heavily on his shoulders. Later, when Angelique learns that Barnabas has returned on a mission to restore his family to its former glory and fallen for the radiant Victoria (who is actually Josette reincarnate), she vows to make his suffering unimaginable if he should dare refuse her once again. Jackie Earle Haley, Bella Heathcote, and Gulliver McGrath co-star. ~ Jason Buchanan, Rovi\n\nTheatrical Feature Running Time: 113 mins \nComplete Cast of Dark Shadows\nJohnny Depp - Barnabas Collins\nChloe Moretz - Carolyn Stoddard\nGulliver McGrath - David Collins\nRay Shirley - Mrs. Johnson\nJonny Lee Miller - Roger Collins\nThomas McDonell - Barnabas Collins (young)\nHelena Bonham Carter - Dr. Julia Hoffman\nEva Green - Angelique Bouchard\nBella Heathcote - Victoria Winters\nJackie Earle Haley - Willie Loomis\nMichelle Pfeiffer - Elizabeth Collins Stoddard\nEva Green - Angelique\n\n\nDirector(s):Tim Burton\nWriter(s):Seth Grahame-Smith\nProducer(s):Richard D. Zanuck, Christi Dembrowski, Graham King\nTheatrical MPAA Rating: PG13(Violence, Smoking, Profanity, Drug Content, Sexual Situations)\nCategories:Horror\n\nFormat: DVD  \nRelease Date: 10/02/2012\nMPAA Rating: PG13\nRunning Time: 113 min\nNumber of Discs: 1\nLanguage: Eng/Fre/Spa\nSubTitles: Eng/Fre/Spa","torrent":{"xt":"urn:btih:cea881ae5df33d116f07e32c03ab5f7a23385e0c","amp;dn":"Dark+Shadows+-+2012+-+DVDRip+-+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cea881ae5df33d116f07e32c03ab5f7a23385e0c","infoHashBuffer":{"type":"Buffer","data":[206,168,129,174,93,243,61,17,111,7,227,44,3,171,95,122,35,56,94,12]},"announce":[],"urlList":[]}}