{"title":"Sexually Broken--Local Cougar arched, deep throat Beretta James ","uid":8037970,"size":975875090,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d01071e67eee083ca12c9f8ff428c8d087a69bdd&amp;dn=Sexually+Broken--Local+Cougar+arched%2C+deep+throat+Beretta+James+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1358554808,"description":"Local Cougar arched, impaled on custom fucking machine. Inverted deep throating orgasmic overload. | Beretta James | Matt Williams\n\nJanuary 18, 2013 \n \n  \nMP4 only.\n    \n \nWelcome Beretta James back to the pages of Sexually Broken. Beretta was the second person we ever shot, back before a clear direction for the site took shape. We invited her back to feel the firepower of this fully armed and operational website.\n\nAt age 36 Beretta is one of the hottest people on the entire planet. Perfect blowjob lips, huge nipples, beautiful caramel skin, a perfect ass and sexual attitude to go with it. \n\nWe wasted no time locking Beretta into a custom made back-breaking bondage device. A thick leather collar around her neck is locked to the device. Her mouth rests at a perfect height for a deep throat fucking. A custom made fucking machine is impaled deep into her wet shaved pussy. \n\nTurn on the fucking machine and let the games begin! The machine and huge dildo that fills Beretta's tight little pussy is positioned to hit the G spot over and over. We can easily control the speed, we turn it up to &quot;She can't help but cum speed&quot; and the moaning begins. The machine is relentless and never tires, it's steady rhythm drives Beretta mad with desire. She is going to cum in the first 30 seconds and she knows she won't be able to stop cumming. This frightens, but excites her further, actually causing her to cum faster and harder, a vicious circle from which there is no escape.\n\nTo make things better, or worse if you're Beretta, we place hard cock up to her moaning lips. She parts them because she can't help herself, orgasm after orgasm is ripping through her body and the cock pressing against her soft lips feels warm and hard. She opens up her mouth, giving us her throat to use and abuse. We do not disappoint. While being mechanically fucked to orgasm after orgasm on one side, a hard cock is fucking our helpless cougars mouth on the other side. The cock slides all the way down her throat and now she fights for air. We control her breathing with cock. There is no way to turn her head, nowhere to hide, the cock fills her mouth and throat over and over as her pussy is brutally fucked.\n\nWe oil up Beretta's amazing caramel skin and add a vibrator to her clit. Now the machine is fucking her into oblivion, the vibrator makes her cum even harder then before and the cock is jammed all the way down her throat, she is AIR TIGHT and cumming. Pushed to her very limit of enduring this sexual onslaught, we fuck her skull harder then ever before, we pull out and CUM all over her pretty face. We leave her in deep subspace, with jism dripping down into her nose and eyes. We turn up the machine to a much higher setting and walk away, listening to our little slut cum well into the afternoon... \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/01_18bjames6/SexuallyBroken-Beretta-James-Matt-Williams-Local-Cougar-arched-impaled-on-custom-fucking-machine-Inverted-deep-throating-orgasmic-overload.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/01_18bjames6/SexuallyBroken-Beretta-James-Matt-Williams-Local-Cougar-arched-impaled-on-custom-fucking-machine-Inverted-deep-throating-orgasmic-overload.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d01071e67eee083ca12c9f8ff428c8d087a69bdd","amp;dn":"Sexually+Broken--Local+Cougar+arched%2C+deep+throat+Beretta+James+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d01071e67eee083ca12c9f8ff428c8d087a69bdd","infoHashBuffer":{"type":"Buffer","data":[208,16,113,230,126,238,8,60,161,44,159,143,244,40,200,208,135,166,155,221]},"announce":[],"urlList":[]}}