{"title":"The Gods of Mars by Edgar Rice Burroughs [republicV]","uid":7860579,"size":2181668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d06e1d1e2bcfdb51cf5b634e3635b5a4623ff8ae&amp;dn=The+Gods+of+Mars+by+Edgar+Rice+Burroughs+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"republicV","files":-1,"time":1353921392,"description":"The Gods of Mars is a 1918 Edgar Rice Burroughs science fiction novel, the second of his famous Barsoom series. It can be said that the novel set the tone for much science fiction to come. Its influence can clearly be seen in franchises such as Star Trek and Farscape. While Burroughs no doubt borrowed liberally from the pulp fiction of his day, particularly westerns and swashbuckling tales, the pacing and themes set the tone for the soft science fiction genre.\n\nThe protagonist, John Carter, with his proficiency in hand-to-hand combat and flirtations with beautiful alien women, could be said to have set the mold for later influential icons like Captain James T. Kirk and James Bond.\n\nAt the end of the first book, A Princess of Mars, John Carter is unwillingly transported back to Earth. The Gods of Mars begins with his arrival back on Barsoom (Mars) after a ten year hiatus, separated from his wife Dejah Thoris, his unborn child, and the Red Martian people of the nation of Helium, whom he has adopted as his own. Unfortunately, John Carter materializes in the one place on Barsoom from which nobody is allowed to depart: the Valley Dor, which is the Barsoomian heaven.","torrent":{"xt":"urn:btih:d06e1d1e2bcfdb51cf5b634e3635b5a4623ff8ae","amp;dn":"The+Gods+of+Mars+by+Edgar+Rice+Burroughs+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d06e1d1e2bcfdb51cf5b634e3635b5a4623ff8ae","infoHashBuffer":{"type":"Buffer","data":[208,110,29,30,43,207,219,81,207,91,99,78,54,53,181,164,98,63,248,174]},"announce":[],"urlList":[]}}