{"title":"zorin-os-6.1-core-32.iso","uid":8114060,"size":1461989376,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d31d2399c961df44e21146292f00689d9e566050&amp;dn=zorin-os-6.1-core-32.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"maldboy","files":1,"time":1360253656,"description":"If you wish to install Zorin OS to your computer please follow this guide:\n\n\n1. First go to the Download page DOWN and download Zorin OS.\n\n2. When the download is finished burn the image file to a blank DVD (any type). You can download ImgBurn if you don't have a CD/DVD burning program already installed.If you can't use DVDs, you can burn the .iso to a USB stick by using UNetBootin.\n\n3. When the burning process is completed insert the DVD into the computer and restart with it still in. The computer should boot from the DVD, if not you should change the settings in the BIOS or press F12 (or whatever key it is to select the boot device) while booting up again.\n\n4. Press the Enter key to start the LiveDVD, this is a thing that lets you run the operating system off the DVD without installing it onto your computer.\n\nNOTE: The Live DVD runs much slower than after the full installation.\n\n5. Click the Install icon on the desktop if you choose to install it onto your computer. This opens a window, now you can select your desired settings.\n\n6. Later you will be prompted to make a new partition, a partition is a thing you make if you want to install an alternate operating system. This slices your Hard Drive to allow the installation of another operating system. The minimum size for Zorin OS Core is 5 Gigabytes (Just remember to leave enough space for your first operating system).\n\n7. During the installation you will be asked to select your language (over 55 are available), your location, time settings, keyboard layout, partitioning settings and import your files, settings and user accounts from your Windows installation (if you have one).\n\n8. The installation should take 10 minutes up to an hour.\n\n9. After the installation you will be prompted to restart the computer, after the restart the computer should boot up into a menu where you choose which operating system you want to start. To select one use the arrow keys to highlight an option and press the Enter key to start the highlighted one.\n\nNow you should have Zorin OS installed to your computer.\n","torrent":{"xt":"urn:btih:d31d2399c961df44e21146292f00689d9e566050","amp;dn":"zorin-os-6.1-core-32.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d31d2399c961df44e21146292f00689d9e566050","infoHashBuffer":{"type":"Buffer","data":[211,29,35,153,201,97,223,68,226,17,70,41,47,0,104,157,158,86,96,80]},"announce":[],"urlList":[]}}