{"title":"Blue Mountain - Omnibus [2008] [FLAC]","uid":8145501,"size":372633026,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8839a0277dbf5d8a6ffa67d69bb04f5b7837d2e&amp;dn=Blue+Mountain+-+Omnibus+%5B2008%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":16,"time":1360909981,"description":"one of Dicks Americana collection\n\nArtist: Release: Omnibus\nMusicBrainz: 3349a755-58ba-432d-99d6-5d6e7f7ef090\n\nTracklisting:\n\n01. Blue Canoe (04:24)\n02. Myrna Lee (03:44)\n03. Lakeside (03:11)\n04. Soul Sister (04:50)\n05. Generic America (04:30)\n06. When You're Not Mine (03:14)\n07. Wink Of An Eye (03:10)\n08. Bloody 98 (03:07)\n09. Mountain Girl (04:12)\n10. Band Called Bud (03:49)\n11. Poppa (03:23)\n12. Hippy Hotel (04:53)\n13. The One That Got Away (02:37)\n14. Sleeping In My Shoes (02:45)\n\nThere is a long and rich if somewhat unfortunate tradition of veteran country acts re-recording their classic material for a new label in the latter years of their career, and Blue Mountain have apparently chosen to introduce this phenomenon to the alt-country community. Blue Mountain recorded four good-to-excellent albums for Roadrunner Records between 1995 and 2001, breaking up not long after the release of Roots. In 2008, Blue Mountain has reunited and now that bassist Laurie Stirratt is running an independent record label, the band has chosen to recut 14 songs from Dog Days, Home Grown, and Tales of a Traveler for a de facto &quot;Greatest Almost Hits&quot; collection called Omnibus. (This album has also been released at the same time as another album of new Blue Mountain material, Midnight in Mississippi). While this album was probably created so that Blue Mountain could earn a second payday from these songs, there's little arguing that they've done right by the music; the production on Omnibus is simple and straightforward but effective, and the arrangements don't stray far from the versions fans have come to know and love without sounding at all rusty. Omnibus was recorded after a seven-year layoff, but Blue Mountain sound admirably tight and emphatic in the studio; they tear into these songs with the respect they deserve, and while nothing on here tops the original recordings, they come close enough that folks who've always wanted a well-chosen collection of the group's best songs will be satisfied with this disc. Of course, the relatively small number of people who fall into that category probably own the group's back catalog, or might be swayed towards buying the recent expanded reissue of Dog Days, which is still Blue Mountain's best album. But in a field of endeavor that's usually pockmarked with bad decisions, Omnibus is a modest but genuine success.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:d8839a0277dbf5d8a6ffa67d69bb04f5b7837d2e","amp;dn":"Blue+Mountain+-+Omnibus+%5B2008%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8839a0277dbf5d8a6ffa67d69bb04f5b7837d2e","infoHashBuffer":{"type":"Buffer","data":[216,131,154,2,119,219,245,216,166,255,166,125,105,187,4,245,183,131,125,46]},"announce":[],"urlList":[]}}