{"title":"Mahanagar (1963) Bengali_Xvid 2cd_Eng Subs [DDr]","uid":8131551,"size":1468614993,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db77ae5f58f0278dcc10c2f9c44b2eb6b122530e&amp;dn=Mahanagar+%281963%29+Bengali_Xvid+2cd_Eng+Subs+%5BDDr%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1360614887,"description":"DDR Presents\n\nMahanagar (1963) Bengali_Xvid 2cd_Eng Subs [DDr]\n\nSatyajit Ray won the Silver Bear for Best Director at the 14th Berlin International Film Festival in 1964. \nUpon its delayed (1968) release in the United States, it drew praise from Roger Ebert, Pauline Kael and others. The film was selected as the Indian entry for the Best Foreign Language Film at the 36th Academy Awards, but was not accepted as a nominee. \nThe film won All India Certificate of Merit for the Third Best Feature Film in 1963 at 11th National Film Awards.\n\nCAST:-\nAnil Chatterjee .......... Subrata Mazumdar\nMadhabi Mukherjee ... Aarti Mazumdar\nJaya Bhaduri ............. Bani\nHaren Chatterjee ....... Priyogopal (Subrata's father)\nSefalika Devi ............ Sarojini (Subrata's Mother)\nProsenjit Sarkar ....... Pintu\nHaradhan Bannerjee . Himangshu Mukherjee\nVicky Redwood ........ Edith\n\nDirected by Satyajit Ray\nMusic Director: Satyajit Ray\nStory: Narendranath Mitra\nWritten by Satyajit Ray, from a story, Abataranika by Narendranath Mitra\n\n\nMOVIE REVIEW:- Mahanagar (1963)\nCalcutta, mid 1950s. The film opens with a vignette of a lower middle-class family. We meet the joint-family: Subrata Mazumdar (Anil Chatterjee), his wife Arati (Madhabi Mukherjee), their young son, Subrata's unmarried sister Bani (Jaya Bhaduri), his father, a retired schoolmaster, and his mother.Subrata Mazumdar, a bank employee, with his meagre income finds it difficult to provide for his large joint family. His father needs a new pair of prescription glasses, younger sister Bani's school fee is due, and mother needs a new can of Zardah (tobacco)...\n\nArati is like an anchor holding the family together. Subrata talks about a couple where the woman too is going to work. Soon, Arati makes up her mind to take up a job to supplement the household income. With some help from Subrata, and much against established custom and opposition of the elders, she finds a job of selling sewing machines door-to-door.\n\nGoing out to work, Arati discovers a new life. She proves successful in her work and gains self-confidence. Subrata now feels insecure and resentful. His father too puts pressure on his son to force Arati to quit the job. Subrata asks Arati to quit as he plans to earn more by moonlighting.\n\nThe next morning, before Arati can give in her resignation, Subrata telephones her and asks her not to resign as he has lost his job. Now, Arati is the only earning member of the family. Subrata suffers as he watches his wife go out while he sits in bed and scans newspapers for jobs' columns. They begin to grow apart.\n\nArati has found a new friend in a colleague - Edith, an Anglo-Indian woman. Her boss does not like Edith due to her being an offspring of 'our ex-rulers.' Blinded by his prejudice, he accuses Edith of loose character and fires her. Arati asks her boss to apologise to Edith. He refuses and warns her about her own job. Arati hands over her old resignation letter and walks away.Now neither Arati nor her husband has a job. On her way out, she meets Subrata. After the initial shock, they reconcile and are close to each other once again. Subrata understands her. Arati ponders that in such a big city at least one of them is sure to find a job. As they walk into the city crowd, the camera tilts up to a street lamp.\n\nIn her first Ray film, Madhabi Mukherjee, gives a wonderful portrayal of Arati. Contrary to the general belief, She was not a discovery of Satyajit Ray. It was her performance in Mrinal Sen's Baisey Sravan (1959) that prompted Ray to cast her as Arati. She appeared in two other films of Ray: Charulata (The Lonely Wife, 1964) and Kapurush. (The Coward, 1965). Uncharacteristically for Ray, this collaboration came to an end with Kapurush though she continued to work as an actress.\n\nThe confined and gloomy but intimate atmosphere of the joint family was created with the sets for the house having very small rooms with fixed walls. Ray told his biographer, Andrew Robinson, &quot; In those days I don't think anyone built four-walled rooms. It gave us very little room to move about, so there are no long shots at all.&quot;\nWhat others say...\n&quot; The film does what it sets out to do, and it's perceptive and revealing; it stays with one. Yet it is very quiet and rather thin; it lacks the depths and richness and creative imagery of the best of Satyajit Ray.&quot;\n- Pauline Kael\n\n&quot; Ray has an unmatched feeling for the moments when a situation caches people unawares and minds perceptibly expand or contract when confronted with some infinitesimal stress.&quot;\n- Penelope Houston, Spectator, May 17, 1968 \n.\nSYNOPSIS:- Mahanagar (1963)\nSet in Calcutta during the 1950s Mahanagar explores the evolving independence of middle-class women of the city. Arati (Madhabi Mukherjee), a home maker, takes up a job as a door-to-door saleswoman to meet the increasing financial pressure on her family. Despite familial adversity and societal obstacles the initially hesitant and nervous Arati soon begins to prosper in her field and gradually starts to enjoy her new found financial and psychological independence. Her initially supportive husband, Subrata (Anil Chatterjee), who now starts to feel insecure decides to ask Arati to quit but is finally forced to let her continue to work once he loses his job. Arati now becomes the sole breadwinner of the family and also befriends an English-speaking, Anglo-Indian (representative of the legacy of the British Raj) colleague Edith (Vicky Redwood), a move which raises suspicion and increases conflict within her family\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Bengali\nRunTime: 1:58:22\nSubtitles: Hard Coded English\nRipped by: Trinidad [DDR]   \nDuration: 1:58:22","torrent":{"xt":"urn:btih:db77ae5f58f0278dcc10c2f9c44b2eb6b122530e","amp;dn":"Mahanagar+%281963%29+Bengali_Xvid+2cd_Eng+Subs+%5BDDr%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db77ae5f58f0278dcc10c2f9c44b2eb6b122530e","infoHashBuffer":{"type":"Buffer","data":[219,119,174,95,88,240,39,141,204,16,194,249,196,75,46,182,177,34,83,14]},"announce":[],"urlList":[]}}