{"title":"Coast to Coast AM January 10 2013","uid":8007061,"size":57026805,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dbde3c7ae3060a180d51b30311b3db89f47efbc2&amp;dn=Coast+to+Coast+AM+January+10+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1357915193,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-10-13\nHost: \tJohn B. Wells\nGuests: \tDr. Bob Wright, Craig Hulet\n\nIn the first half of the show, analyst of geopolitics and foreign policy, Craig B. Hulet, joined John B. Wells to share reactions to the news that the Obama administration may seek to ban some type of guns. Hulet argued that while the progressive left has been on the leading edge of protest when it comes to the chipping away at 1st and 4th amendment rights, they are working against supporting the 2nd amendment, the right to bear arms. &quot;Obama has threatened to use an executive order to ban specific sidearms or assault weapons,&quot; and this is both a violation and debasement of the Constitution, he declared.\n\n&quot;I think the NRA has long failed in protecting gun rights because of their approach,&quot; Hulet continued, adding that anti-gun groups/progressives make a better argument against guns &quot;because they lie better&quot; in their twisting of the facts. If we lose the 2nd Amendment, then there's nothing in the Bill of Rights or Constitution that won't go out the window, Hulet lamented, noting that privacy rights have already been heavily eroded.\n\n-------------------------------------\n\nIn the latter half, executive coach and author Dr. Bob Wright discussed the crossover between science and human development, and the role of change and transformation in our lives. He differentiated learning (what I know today that I didn't know yesterday) and growth (doing today what I didn't do yesterday) from the idea of transformation, which is doing something that you'd never imagined. Transformation involves taking remarkable leaps forward, but in order for this to happen, you need to tap into who you are in very deep ways, he said. This involves learning to be fully present where you are, and access a deeper yearning with velocity and effectiveness, he explained.\n\nTransformers figure out how to listen to themselves internally, and understand their emotional vocabulary, said Wright. He spoke about his research into &quot;positive deviants,&quot; outliers who demonstrate abnormally positive traits and have the capacity to affect change in the world. He also outlined three different types of happiness-- the hedonic (pleasure related), engaged happiness (activity related), and the highest level-- meaningful happiness, when a person has a sense of importance that what they are doing is contributing to others.\nWebsite(s):\n\n    wrightliving.com/transformed\n    drbobwright.com\n    craigbhulet.com\n\nBook(s):\n\n    Transformed!: The Science of Spectacular Living\n    The Hydra of Carnage\n\n","torrent":{"xt":"urn:btih:dbde3c7ae3060a180d51b30311b3db89f47efbc2","amp;dn":"Coast+to+Coast+AM+January+10+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbde3c7ae3060a180d51b30311b3db89f47efbc2","infoHashBuffer":{"type":"Buffer","data":[219,222,60,122,227,6,10,24,13,81,179,3,17,179,219,137,244,126,251,194]},"announce":[],"urlList":[]}}