{"title":"Fieldrunners 2 (1-click run)","uid":8152599,"size":394096017,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dce9061a864de4e7f77e01c499b531065647f776&amp;dn=Fieldrunners+2+%281-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1361087014,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from USB-Stick.\nThese are a few things that makes a '1-click run' version a, better version.\nYou can find uninstall information here: http://www.friendsinwar.com/information.php\n\nDescription:\nThe massive sequel to the award winning tower defense game, Fieldrunners, introduces more levels, more weapons, more enemies, and more ways to play. With all that content, Fieldrunners 2 is slated to be the ultimate tower defense experience!\n\nGame Features:\n25 unique, hand painted levels spanning 4 distinct zones across Fieldrunners Island\nOver 20 weapons to choose from at the start of each level\nFace waves of fieldrunners that navigate the battlefield with unparalleled realistic swarming behavior\nMulti-storied maps route enemies over bridges, under tunnels, and into trenches\nRevolutionary Î“Ã‡Â£Hybrid MapsÎ“Ã‡Â¥ combine the fun of designing mazes with the challenges of fixed path layouts\nSudden Death maps pit players against never ending hordes of enemies in an all new, action packed levels\nPuzzle Maps are bonus levels that put playersÎ“Ã‡Ã– understanding of enemy behaviors to the test\nOver 30 different enemy types, including elite enemy units with special attacks and rewards\nPowerful items allow players to perform precision based attacks like never before","torrent":{"xt":"urn:btih:dce9061a864de4e7f77e01c499b531065647f776","amp;dn":"Fieldrunners+2+%281-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dce9061a864de4e7f77e01c499b531065647f776","infoHashBuffer":{"type":"Buffer","data":[220,233,6,26,134,77,228,231,247,126,1,196,153,181,49,6,86,71,247,118]},"announce":[],"urlList":[]}}