{"title":"W.Pustyni.I.W.Puszczy.2001.POLiSH.MULTiSUBS.DVDR.PAL-MC5","uid":8321557,"size":4656154624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:de46d3ec24a31c634538ae7199e05487212d44a6&amp;dn=W.Pustyni.I.W.Puszczy.2001.POLiSH.MULTiSUBS.DVDR.PAL-MC5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"a.kassa","files":13,"time":1364684651,"description":"English title: In Desert and Wilderness\n\n\nA Polish super-spectacular and, next to Quo Vadis, the most popular film of 2001 in Poland, the movie brings to the screen a children's adventure epic that Nobel Prize winner Henryk Sienkiewicz wrote in 1911. Though set in the 19th Century, the film's opening sequences present a world of strife and hostage taking between Muslim Arabs and Africa's European colonizers that are as topical as yesterday's headlines.\n\n\nAmong victims are Stas Tarkowski, the 14 year old son of a Polish engineer working on the construction of the Suez Canal and of his 8 old companion, Nel, who are taken hostages as the result of that strife. Following a camelback trek across the desert and various adventures, their fate is joined with that of two other hostages, the black African youngsters, Kali and Mea.\n\n\n\nFreeing themselves from their captors, the foursome cross jungle and savannas, face a string of perilous situations and share their skills while confronting assorted wild animals as they trek through the African continent aiming for the coast and reunion with their parents. A rollicking adventure tale, shot on location in Africa, the film's beautiful settings add to the enchantment of a novel that Sienkiewicz, who had spent time in Africa, wrote in part as a protest against slavery on that continent and as a patriotic inspiration for Polish youth in then partitioned Poland. ","torrent":{"xt":"urn:btih:de46d3ec24a31c634538ae7199e05487212d44a6","amp;dn":"W.Pustyni.I.W.Puszczy.2001.POLiSH.MULTiSUBS.DVDR.PAL-MC5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de46d3ec24a31c634538ae7199e05487212d44a6","infoHashBuffer":{"type":"Buffer","data":[222,70,211,236,36,163,28,99,69,56,174,113,153,224,84,135,33,45,68,166]},"announce":[],"urlList":[]}}