{"title":"The Ed Show 12-28-12.mp4","uid":7971164,"size":207197356,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:de75a2bcc6a7cc444e1cda495f177cef73d12956&amp;dn=The+Ed+Show+12-28-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1356848917,"description":"The Ed Show; December 28, 2012. Guest host: Michael Eric Dyson\n\nIt's the home stretch for the forced austerity deadline. But is there still hope?\n\nFriday, Michael Eric Dyson (MSNBC Political Analyst, Professor of Sociology at Georgetown University, and author of &quot;Can You Hear Me Now?&quot;, filled in for Ed. He talked to Sen. Sheldon Whitehouse (D-RI) and Rep. Jan Schakowsky (D-IL) about the latest in Friday's high stakes meeting at the White House.\n\nThen, this Congress is the worst Congress ever. [Unbeknownst to Michael this became official.] Robert Reich (Former U.S. Labor Secretary and UC Berkeley Professor), and Amanda Terkel (Politics Managed Editor for The Huffington Post) explained why.\n\nChicago reached the tragic milestone of 500 homicides in 2012. Rev. Jesse Jackson Sr., founder and president of the Rainbow PUSH Coalition, talked with Professor Dyson about the rise of violence in Chicago and how the curb gun violence in our cities.\n\nThe country re-elected its first African-American president, but that hasn't stopped some from engaging in hate speech and racist stunts. Marc Morial (President/CEO of The National Urban League), and Marcia Dyson (Social Activist), weighed in.\n\nAnd in The Big Finish, Kentucky Senator Mitch McConnell's inaction on the fiscal cliff could cost 24,000 unemployed in his state their benefits. John Nichols (Washington Correspondent of The Nation) joined to discuss that.\n\n)________________________________________________________________________(\nSide note: Sorry about the hiatus my computer was on the fritz.","torrent":{"xt":"urn:btih:de75a2bcc6a7cc444e1cda495f177cef73d12956","amp;dn":"The+Ed+Show+12-28-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de75a2bcc6a7cc444e1cda495f177cef73d12956","infoHashBuffer":{"type":"Buffer","data":[222,117,162,188,198,167,204,68,78,28,218,73,95,23,124,239,115,209,41,86]},"announce":[],"urlList":[]}}