{"title":"Al Kooper - You Never Know Who Your Friends Are [1969] [FLAC]","uid":8155985,"size":269221248,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:de7f616a5e101540d6a1feabbfda132221c9c8cf&amp;dn=Al+Kooper+-+You+Never+Know+Who+Your+Friends+Are+%5B1969%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":12,"time":1361169136,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\n1 &quot;Magic in My Socks&quot;\n2 &quot;Lucille&quot;\n3 &quot;Too Busy Thinkin' 'bout My Baby&quot; (Norman Whitfield, Janie Bradford)\n4 &quot;First Time Around&quot;\n5 &quot;Loretta (Union Turnpike Eulogy)&quot;\n6 &quot;Blues, Part IV&quot;\n7 &quot;You Never Know Who Your Friends Are&quot;\n8 &quot;The Great American Marriage / Nothing&quot;\n9 &quot;I Don't Know Why I Love You&quot; (Lula Mae Hardaway, Don Hunter, Paul Riser, Stevie Wonder)\n10 &quot;Mourning Glory Story&quot; (Harry Nilsson)\n11 &quot;Anna Lee (What Can I Do For You)&quot;\n12 &quot;I'm Never Gonna Let You Down&quot;\n\nAl Kooper's second solo album is a bit more uneven than its predecessor, I Stand Alone, for understandable reasons -- it would have been nothing less than a miracle for Kooper to have matched the consistency and daring of that album, and he doesn't have quite the same array of memorable tunes here. He's still ranging freely, however, through pop, jazz, R&amp;B, and soul, with some songs that are among the most glorious of his output. &quot;Magic in My Sock&quot; is a good enough opener, making up in its virtuoso horn parts and guitar for what it lacks in melodic invention; &quot;Lucille&quot; is hardly the best ballad that Kooper has ever written, but it forms a good bridge to &quot;Too Busy Thinkin' About My Baby,&quot; a Motown cover that's one of the highlights of Kooper's entire output -- from a black singer this track would be a priceless gem, but coming from Kooper it's extraordinary in its every nuance. You get some blues instrumental (principally piano-based) and an abortive but entertaining effort at pop/rock with the title tune, and then Kooper plunges into arty balladry with the hauntingly beautiful &quot;The Great American Marriage/Nothing.&quot; He goes back into Motown territory, just as successful as before, on &quot;I Don't Know Why I Love You,&quot; and back to moody art-song with Harry Nilsson's &quot;Mourning Glory Story.&quot; Kooper returns to the soulful side of rock on &quot;Anna Lee (What Can I Do for You)&quot; and finishes with &quot;I'm Never Gonna Let You Down&quot; -- the latter would be worth the price of the album by itself, a soaring, more lyrical and moody original classic that manages to be unpretentious yet epic in its treatment.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:de7f616a5e101540d6a1feabbfda132221c9c8cf","amp;dn":"Al+Kooper+-+You+Never+Know+Who+Your+Friends+Are+%5B1969%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7f616a5e101540d6a1feabbfda132221c9c8cf","infoHashBuffer":{"type":"Buffer","data":[222,127,97,106,94,16,21,64,214,161,254,171,191,218,19,34,33,201,200,207]},"announce":[],"urlList":[]}}