{"title":"Spartacus S03E05 HDTV Nl subs DutchReleaseTeam","uid":8222665,"size":457393467,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:def29d20f0b8be6c7099746e9ee6b3cf071ac400&amp;dn=Spartacus+S03E05+HDTV+Nl+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Koedje","files":-1,"time":1362510406,"description":"[img]http://img594.imageshack.us/img594/4859/spartacuswarofthedamned.jpg[/img]\n\n\nPlot:\n\nGaius Claudius Glaber is dead. Many months have passed since his defeat, and the rebel army, led by Spartacus and his generals Crixus, Gannicus and Agron, continue to amass victories over Rome. With the rebel numbers swelling to thousands of freed slaves, it has become a force that has started to challenge even the mighty armies of Rome.\n\nSpartacus is more determined than ever to bring down the entire Roman Republic. Following the death of Ashur, Naevia and Crixus fight as one with newfound strength and determination. And Gannicus, always seeking to\nembrace life to the fullest, shares his bed with the beautiful and dangerous Saxa.\n\nTogether, the rebels engage in one bloody skirmish after another and prepare for the inevitable: a full out war with Rome.\n\nThe Roman Senate turns to its wealthiest citizen, Marcus Crassus, for aid. A powerful, strategic politician, he respects his opponent and refuses to make the same mistakes Glaber and his predecessors have. With a young and fiercely competitive Julius Caesar as an ally, Crassus is determined to crush Spartacus and his rebellion.\n\nThe epic conclusion of a legendary journey, Spartacus: War of the Damned will unleash a battle unlike anything ever seen before.  \n\n\n\nQuality over Quantity Releases Vertaling\nVertaald door Renhoek en ChillyWitch\n\n\n\nSeizoen 3 Aflevering 5: Blood Brothers\n\nSpartacus puts a plan in motion to weaken Crassus forces and gain the upper hand. Betrayal threatens to foil the plan.\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.org/\n\n\nFollow me on #Twitter @Koedje\n\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:def29d20f0b8be6c7099746e9ee6b3cf071ac400","amp;dn":"Spartacus+S03E05+HDTV+Nl+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"def29d20f0b8be6c7099746e9ee6b3cf071ac400","infoHashBuffer":{"type":"Buffer","data":[222,242,157,32,240,184,190,108,112,153,116,110,158,230,179,207,7,26,196,0]},"announce":[],"urlList":[]}}