{"title":"Sexually Broken----Bondage Legend  Wenona  Matt Williams","uid":8212940,"size":1175463447,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e0216415e8f5d171ff574c86012f3123090bbfa4&amp;dn=Sexually+Broken%5C----Bondage+Legend++Wenona++Matt+Williams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1362275156,"description":"Sexually BrokenBondage Legend Wenona, gets Skull Fucked, for first time in bondage! Massive screaming orgasms!  Wenona  Matt Williams\n\n\nMp4 Only\n\nWe are proud to present bondage legend Wenona for a special update on Sexually Broken! Wenona has been modeling for bondage companies for the past 12 years. She is a former runway model, gymnast and collegian athlete. Today is special. Today, for the first time ever, Wenona is going to suck real cock in a bondage shoot.\n\n Completely helpless, bound in the splits on a custom made 6x6 frame, Wenona finds herself with a fucking machine impaled in her tight pussy. She is in an inverted spread position with her sexy mouth at cock height. \n\nWe ramp up the machine and in seconds Wenona is moaning and cumming. We step in and push a hard cock down her throat. The cock acts like a gag, because Wenona can't stop cumming and she is a noisy bitch. We fuck Wenona throat deep and hard, we get that slippery throat spit all over her face as she continues to cum like a whore.\n\n All her muscles, her 6 pack abs and her toned body do nothing to save her, she is as helpless as a new born babe as the machine fucks her deep and hard. However, the machine is defeated by her tight pussy, on one massive orgasm Wenona's pussy breaks the fucking machine with it's vice like grip. \n\nWe replace the machine with a vibrator. Wenona's clit is so sensitive that when she cums she screams on perfect high pitch note for what seems like an eternity. This is something you cannot miss if you're a fan of helpless gymnasts being made to cum while they are helpless to stop it! \n\n\nScreens    &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_27wenona2/SexuallyBroken-Wenona-Matt-Williams-Bondage-Legend-Wenona-gets-Skull-Fucked-for-first-time-in-bondage-Massive-screaming-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_27wenona2/SexuallyBroken-Wenona-Matt-Williams-Bondage-Legend-Wenona-gets-Skull-Fucked-for-first-time-in-bondage-Massive-screaming-orgasms.php&lt;/a&gt;\n\n10 000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:e0216415e8f5d171ff574c86012f3123090bbfa4","amp;dn":"Sexually+Broken%5C----Bondage+Legend++Wenona++Matt+Williams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0216415e8f5d171ff574c86012f3123090bbfa4","infoHashBuffer":{"type":"Buffer","data":[224,33,100,21,232,245,209,113,255,87,76,134,1,47,49,35,9,11,191,164]},"announce":[],"urlList":[]}}