{"title":"James Kochalka - SuperFuckers","uid":8008216,"size":104730899,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e0be7094aaaa3233e525838a931eb381d5e17d92&amp;dn=James+Kochalka+-+SuperFuckers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1357943280,"description":"Mods: This is NOT an adult/porn title.\n\nThis book is actually titled 'SuperF*ckers', but you can't use the asterisk in a file name or a Pirate Bay search. As such, I went with the correct spelling for the search and 'SuperF-ckers' for the file name, as that's what people appeared to be doing already.\n\nAlso, this is the TPB version as it was printed. As Kochalka explains in the book, 'For historical accuracy, this comics are reproduced as they originally appeared, with logos &amp; prices and shit.'\n\n\n'SuperF*ckers'\n\nTop Shelf Productions, 2010, 146 pages\n\nWritten and Illustrated by James Kochalka\n\n\nFoul-mouthed, filthy-minded, and completely oblivious, these young &quot;heroes&quot; do everything BUT fight crime - they're too busy getting high, hazing the new kids, playing video games, scheming to be team leader, and designing new costumes. SuperF*ckers collects all four fan-favorite issues of Kochalka's over-the-top series, plus the all-new Jack Krak one-shot!\n\nA superhero team book like no other, Kochalka's gleefully disjointed romp explores what a group of young, confused people with superpowers would probably actually do, which is to say what the ones without superpowers tend to do: spend all their time playing cruel social-hierarchy games, indulging in awkward sexual experimentation, one-upping each other's potty-mouths, and figuring out creative ways to get high. Naturally, Kochalka draws it in his standard ultra-cute, clear-line style. Even his lines are mostly in a palette of simple, flat colors, giving the artwork a sense of candy-cane playfulness. The bulk of this collection was originally published as issues 271, 273, 277, and 279 of an ongoing series (no other issues exist, of course, but it's a hilarious excuse for Kochalka to dispense with pesky necessities like exposition and resolving cliffhangers); they're accompanied here by a solo story about the sycophantically adored and wildly irritable hero Jack Krack. There's a disarming sweetness about the whole thing, despite the satirical over-the-top vulgarity and the patina of angst and nastiness; even the occasional explosions of violence are adorable and briskly healed up.\n\n","torrent":{"xt":"urn:btih:e0be7094aaaa3233e525838a931eb381d5e17d92","amp;dn":"James+Kochalka+-+SuperFuckers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0be7094aaaa3233e525838a931eb381d5e17d92","infoHashBuffer":{"type":"Buffer","data":[224,190,112,148,170,170,50,51,229,37,131,138,147,30,179,129,213,225,125,146]},"announce":[],"urlList":[]}}