{"title":"Representing Black Music Culture: Then, Now, and When Again? (Af","uid":8226686,"size":17246677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1575ed6175ae0a615aeb996e80eb2317826754d&amp;dn=Representing+Black+Music+Culture%3A+Then%2C+Now%2C+and+When+Again%3F+%28Af&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tmPhoneix","files":1,"time":1362617865,"description":"Publication Date: October 7, 2011 | Series: African American Cultural Theory and Heritage\nIn this collection of essays, interviews, and profiles, William Banfield reflects on his life as a musician and educator, as he weaves together pieces of cultural criticism and artistry, all the while paying homage to Black music of the last 40 years and beyond. In Representing Black Music Culture: Then, Now, and When Again?, Banfield honors the legacy of artists who have graced us with their work for more than half a century.\n\nThe essays and interviews in this collection are enhanced by seven years of daily diary entries, which reflect on some of the country's most respected Black composers, recording artists, authors, and cultural icons. These include Ornette Coleman, Bobby McFerrin, Toni Morrison, Amiri Baraka, Gordon Parks, the Marsalis brothers, Spike Lee, Maya Angelou, Patrice Rushen, and many others. Though many of the individuals Banfield lauds are well-known to most readers, he also turns his attention to musicians and artists whose work, while perhaps unheralded by the world at large, are no less deserving of praise and respect for their contributions to the culture. In addition, this volume is filled with candid photographs of many of these fellow artists as they participate in expressive culture, whether on stage, on tour, in clubs, behind the scenes, in rehearsal, or even during meals and teaching class.\n\nThis unique book of essays, interviews, diary entries, and Banfield's personal photographs will be of interest to scholars and students, of course, but also to general readers interested in absorbing and appreciating the beauty of Black culture.\n","torrent":{"xt":"urn:btih:e1575ed6175ae0a615aeb996e80eb2317826754d","amp;dn":"Representing+Black+Music+Culture%3A+Then%2C+Now%2C+and+When+Again%3F+%28Af","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1575ed6175ae0a615aeb996e80eb2317826754d","infoHashBuffer":{"type":"Buffer","data":[225,87,94,214,23,90,224,166,21,174,185,150,232,14,178,49,120,38,117,77]},"announce":[],"urlList":[]}}