{"title":"Lane &amp; Gregory - Code Name Zorro - Murder of Martin Luther K","uid":7967635,"size":1798983,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e41dba51c49840211c5e1d38a67279638561d5d7&amp;dn=Lane+%26amp%3B+Gregory+-+Code+Name+Zorro+-+Murder+of+Martin+Luther+K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1356722681,"description":"This is Mark Lane's and Dick Gregory's eye-opening book Code Name &quot;Zorro&quot; - The Murder of Martin Luther King, Jr (1977) which blows the dust off of the mythology behind the assassination of Dr. Martin Luther King, Jr in Memphis on April 4, 1968. Although James Earl Ray was arrested and charged with the crime in a prearranged and rehearsed hearing conducted without cross-examination or challenge by defense, he later insisted he was a pawn in a far-reaching conspiracy. Few understand that as a result of Mark Lane's efforts, Dr. King's family came to the conclusion that it was not Ray that killed one of the most prominent American leaders of the 20th century. Rather, they understand it to be the result of a conspiracy involving government agents and other clandestine groups. The Code Name Zorro title refers to the super-covert program that J. Edgar Hoover initiated to use to tarnish MLK's image and influence. This amazing book will supply you - perhaps the only jury that will ever consider the evidence - with the same explosive information that prompted Congressional leaders to form a special committee to undertake the controversial and infinitely painful task of reopening an investigation not only of the King murder but also of the Kennedy assassination. It painstakingly details how the State's case against Ray was feeble, and would have been blown apart in court had Ray not been squeezed into entering a plea of guilty. The killing of Dr. King is the kind of event that future generations and historians will look at and wonder in awe at the gullibility of the people and the effectiveness of the &quot;memory hole.&quot; 320 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:e41dba51c49840211c5e1d38a67279638561d5d7","amp;dn":"Lane+%26amp%3B+Gregory+-+Code+Name+Zorro+-+Murder+of+Martin+Luther+K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e41dba51c49840211c5e1d38a67279638561d5d7","infoHashBuffer":{"type":"Buffer","data":[228,29,186,81,196,152,64,33,28,94,29,56,166,114,121,99,133,97,213,215]},"announce":[],"urlList":[]}}