{"title":"Parenthood.2010.S04E15.HDTV.x264-LOL","uid":8054112,"size":286994185,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4f21d648eef79256e9f187c7668b2656ead967b&amp;dn=Parenthood.2010.S04E15.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Thhaque","files":1,"time":1358918955,"description":"Parenthood\n\nGenre: Comedy, Drama, Family\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Jason Katims\nCast: Maura Tierney, Mae Whitman, Dax Shepard, Erika Christensen, Peter Krause, Craig T. Nelson, Sam Jaeger, Sarah Ramos, Max Burkholder, Savannah Argenti\n\nIMDB: http://www.imdb.com/title/tt1416765/\n\n.: Plot :.\nFrom writer/executive producer Jason Katims (Friday Night Lights) -- this contemporary re-imagining of the blockbuster film depicts the colorful and imperfect Braverman family -- four grown siblings sharing the headaches, heartaches and joy of being parents. The star-studded cast includes Peter Krause, Maura Tierney, Craig T. Nelson, Dax Shepard, Bonnie Bedelia, Monica Potter, Erika Christensen and Sarah Ramos. When Sarah Braverman, a financially strapped single mother, returns home to her parents and siblings in Berkeley, Calif. after packing up her Fresno apartment and uprooting her two inconvenienced kids, Amber (Mae Whitman) and Drew (Miles Heizer), she is greeted by her opinionated father, Zeek (Nelson), and strong mother, Camille (Bedelia) who are privately dealing with their own marital issues. As Sarah is reunited with her siblings -- sister, Julia (Christensen), and brothers Crosby (Shepard) and Adam (Krause) -- all struggling with issues of their own, it's clear that the Braverman reunion is just what they need to face the everyday challenges of modern family life.\n","torrent":{"xt":"urn:btih:e4f21d648eef79256e9f187c7668b2656ead967b","amp;dn":"Parenthood.2010.S04E15.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f21d648eef79256e9f187c7668b2656ead967b","infoHashBuffer":{"type":"Buffer","data":[228,242,29,100,142,239,121,37,110,159,24,124,118,104,178,101,110,173,150,123]},"announce":[],"urlList":[]}}