{"title":"Coast to Coast AM January 08 2013","uid":8000645,"size":57199828,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e67d23bb82316067e5dddcea6fecbbe1ff1709a4&amp;dn=Coast+to+Coast+AM+January+08+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"runcdfirst","files":5,"time":1357747371,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-08-13\nHost: \tJohn B. Wells\nGuests: \tCobra -, Robert Potter, Katherine Albrecht\n\nFilling in for George, John B. Wells welcomed the man code-named Cobra, who for 35 years has been in contact with an underground movement, resisting the dark forces attempting to control humanity. UFO contactee Rob Potter also joined the discussion about the nature of the dark forces, the havoc they have wreaked on Earth, and how the resistance movement is on the brink of a major breakthrough. Potter spoke about a recent trip to Egypt that he and Cobra led, and how they conducted meditations and &quot;activations&quot; at sites such as the Sphinx, and captured some unusual photographs of orbs, and other objects. They lit the Queen's Chamber at the Great Pyramid with a rose quartz crystal and Cobra started speaking in Pleiadian, he reported.\n\nJoining the show for about an hour, Cobra chose to speak with his voice masked by electronic modulation due to safety concerns. He described his contacts with an advanced underground civilization, the &quot;Agartha Network,&quot; who are connected with the Pleiadians and other ET races. This network is helping to stabilize the situation on Earth, and has prevented WWIII and nuclear attacks from occurring, he explained. Cobra, who also claims to be in communication with beings from Planet X that are assisting in the resistance movement, said we are nearing the time when a galactic prophecy will unfold-- &quot;a galactic network of light will be completed, and darkness will be no more.&quot;\n\nPotter filled in details on the identity of some of the dark forces. There are free floating Reptilian forms in the astral plane that have the ability to attach themselves to human auras and create negative, emotional conflicts, he said, as well as 'Archons,' beings mostly from the Orion system that have incarnated as humans and infiltrated positions of power. Potter and Cobra believe that Pleiadian technologies developed by the late Fred Bell, such as pyramid crystals and lasers can help the heal the planet.\nRFID School Ruling\n\nFirst hour guest, privacy advocate Katherine Albrecht reported that a court decision had been announced in the San Antonio school chipping case. High school student Andrea Hernandez lost her bid challenging her suspension, which she received for refusing to wear an RFID card around her neck. She'd claimed that the RFID card was the &quot;Mark of the Beast&quot; and objected to wearing it on religious grounds. Albrecht commented that the RFID technology, which is used to track students' whereabouts at all times, creates a police state mentality, and won't eliminate the threat of gun violence when it comes from students themselves. She also suggested that wearing an RFID lanyard, which contains an active electronic transmitter, is a health risk, particularly to developing children and teens.\nWebsite(s):\n\n   \n    thepromiserevealed.com\n    tachyonis.org\n   \n    katherinealbrecht.com\n    spychips.com\n\nBook(s):\n\n    Spychips\n\n","torrent":{"xt":"urn:btih:e67d23bb82316067e5dddcea6fecbbe1ff1709a4","amp;dn":"Coast+to+Coast+AM+January+08+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67d23bb82316067e5dddcea6fecbbe1ff1709a4","infoHashBuffer":{"type":"Buffer","data":[230,125,35,187,130,49,96,103,229,221,220,234,111,236,187,225,255,23,9,164]},"announce":[],"urlList":[]}}