{"title":"Hometown News - Wheels [2002] [FLAC]","uid":8093602,"size":227689070,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e71912ab04fd493e5772b14d363681aee99de101&amp;dn=Hometown+News+-+Wheels+%5B2002%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":15,"time":1359778083,"description":"1. Revitalize\n2. Wheels\n3. Minivan\n4. First, Second Chance\n5. Look My Way\n6. No Big Deal\n7. All The Time\n8. Stuck In The Middle With You\n9. Can't Let Go\n10. She's Not You\n11. Run To You\n\n\nReviewed by Matt Bjorke\n\nSigned to the independent upstart label VFR Records, (also home to Mark McGuinn), Hometown News is a duo that mixes the sound of Foster &amp; Lloyd with the classic sound of Simon &amp; Garfunkel. Consisting of Scott Whitehead and Ron Kingery, Hometown News began in 1996 after the duo met at a writer's night in a Nashville club.\n\nInstantly recognizing that their vocals sounded well together, the duo decided to record some songs they wrote and see how they sounded. They decided they would record a whole CD's worth of songs and showcase it at their shows.\n\nSpurning offers from other labels for creative freedom at VFR Records, Ron and Scott quickly went into the studio and recorded their album. Entitled &quot;Wheels,&quot; the CD is full of dual harmonies. There is no specific lead vocalist to Hometown News. Like Little Big Town, the duo swaps off singing leads.\n\n&quot;Revitalize&quot; is rich with mandolin and acoustic guitar that's about living for the weekend. The theme of the song deals with working w/o much down time. The duo describes the song as being &quot;about kicking back and relaxing and recharging your batteries.&quot;\n\n&quot;Wheels,&quot; with its distinctive sound wrapped up in mandolin and steel guitar, is about life's passages and how much time we have in life. Highly poetic and very philosophical, this track should be a hit with radio.\n\nAs their first single, &quot;Minivan&quot; serves up another philosophical slice of life. This time, it's about growing up and becoming a responsible parent, by selling the Toy (a car or truck) for a Minivan. Using spoken verses, the chorus really showcases the duo's vocals. The song is, as I write this, a Top 40 hit.\n\n&quot;Stuck In The Middle With You&quot; is a cover of the Stealers Wheel/Gerry Rafferty classic. A faithful cover, this track was also recently covered by Pat Green and Cory Morrow on their Songs We Wish We'd Written CD. A fun song to listen to, the song is about being in one place with someone for too long of a time.\n\nAs one of the few ballads on the CD, &quot;She's Not You&quot; is about a guy realizing that he's in a perfect relationship yet he feels alone because he's not with his first love. I love ballads like this for all their simple piano based structure. In a perfect world, this song would make it on the radio.\n\nDescribed as a song written from Bruce Springsteen's point of view, &quot;Run To You&quot; is one of those tracks that has hit written all over it. It also seems to be the most &quot;radio friendly&quot; track on it. The theme is about getting more than one second chance.","torrent":{"xt":"urn:btih:e71912ab04fd493e5772b14d363681aee99de101","amp;dn":"Hometown+News+-+Wheels+%5B2002%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e71912ab04fd493e5772b14d363681aee99de101","infoHashBuffer":{"type":"Buffer","data":[231,25,18,171,4,253,73,62,87,114,177,77,54,54,129,174,233,157,225,1]},"announce":[],"urlList":[]}}