{"title":"[FemaleAgent / Casting XXX] Jenny (01.15.2013)","uid":8022476,"size":1007685588,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ebd29baa4245f374f46a11648a3fcbf135a09321&amp;dn=%5BFemaleAgent+%2F+Casting+XXX%5D+Jenny+%2801.15.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1358237208,"description":"[FemaleAgent / Casting XXX] Jenny (01.15.2013)\n\nJenny (45 mins). Jenny is a sweet girl, shy at first but who really came into her own by the end of the casting. HAD she sent me some Pictures Via Email and I Decided to check out What she's Like. When she first arrived she told me she was a hairdresser and then she told me a really sad tale. She wanted to try porn as her boyfriend HAD recently ended the Relationship Saying He did not Love her anymore. Whilst I felt for the Girl this was not exactly Setting My panties on Fire SO a Quick Change of subject was in order. I steered her back on Course and to My surprise she Agreed to do a Double casting with both Jim and Myself. I gave her a dildo and told her to play with herself before we got down to it. As I Watched the Glide Dildo in and out of her tight Hole I Decided I was going to let Jim Fuck her but not before she fucked me. I got her to lay back and then I straddled her face and let her go at my pussy. I was very impressed with the Tongue Talent on this Girl and she soon HAD My Heart and My pulse racing as Pounding My Orgasm Grew. I Think I Almost Smothered her at the end as the Orgasm took me in IT's furious grip and Shook me All over. Then, HIS timing Always Seems to be just as I finish, there was a Knock on the door and in Walked Jim. He wasted no time and he was soon bruising her lungs as she took him deep into her mouth. Then He took her in the doggy Position and fucked her hard and fast. I do not Think she's Ever Been Like That fucked before, she Almost Passed out as her Orgasm hit and the Cries of Pleasure got me aroused All over again. A Great casting with a very lovely Girl, Who took away More then she arrived in Experience with and hopefully will not Miss her boyfriend too much anymore.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=861bkzs6tgr8in7ewndh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=861bkzs6tgr8in7ewndh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=naz1ycmlixt4qjndwsd5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=naz1ycmlixt4qjndwsd5.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ebd29baa4245f374f46a11648a3fcbf135a09321","amp;dn":"%5BFemaleAgent+%2F+Casting+XXX%5D+Jenny+%2801.15.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd29baa4245f374f46a11648a3fcbf135a09321","infoHashBuffer":{"type":"Buffer","data":[235,210,155,170,66,69,243,116,244,106,17,100,138,63,203,241,53,160,147,33]},"announce":[],"urlList":[]}}