{"title":"Chrome (v1.2.0.0 Latest Version) (Direct Play) (FPS Similar to H","uid":8036948,"size":1016477469,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ebd9896e8f4bd86b3cbed805461e62330a7a1a93&amp;dn=Chrome+%28v1.2.0.0+Latest+Version%29+%28Direct+Play%29+%28FPS+Similar+to+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuCtUpPuNk","files":6,"time":1358537541,"description":"Extract using 7-zip or winrar. (www.7-zip.org)\nrun &quot;Chrome.exe&quot;\nselect single or multiplayer.\nplay\n\nNOTE: this can be played via lan...not online\n\nNOTE 2: this is patched to the latest version 1.2.0.0 but in sp you'll see version 1.1.3.0 because 1.2.0.0 only\nfixes multi player bugs. so sp wasnt touched.\n-------------\n-------------\n-------------\n\nThe game takes place in the distant future and the player assumes the role of bounty hunter Bolt Logan. On the first assignment in the game he is betrayed by his partner and gets ambushed. He survives and while trying to escape the complex he meets a woman named Carrie. He does not know her motivations but as they are both trying to escape the guards they decide to work together. After successfully leaving the planet she becomes his new partner who will support him via radio on all future assignments. As the game progresses the two discover a great conspiracy involving the discovery of the most valuable resource known to mankind: &quot;chrome&quot;. They make contact with several factions and on the final mission it is up to the player to decide which faction Logan will stick with.\n\nGAMEPLAY:\nAs Chrome is a first-person shooter most of the gameplay involves traversing 3D environments by foot and fighting human enemies with an array of ranged weapons. Occasionally the player has to solve simple puzzles and find keys that allow to enter new areas. What made Chrome stand out upon its release was that a large part of the game's action takes place in vast open areas, providing some tactical freedom to the player. The player is also able to utilize six different kinds of vehicles that allow for fast movement and provide protection as well as heavy weaponry in some cases. Another feature that wasn't common at the time was the ability to slightly zoom in with every kind of weapon.\nDespite being a rather classical linear FPS game the developers included several features atypical for this kind of game, some of which were inspired by System Shock 2 and Deus Ex that utilize more RPG mechanics. There is a wide array of items that the player can pick up, this not only includes weapons, ammo and health packs but also food or even CD players which have no practical purpose (but can be used to play short music loops). Inventory space is limited and the items are being managed on an inventory screen similar to those seen in System Shock 2 and Deus Ex. The player sometimes has to rearrange items and has to decide which weapons to take with him. Before all missions, aside from the first one, the player has the ability to customize his weapons loadout.\nAnother feature inspired by Deus Ex is the ability to use implants. Over the course of the campaign Logan automatically receives implants which give him superhuman powers such as increased accuracy, movement speed, jump height, zoom level or even reaction time which is simulated by introducing slow motion (generally known as Bullet Time among gamers). The use of these implants, however, causes a physical strain that may hurt Logan if they aren't deactivated in time. This strain is symbolized by an additional energy bar which automatically refills over time but can also be replenished by using special items. All implants can be managed separately but it is also possible to create four groups of implants that will be activated or deactivated at once. For example the player is able to create one group consisting of increased accuracy and a higher zoom level which could be utilized for long-distance combat and another one consisting of slow motion and increased movement speed for close combat. At first the efficiency of the implants is rather low and the strain very high but over the course of the campaign Logan gets used to them which results in him being able to use them for longer and gain higher bonuses.\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSonic Robo Blast 2 (v2.0.6) (SRB2) (Sonic the Hedgehog)\nSerious Sam: The First and Second Encounter\nNexuiz\nall doom, heretic sotsr, hexen + ddc, n similar stuff (52 games)    NOTE: This Requires a mod to play online (skulltag), it's free, google it\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:ebd9896e8f4bd86b3cbed805461e62330a7a1a93","amp;dn":"Chrome+%28v1.2.0.0+Latest+Version%29+%28Direct+Play%29+%28FPS+Similar+to+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd9896e8f4bd86b3cbed805461e62330a7a1a93","infoHashBuffer":{"type":"Buffer","data":[235,217,137,110,143,75,216,107,60,190,216,5,70,30,98,51,10,122,26,147]},"announce":[],"urlList":[]}}