{"title":"Bottoms Up ","uid":8019674,"size":1453931829,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ebe6d3463bb559779f5a9105714e320139ccf605&amp;dn=Bottoms+Up+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":-1,"time":1358175252,"description":"Genre: Anal, Gonzo, Hardcore, All Sex\nDuration: 2:13:52\nEnglish\n\nStudio: Harmony\n\nCast: Omar, Franki, Tiffany Kingston, Danny D., Cathy Heaven, Angell Summers, Rebecca More\n\nDescription: Lady in red Cathy Heaven stumbles upon a muscular stud at his place of work. He wastes no time taking her into his workshop, probing his finger into her sweet ripe ass. Cathy then sucks him off taking every inch of his cock deep down into her throat before it's time for some real hard cock action.Jail Bird Danny D. is locked up and frustrated. He flicks through a fetish porn magazine while playing with his impressive cock. Prison Officer Angell Summers arrives and demands he eats her pussy and ass out clean. Angell then chains him up and sucks on his mammoth cock before straddling him stretching her arse wide.Naughty girl Tiffany Kingston sure knows how to tease tied up Omar. Dressed to thrill in sexy stocking and suspenders, she parades her body then slowly rocks away on the dildo chair. Omar soon gets a shot at her juicy pussy before shooting his load over her satisfied face.Slender Franki serves up more than a refreshment as Omar takes a breather from football training. Franki takes his hard long cock and gives him an intensive blow-job. They're joined by another stud, so Franki takes one cock into her mouth while riding Omar's massive cock hard and fast.Sexy Rebecca More is totally lost in the fucking chair as her stud watches with delight. He licks her out before stuffing her perfect pink pussy and ass to the max.\n\nVideo quality: DVDRip\nVideo format: MP4\nVideo codec: H.264/AVC\nAudio codec: AAC\nVideo: MPEG4 Video (H264) 704x396 29.97fps [Video]\nAudio: AAC 48000Hz stereo 1536kbps [Audio]\n &lt;a href=&quot;\nhttp://imgload.me/img-50f40de88805f.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgload.me/img-50f40de88805f.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:ebe6d3463bb559779f5a9105714e320139ccf605","amp;dn":"Bottoms+Up+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebe6d3463bb559779f5a9105714e320139ccf605","infoHashBuffer":{"type":"Buffer","data":[235,230,211,70,59,181,89,119,159,90,145,5,113,78,50,1,57,204,246,5]},"announce":[],"urlList":[]}}