{"title":"[Movie] Guys Don't Cry (ChÅ‚opaki Nie PÅ‚aczÄ…)","uid":8095467,"size":1566749573,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ee13c3eae0372f49afd5e006a7436e774ef42506&amp;dn=%5BMovie%5D+Guys+Don%27t+Cry+%28Ch%C5%82opaki+Nie+P%C5%82acz%C4%85%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"niepodam","files":-1,"time":1359826055,"description":"!!!!!!!!!!!!!!!!!!\nPlease moderators change category of this torrent on Video -&gt; Movies (in this cat I can't upload torrent with subtitles).\n!!!!!!!!!!!!!!!!!!\n\n\nLanguage: Polish, with English subtitles\nDirector: Olaf Lubaszenko\nRun Time: 100 min.\n\nTeenagers in modern Warsaw: Kuba Brenner wants to become a violinist. Kuba wants to help his very shy friend, Oskar, to meet some girls. Through a series of complicated (and very humorous) accidents, Kuba finds himself in the middle of a meeting of the local Polish Mafia. \nEvents go from bad to worse for Kuba when some men attempt to rob the gangsters: shots are fired, and two of the bandits, Grucha and Bolec, are wounded. \n\n\nI have to say that this must be the greatest polish 'action-comedy' of recent years. After such movies as Kiler and Kilerow Dwoch which started the trend for this type of movie in Poland (and were very good themselves), Chlopaki nie placza (Boy's dont cry) gives audiences even more to laugh about this time around. The plot is as follows: Two college students (one who has major problems when it comes to women), decide to higher prostitutes and have a good time. Everything goes smoothly until they realize that they dont have enough money to pay for the ladies' services. This is where the problems start. They soon get mixed up with some dangerous mafia and from then on the comedy goes into overdrive. A great comedy overall with great Polish actors in comical roles. Cezary Pazura, 'Jurek Kiler' of the two Kiler movies, is once again present but this time as a mean (but always hilarious) member of the polish mob.","torrent":{"xt":"urn:btih:ee13c3eae0372f49afd5e006a7436e774ef42506","amp;dn":"%5BMovie%5D+Guys+Don%27t+Cry+%28Ch%C5%82opaki+Nie+P%C5%82acz%C4%85%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee13c3eae0372f49afd5e006a7436e774ef42506","infoHashBuffer":{"type":"Buffer","data":[238,19,195,234,224,55,47,73,175,213,224,6,167,67,110,119,78,244,37,6]},"announce":[],"urlList":[]}}