{"title":"Nirvana - A Big Mix of Besides - Collected 2013","uid":8059871,"size":221998558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f034e901a33176a09c134f6723f2ed1868f567db&amp;dn=Nirvana+-+A+Big+Mix+of+Besides+-+Collected+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZombieSwitch","files":-1,"time":1359045192,"description":"A collection of most of Nirvana's known best quality &quot;vault&quot; material, presented as an album for the first time. There are no filler tracks featuring multiple demo versions of songs you already know and love....only one track in this compilation appeared on any release of Nirvana's first four records (Endless, Nameless was not part of the original album and the version here is different - better IMHO). A Big Mix of Besides will burn nicely onto two CDs by putting tracks 1-22 on disc one and 23-44 on disc two. Enjoy!\n\nNOTE: These tracks are taken from a pile of box set and bootleg material collected over the last decade. The track titles are as accurate as I can believe, since this band's unofficial songs were often mislabeled. The quality is the best out there for these tracks as far as I can tell. I just figured it was about time fans could find all of Nirvana's non-album songs in one collection, presented as a double CD. The cover art the files have been tagged with is an actual Kurt Cobain original painting. Please seed and spread the word - help get these songs to ALL of Nirvana's fans! ","torrent":{"xt":"urn:btih:f034e901a33176a09c134f6723f2ed1868f567db","amp;dn":"Nirvana+-+A+Big+Mix+of+Besides+-+Collected+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f034e901a33176a09c134f6723f2ed1868f567db","infoHashBuffer":{"type":"Buffer","data":[240,52,233,1,163,49,118,160,156,19,79,103,35,242,237,24,104,245,103,219]},"announce":[],"urlList":[]}}