{"title":"Near Earth Objects - Donald Yeomans","uid":7996421,"size":188190514,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f068c63fe0ca11b2788ff774bcb59c0272759089&amp;dn=Near+Earth+Objects+-+Donald+Yeomans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SciBooks","files":11,"time":1357631691,"description":" &lt;a href=&quot;http://www.amazon.com/Near-Earth-Objects-Finding-Them-Before/dp/0691149291&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.com/Near-Earth-Objects-Finding-Them-Before/dp/0691149291&lt;/a&gt;\n\nOf all the natural disasters that could befall us, only an Earth impact by a large comet or asteroid has the potential to end civilization in a single blow. Yet these near-Earth objects also offer tantalizing clues to our solar system's origins, and someday could even serve as stepping-stones for space exploration. In this book, Donald Yeomans introduces readers to the science of near-Earth objects--its history, applications, and ongoing quest to find near-Earth objects before they find us.\n\nIn its course around the sun, the Earth passes through a veritable shooting gallery of millions of nearby comets and asteroids. One such asteroid is thought to have plunged into our planet sixty-five million years ago, triggering a global catastrophe that killed off the dinosaurs. Yeomans provides an up-to-date and accessible guide for understanding the threats posed by near-Earth objects, and also explains how early collisions with them delivered the ingredients that made life on Earth possible. He shows how later impacts spurred evolution, allowing only the most adaptable species to thrive--in fact, we humans may owe our very existence to objects that struck our planet.\n\nYeomans takes readers behind the scenes of today's efforts to find, track, and study near-Earth objects. He shows how the same comets and asteroids most likely to collide with us could also be mined for precious natural resources like water and oxygen, and used as watering holes and fueling stations for expeditions to Mars and the outermost reaches of our solar system.","torrent":{"xt":"urn:btih:f068c63fe0ca11b2788ff774bcb59c0272759089","amp;dn":"Near+Earth+Objects+-+Donald+Yeomans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f068c63fe0ca11b2788ff774bcb59c0272759089","infoHashBuffer":{"type":"Buffer","data":[240,104,198,63,224,202,17,178,120,143,247,116,188,181,156,2,114,117,144,137]},"announce":[],"urlList":[]}}