{"title":"Sri Venkateshwara Mahatyam (1960) Telugu_MHCe DVD5_No Subs [DDR]","uid":8312420,"size":4719442712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0ad035dacda90ce6153349babf1eb3d7cb1b45e&amp;dn=Sri+Venkateshwara+Mahatyam+%281960%29+Telugu_MHCe+DVD5_No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1364505932,"description":"Sri Venkateshwara Mahatyam (1960) Telugu_MHCe DVD5_No Subs [DDR]\n\nTRIVIA Notes\n- Sri Venkateswara Mahatmyam titled as Balaji was first made in 1936 by P. Pullaiah under the Famous Films banner. \n- It was C. S. R. Anjaneyulu acted as Balaji and Santha Kumari as Padmavathi in the lead roles. \n- The movie was said to be among the successes of the early days of Pullaiah and Shanthakumari's married life.\n\nCAST:- \nNandamuri Taraka Rama Rao, Savitri, S Vara Lakshmi, Gummadi Venkateswara Rao, Chittoor Nagaiah, Shantakumari, Relangi Venkatramaiah, \nGhantasala Venkateswara Rao....Guest role in the song Sesha Saila Vaasa\n\nProducers: P. Santha Kumari, P. Pullaiah and V. Venkateswarlu\nDirected by P Pullaiah\nMusic by Pendyala Nageswara Rao\nLyrics by Acharya Athreya, Malladi Ramakrishna Sastry, Arudra, Narasa Reddy\nPlayback Singers- S. Vara Lakshmi, S. Janaki, Jikki Krishnaveni, Pithapuram Nageswara Rao, P. Leela, Ghantasala Venkateswara Rao, Madhavapeddi Satyam, P. Susheela, Swarnalatha, Vaidehi\n\nSongs are included in MP3s\n\nMOVIE REVIEW:- Sri Venkateshwara Mahatyam (1960) Telugu\nThe art of making a film that remains evergreen is certainly no easy task. It requires high artistic talents, and great vision on the part of the director as well as the producer. Only a combination of imaginative and intellectual brains can create history in any field. Here we are discussing a memorable film that even after several decades stands as testimony to the high standards of Indian cinema of the olden days. 'Venkateswara Mahathyam' is an example of the high entertainment standards of the days gone by.\n\nIt was first made in 1936 by P Pullaiah under the Famous Films banner with greats like CSR Anjaneyulu and Shanthakumari in the lead roles. It turned out to be a grand success and set the trend of grand stellar combinations. Shanthakumari who played Padmavathi in the film at once became the heartthrob of that generation with thousands of admirers eager to see her again and again. The movie was said to be among the successes of the early days of Pullaiah and Shanthakumari's married life.\n\nGenerally, no producer dare make the same film a second time, though the first version of it has been a sensational hit and earned director the good will of the spectators. But P Pullaiah in his movie career of 50 years created history by remaking the 1936 film in 1960, this time under the Padmasri Pictures banner, with a change in the lead pair. While the matinee idol NT Rama Rao appeared as Srinivasa, the talented and glamorous Savithri attracted thousands of admirers as Padmavathi. Shanthakumari this time took on the role of Vakulamala. Gummadi as Bhrigu and S Varalakshmi as Sri Lakshmi performed impressively. This galaxy of talented artistes really created waves in the history of the Telugu cinema. A good number sincerely believe that this film evoked a great sense of devotion among the filmgoers!\n\nTwo literary stalwarts Duvvuri Ramireddy and Athreya wrote the dialogues for the first and the second production respectively of the movie. Though times had changed Athreya wrote the dialogues to suit the changed tastes of the new generation. In fact Athreya played three roles in shaping the movie - as a dialogue writer, as an actor in the role of Akasaraja and as the speaker of the epilogue of the movie.\n\nThe story of the film runs like this: Evil dominates the world. The wicked prosper, as the good are made to suffer as a result of the vicious impact of the spirit of the times, the Kaliyuga, presided over by Kalki. To rid the world of wickedness, great rishis hold yagas under the guidance of sage Kshyapa. However, none could be found to eliminate evil and establish virtue. Sage Bhrigu went to Lord Maha Vishnu, enjoying the blissful company of his spouse Sri Lakshmi, did not notice the sage's arrival. Furious, the sage kicked the Lord on the chest. Vishnu without being offended at all pacified the sage and made him realize how anger makes people lose their sense. Sri Lakshmi, however, could not bear all this. In great anger, She left Vaikuntam for the earth below. In search of her, Sri Vishnu too came down to the earth. He took shelter as Srinivasa in the ashram of Vakulamatha. Later, however, Srinivasa met Padmavathi and married her, as everybody knows.\n\nThere is an interesting story behind the last scene of the film. After collecting the story material Director-producer Pulliah asked Ramireddi to write the dialogue for the sequence in the last scene in which both Sri Lakshmi and Padmavathi contend for the right to be the spouse of Srinivasa in his presence. Srinivasa, vexed with this quarrel turns into stone. This is not found in any of the source material. It was Pullaiah's invention. Without being aware of it, Ramireddi went ahead with the dialogues according to the wishes of his producer. The dialogues were indeed very effective. Later, however, Ramireddi was astonished when he was told that the scene and the episode were Pullaiah's creation!\n\nThe film established Pullaiah as a producer, and the cast Shanthakumari, CSR, NTR, Savithri, Gummadi, Duvvuri, Athreya as artistes of great promise. The film was a spring board especially for NTR. It is his performance in this movie that turned him into the most beloved actor of the Telugu screen and stamped him as 'the screen god'. Admirers thronged in thousands every where behind NTR. Another great man behind this grand success was Pendyala Nageswara Rao, the music director of the film. The song 'Seshasaialavasa..' is heard and sung almost every day in Telugu homes till today. All credit to Pendyala for the tune, and all praise to the immortal voice of Ghantasala for rendering it so evocatively. So in all senses this film is Pullaiah's EVERGREEN MAGNUM OPUS!\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Telugu\nRunTime: 2:59:36\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 2:59:36\n\n","torrent":{"xt":"urn:btih:f0ad035dacda90ce6153349babf1eb3d7cb1b45e","amp;dn":"Sri+Venkateshwara+Mahatyam+%281960%29+Telugu_MHCe+DVD5_No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0ad035dacda90ce6153349babf1eb3d7cb1b45e","infoHashBuffer":{"type":"Buffer","data":[240,173,3,93,172,218,144,206,97,83,52,155,171,241,235,61,124,177,180,94]},"announce":[],"urlList":[]}}