{"title":"USPEX 9.2.7 (Universal Structure Prediction: Evolutionary Xtallo","uid":8003374,"size":60991119,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:f1b320b8d6768b3b131331c2cf4c1332d0b00c25&amp;dn=USPEX+9.2.7+%28Universal+Structure+Prediction%3A+Evolutionary+Xtallo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TCDDWarez","files":2,"time":1357827405,"description":"USPEX (Universal Structure Prediction: Evolutionary Xtallography) is a method developed jointly by Artem R. Oganov, Colin W. Glass, Andriy O. Lyakhov and Qiang Zhu, and implemented in the same-name code written by Andriy Lyakhov and Colin W. Glass and Qiang Zhu. USPEX can be used to predict stable crystal structures at given P-T conditions, knowing only the chemical composition (or to predict both the stable compositions and structures, given the element types). Many previous attempts to solve crystal structure problem were plagued by low success rate and extreme computational costs that prevented full ab initio studies. USPEX avoids both of these problems. In fact, &quot;uspekh&quot; means &quot;success&quot; in Russian - which highlights a nearly 100% success rate that we find for our method.\n\nUSPEX can also be used for finding low-energy metastable phases, as well as stable structures of nanoparticles, surface reconstructions, molecular packings in organic crystals, and for searching for materials with desired physical (mechanical, electronic) properties. The USPEX code is based on an efficient evolutionary algorithm developed by A.R. Oganov's group, but also has options for using alternative methods (random sampling, metadynamics, corrected PSO algorithms). USPEX is interfaced with many DFT or classical codes, such as VASP, SIESTA, GULP, Quantum Espresso, CP2K, and so on.\n\nNote that Matlab or Octave is required to run USPEX. Under normal circumstances, this software would only be freely available to &quot;academic researchers&quot; from a university only. You're required to register with a university email, in fact, in order to download it from their site. However, I was able to login to their website with a simple SQL injection: &quot; anything' or 'x'='x &quot; on both the email and password fields. So I'm providing the software here so that those who are knowledgeable enough to use the software, and yet do not go to a university, are able attain it. You're welcome.","torrent":{"xt":"urn:btih:f1b320b8d6768b3b131331c2cf4c1332d0b00c25","amp;dn":"USPEX+9.2.7+%28Universal+Structure+Prediction%3A+Evolutionary+Xtallo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b320b8d6768b3b131331c2cf4c1332d0b00c25","infoHashBuffer":{"type":"Buffer","data":[241,179,32,184,214,118,139,59,19,19,49,194,207,76,19,50,208,176,12,37]},"announce":[],"urlList":[]}}