{"title":"[PC] Unimate Spider Man Direct Play- FzeNix","uid":8082614,"size":904804670,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f1d58364192780d78030ede2247c7113acc6e37c&amp;dn=%5BPC%5D+Unimate+Spider+Man+Direct+Play-+FzeNix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FzeNix","files":-1,"time":1359530225,"description":"ULTIMATE SPIDER-MAN is Activision's third SPIDER-MAN game and the first to be based off the comics rather than the newThe PC game puts players in control of the web-slinging Spider-Man as he does battle with Venom and other enemies while getting help from some familiar superheroes. The story of Spider-Man begins when 15 year old Peter Parker is bitten by a radioactive spider. He soon realizes he has the ability to climb walls and to sense things. Shortly after being bitten, Peter and friend Eddie Brock discover a mysterious black suit that their fathers created before their deaths. Eddie ends up putting on the suit, which turns him into the powerful villain known as Venom. Peter must battle his childhood friend and other villains like the Green Goblin, Carnage, and Electro to save the city. In story mode, players can walk around New York City as much as they wish as they accomplish side-missions or move the plot along. Instead of walking, though, Spider-Man can shoot webs onto tall buildings and swing his way around the city while capturing gang members and stopping crimes. He also must stop Venom's plot and defeat the other villains. Players will also enjoy seeing Spider-Man joined by allies like Wolverine and the Human Torch for some scenes. Fans of the comics will enjoy how ULTIMATE SPIDER-MAN draws on the comic style and storyline, while movie fans will like getting to see another chapter in the Spider-Man legacy","torrent":{"xt":"urn:btih:f1d58364192780d78030ede2247c7113acc6e37c","amp;dn":"%5BPC%5D+Unimate+Spider+Man+Direct+Play-+FzeNix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1d58364192780d78030ede2247c7113acc6e37c","infoHashBuffer":{"type":"Buffer","data":[241,213,131,100,25,39,128,215,128,48,237,226,36,124,113,19,172,198,227,124]},"announce":[],"urlList":[]}}