{"title":"Fortunes of War by Olivia Manning - BBC Radio Adaptation","uid":8165652,"size":325559351,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f33c0f48b585016833245446d438847f9d8a263d&amp;dn=Fortunes+of+War+by+Olivia+Manning+-+BBC+Radio+Adaptation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pigman58","files":6,"time":1361328524,"description":"This is a 6 part adaptation of Olivia Manning's Balkan Trilogy of novels, each of 1 hour.\n\nThe novels describe the experiences of a young married couple, Harriet and Guy Pringle, early in World War II. A lecturer and passionate Communist, Guy is attached to a British Council educational establishment in Bucharest (Romania) when war breaks out, and the couple are forced to leave the country, passing through Athens and Palestine and ending up in Cairo, Egypt. Harriet is persuaded to return home by ship, but changes her mind at the last minute and goes to Damascus with friends. Guy, hearing that the ship has been torpedoed, believes her to be dead, but they are reunited in the end.\n\nThe cycle also chronicles the pre-war and wartime experiences of the surrounding group of English expatriates who also find themselves on the move, and the changes in Romanian society as the corrupt regime of King Carol II tries unsuccessfully to keep Romania out of the war.","torrent":{"xt":"urn:btih:f33c0f48b585016833245446d438847f9d8a263d","amp;dn":"Fortunes+of+War+by+Olivia+Manning+-+BBC+Radio+Adaptation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f33c0f48b585016833245446d438847f9d8a263d","infoHashBuffer":{"type":"Buffer","data":[243,60,15,72,181,133,1,104,51,36,84,70,212,56,132,127,157,138,38,61]},"announce":[],"urlList":[]}}