{"title":"POtHS - Conspiracy - 018 - AMA and Big Pharma - What Is Wrong Wi","uid":8040436,"size":8295015128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f40baec902521b608ec48957bf7da50d1a1dc4b8&amp;dn=POtHS+-+Conspiracy+-+018+-+AMA+and+Big+Pharma+-+What+Is+Wrong+Wi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1358616683,"description":"\n PO t HS\n\nPouring Out the Holy Spirit\n\n&quot;C  O  N  S  P  I  R  A  C  Y&quot;\n\nVolume 018\nAMA and Big Pharma - What Is Wrong With You\n\n\n\nPOtHS - Conspiracy - 018 - AMA and Big Pharma - What Is Wrong With You\n\n\nDescription:\n\nRoyal R. Rife - The True Forgotten Story to End All Disease:\nImagine, for a moment, that you have spent more than two decades in painfully laborious research-- that you have discovered an incredibly simple, electronic approach to curing literally every disease on the planet caused by viruses and bacteria . Indeed, it is a discovery that would end the pain and suffering of countless millions and change life on Earth forever. Certainly, the medical world would rush to embrace you with every imaginable accolade and financial reward imaginable. You would think so, wouldn?t you?\n\nUnfortunately, arguably the greatest medical genius in all recorded history suffered a fate literally the opposite of the foregoing logical scenario. In fact, the history of medicine is replete with stories of genius betrayed by backward thought and jealously, but most pathetically, by greed and money.\n\nIn the nineteenth century, Semmelweiss struggled mightily to convince surgeons that it was a good idea to sterilize their instruments and use sterile surgical procedures. Pasteur was ridiculed for years for his theory that germs could cause disease.\n\nScores of other medical visionaries went through hell for simply challenging the medical status quo of day, including such legends as Roentgen and his X-rays, Morton for promoting the 'absurd' idea of anaesthesia, Harvey for his theory of the circulation of blood, and many others in recent decades including: W.F. Koch, Revici, Burzynski, Naessens, Priore, Livingston-Wheeler, and Hoxsey.\n\nOrthodox big-money medicine resents and seeks to neutralize and/or destroy those who challenge its beliefs. Often, the visionary who challenges it pays a heavy price for his 'heresy.'\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:f40baec902521b608ec48957bf7da50d1a1dc4b8","amp;dn":"POtHS+-+Conspiracy+-+018+-+AMA+and+Big+Pharma+-+What+Is+Wrong+Wi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f40baec902521b608ec48957bf7da50d1a1dc4b8","infoHashBuffer":{"type":"Buffer","data":[244,11,174,201,2,82,27,96,142,196,137,87,191,125,165,13,26,29,196,184]},"announce":[],"urlList":[]}}