{"title":"Tony Joe White - Snakey [2003][EAC,log,cue. FLAC]","uid":8210094,"size":336310290,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f4200cd5e069c80811381c5707280b85d10aba42&amp;dn=Tony+Joe+White+-+Snakey+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":14,"time":1362221857,"description":"Artist: Tony Joe White\nRelease: Snakey\nDiscogs: 2559258\nReleased: 2003\nLabel: Munich Records\nCatalog#: MRCD 241\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Netherlands\nStyle: Blues, Louisiana Blues\n\nTracklisting:\n\n01. Feeling Snakey\n02. Bayou Bleus\n03. Nothing I Would Not Do\n04. All Those Tomorrows\n05. Dark Horse Coming\n06. The Organic Shuffle\n07. Living Off The Land\n08. Rico\n09. Hard Time With Sunday\n10. Taste Like Chicken\n\nCredits: Show\n\nWhy Tony Joe White isn't spoken of in the same revered tones as J.J. Cale is a mystery as well as a crime. White invented a brand of greasy, funky, deeply soulful Louisiana bayou rock that's been quoted by everyone from the Neville Brothers and the Meters to Marvin Gaye to the Red Hot Chili Peppers to ZZ Top to Funkadelic to the Cramps to the Gun Club to the White Stripes. Mark Knopfler owes his entire guitar playing approach to White. OK, enough bitching. Snakey is the most aptly titled Tony Joe record in some time. Here that shadowy guitar style, with its serpentine leads and chunky, syncopated chords, catches a groove that is echoed by Little Troll Forrest's basslines punching through the pocket just ahead of Boom Boom Cohen's drumming. The songs -- whether it be &quot;Feeling Snakey,&quot; with its screaming leads and soulfully regretful message about leaving the booze alone to uncoil the body and mind to boasting about how your woman knows how to make the crawfish boil, or the driving, fuzzed-out high-wire act that is &quot;Bayou Blues&quot; (ZZ Top got the entire Eliminator album from this sound) -- are timelessly nasty in the best rock &amp; roll sense of the word, with wickedly sly humor tossed in between lines for measure. Then there's the coolest, most ominous song ever written about hanging out in a health-food store in &quot;The Organic Shuffle,&quot; which bleeds into the overdriven swamp-box guitar funkery of &quot;Livin' off the Land.&quot; This doesn't mean that Tony Joe isn't capable of tenderness; far from it. &quot;Rico,&quot; a gorgeous, slinky, mariachi-tinged country song, is subtitled &quot;(14) Field Worker.&quot; It's an empathetic portrait of a migrant worker who accepts his situation while trying not to lose sight of his dreams, which have nothing to do with money. The balls-out funk of &quot;Tastes Like Chicken&quot; is White at his best, letting all of the country, soul, funk, blues, rock, and folk contradictions fall into one another. Lyrically the song is as hilarious as it is spooky, capping off yet another Swamp Fox masterpiece. Oh yeah, not only are there no bad Tony Joe White records, there aren't any mediocre ones, either; this man has the most remarkably consistent track in modern music, beginning in the late '60s and continuing to this day.","torrent":{"xt":"urn:btih:f4200cd5e069c80811381c5707280b85d10aba42","amp;dn":"Tony+Joe+White+-+Snakey+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4200cd5e069c80811381c5707280b85d10aba42","infoHashBuffer":{"type":"Buffer","data":[244,32,12,213,224,105,200,8,17,56,28,87,7,40,11,133,209,10,186,66]},"announce":[],"urlList":[]}}