{"title":"Alejandro Escovedo - A Man Under The Influence [2001] [FLAC]","uid":8081698,"size":340080099,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f43382dc515fddba99665eb6d6562ec1a30ffad4&amp;dn=Alejandro+Escovedo+-+A+Man+Under+The+Influence+%5B2001%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":15,"time":1359514029,"description":"Artist: Alejandro Escovedo\nRelease: A Man Under The Influence\nDiscogs: 1962871\nReleased: 2001\nLabel: Blue Rose Records\nCatalog#: BLU CD0251\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Germany\nStyle: Folk, World, &amp; Country, Rock, \n\nTracklisting:\n\n01. Wave\n02. Rosalie\n03. Rhapsody\n04. Across The River\n05. Castanets\n06. Don't Need You\n07. Follow You Down\n08. Wedding Day\n09. Velvet Guitar\n10. As I Fall\n11. About This Love\n\nallmusic: &quot;It's all about this love/It's all about this pain/It's all about the loss/We take to live again.&quot; Those lines hardly tell you everything there is to know about Alejandro Escovedo's songwriting, but he's rarely expressed his key themes with such strength and concision as he does in the first verse of &quot;About This Love,&quot; and while Escovedo's fifth studio album, A Man Under the Influence, doesn't stray far from the musical and lyrical themes that have dominated his previous work, he's rarely (if ever) put the pieces together quite as well as he does here. Escovedo's latest lineup of his orchestra -- anchored by Brian Standefer on cello, Eric Heywood on pedal steel, Mike Daly on keyboards and guitar, Hector Munoz on drums, and Cornbread on bass -- sounds like his strongest and best controlled to date, as comfortable with the subtleties of &quot;Wave&quot; as the full-on rock of &quot;Castanets.&quot; Quite simply, Escovedo has never sung better than he does on this set, running the emotional spectrum from plaintive longing to swaggering contempt and never sounding less than convincing at any stop along the way. And while Turner Stephen Bruton's production on Escovedo's first three studio albums was intelligent and intuitive, Chris Stamey's work on A Man Under the Influence suits him just as well while sounding clearer, sharper, and better focused; the sound catches the full range of Escovedo's personality while adding the sonic details that sometimes got lost on his previous records. And if love and loss still remain Escovedo's favorite themes, like Hank Williams or Leonard Cohen he seems to have something new and telling to say about them each time out; each of this album's 11 songs is worth hearing, and the cumulative effect is nothing less than stunning. No one who's heard Escovedo's work doubts his status as one of the finest singer/songwriters of his day, and he's never been heard to better advantage on disc than on A Man Under the Influence.&quot;\n\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:f43382dc515fddba99665eb6d6562ec1a30ffad4","amp;dn":"Alejandro+Escovedo+-+A+Man+Under+The+Influence+%5B2001%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f43382dc515fddba99665eb6d6562ec1a30ffad4","infoHashBuffer":{"type":"Buffer","data":[244,51,130,220,81,95,221,186,153,102,94,182,214,86,46,193,163,15,250,212]},"announce":[],"urlList":[]}}