{"title":"Graphics Converter PRO 2013 v1.14 Build 130128 Incl Crack [TorDi","uid":8087643,"size":29617283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f5e383aa2fe9ce5943f111dd60cf4c72d2b66ee9&amp;dn=Graphics+Converter+PRO+2013+v1.14+Build+130128+Incl+Crack+%5BTorDi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"TorDigger","files":10,"time":1359648128,"description":"Graphics Converter PRO 2013\n\nGraphics Converter Pro 2011 is an easy-to-use and powerful batch graphics converter and image viewer, that can import more than 500 graphic formats and export more than 100 formats including BMP, GIF, JPG, PNG and many others. The program comes with 50 image filters and 12 image effects and more. Graphics Converter Pro 2011 for Vector supports many vector graphic formats. Now version 2011 supports the conversion between PDF files and hundreds of graphic formats.\n\nKey Features:\n\nÂ· Support more than 500 graphic formats, and Graphics Converter Pro 2000 for vector supports 22 vector formats, including CGM, DGN, DWF, DXF, DWG, GBR, PCT, PLT, WMF and more. For more details, please read list of 500 supported formats.\nÂ· Offer 60 image filters, including Blurring, Sharpening, Embossing, Diffusing, Color Balance, and more;\nÂ· Offer 12 image effects, including Flip, Wave, Noise, Arbitrary Rotation, and more.\nÂ· You can save your selected filters or effects as default set, and apply them in a batch processing.\nÂ· Support batch conversion from PDF files to hundreds of graphic formats, such as JPG, GIF, PNG, TIF and so on.\nÂ· Hundreds of graphic formats can be converted to PDF in batch. Merge various kinds of graphic files or PDF files to a single PDF file.\n\nWhat's New:\n\na. Support batch conversion from PDF files to hundreds of graphic formats, such as JPG, GIF, PNG, TIF and so on.\nb. Hundreds of graphic formats can be converted to PDF in batch. Graphics Converter Pro 2009 for Vector also can convert vector images(such as DWG, CGM, DGN, DWF and etc.) to PDF.\nc. Merge various kinds of graphic files or PDF files to a single PDF file.\nd. Easily split a multi-page PDF file to single-page PDF files(1 page to 1 file). \n\nSupported OS:\n\nWindows 8/7/vista/xp\n\nHomepage: http://www.iconcool.com/graphics-converter.htm\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:f5e383aa2fe9ce5943f111dd60cf4c72d2b66ee9","amp;dn":"Graphics+Converter+PRO+2013+v1.14+Build+130128+Incl+Crack+%5BTorDi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e383aa2fe9ce5943f111dd60cf4c72d2b66ee9","infoHashBuffer":{"type":"Buffer","data":[245,227,131,170,47,233,206,89,67,241,17,221,96,207,76,114,210,182,110,233]},"announce":[],"urlList":[]}}