{"title":"My Bloody Valentine - m b v [24 bit FLAC]","uid":8142521,"size":1027386234,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f6c6c716d6f5b14193c271cf80e06529037d6433&amp;dn=My+Bloody+Valentine+-+m+b+v+%5B24+bit+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"24.96","files":-1,"time":1360801915,"description":"Even though My Bloody Valentine promised late in 2012 that they would release new music in the near future, when M B V arrived in the middle of a February weekend in 2013, it was hard to believe it actually existed -- and not just because demand for the album kept crashing the band's website. For years, a follow-up to their 1991 masterpiece Loveless seemed impossible, and perhaps even unnecessary. What could live up to Kevin Shields' notorious perfectionism, never mind the expectations of rabid fans (some of whom weren't even alive when Loveless was released)? \n\n  With a title that evoked years of scrawling initials on mixtapes and playlists, M B V answered those worries with a set of songs that felt immediately familiar. And, appropriately enough given the 22-year wait, many of these tracks are decidedly unhurried, and maybe even hazier than what came before. &quot;who sees you&quot; and &quot;if i am&quot; churn and hover, full of cloudy vocals and lingering guitars, while &quot;she found now&quot; recalls Loveless' &quot;Sometimes&quot; in its whispery bliss. Yet there are differences, too: M B V's production is surprisingly direct and intimate, at times almost insular compared to Loveless' panoramas. &quot;is this and yes,&quot; which jettisons guitars in favor of organ and brass that evoke Stereolab's regal serenity, is one of the most strikingly different songs in their catalog. Shields and company spend much of the album avoiding the rhythmic heft that made their previous music equally lush and propulsive. Instead, they save M B V's loudest and most daring moments for last. \n\n  &quot;in another way&quot; pairs a stair-stepping vocal melody with tones that approach free jazz in their dense clusters, while &quot;nothing is&quot; rides a pummeling riff and drums that are almost perversely loud, as if to make up for muffling them elsewhere. The most exciting moment is &quot;wonder 2,&quot; which makes the jet engine comparisons to their music more literal than ever before, with rapid-fire beats and streaking sonics that suggest the song is being shot into space. Occasionally, M B V's songwriting doesn't always feel as immediate as before: &quot;only tomorrow&quot; and &quot;new you&quot; are among the tracks that make the most of their poppy structures and Bilinda Butcher's sugared murmurs, but as fans know, most of the band's hooks take their time to emerge. More comforting than revelatory, M B V reaffirms that My Bloody Valentine are one of a kind; the subtlety to their melodies, instrumentation, and the way they blur together belongs to them alone. They're not trying to re-create Loveless, nor should they, and M B V doesn't have to reinvent music (again) to be worth the wait.","torrent":{"xt":"urn:btih:f6c6c716d6f5b14193c271cf80e06529037d6433","amp;dn":"My+Bloody+Valentine+-+m+b+v+%5B24+bit+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6c6c716d6f5b14193c271cf80e06529037d6433","infoHashBuffer":{"type":"Buffer","data":[246,198,199,22,214,245,177,65,147,194,113,207,128,224,101,41,3,125,100,51]},"announce":[],"urlList":[]}}