{"title":"Kevin Hart - Laugh at My Pain","uid":8147127,"size":6695714816,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f7d4b359bc2e1f26f7f2cbc2cba371757b51782e&amp;dn=Kevin+Hart+-+Laugh+at+My+Pain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FLY635","files":1,"time":1360951250,"description":"This is a complete single layer DVD image with copy protection removed.\n\n\nFormat: ISO\n\nDisc 1 of 1\n\n\nPlease Seed!\n\n\nALRIGHT! ALRIGHT! ALRIGHT!\n\nFunnyman Kevin Hart is BACK and starring in the theatrical version of his 2011 LAUGH AT MY PAIN comedy tour that swept the nation and earned more than $15,000,000 in ticket sales! The 90-city LAUGH AT MY PAIN tour is one of the most successful Comedy Concerts in history. Hart's 2-day performance of LAUGH AT MY PAIN (at LA Live's Nokia Theatre), raised the bar and broke Eddie Murphy's long standing record of being the first African-American Comedian to surpass over $1.1 million two-day live Comedy show ticket sales.\n\nHartbeat Productions and CODEBLACK Entertainment are proud to bring you the historical, record-breaking and side-splitting stand-up of Kevin Hart in LAUGH AT MY PAIN. John Sellers of The Wrap says, Hart's highly successful 'Laugh at My Pain' stand-up tour has turned him into a hot commodity in Hollywood.\n\nKevin Hart is one of the most versatile and sought after comedic actors in film and television. According to Box Office Mojo, Hart has starred films that have grossed over $510,000,000 in Domestic ticket sales at the box office, making him one of the most recognized faces of comedy today.\n\nHis credits include the hit films Death At A Funeral, Superhero Movie, Meet Dave, The 40-Year Old Virgin, Scary Movie 4,Little Fockers, Barbershop, Soul Plane, Along Came Polly and Not Easily Broken and is set to star in the highly-anticipated romantic comedy Think Like A Man (based on the runaway Best-Selling book by comedian Steve Harvey) as well as the upcoming film, The Five Year Engagement, also starring 2007 Golden Globe Award Winner Emily Blunt and Jason Segel (Forgetting Sarah Marshall and TVs How I Met Your Mother).\n\nOn Television, Hart recently hosted the 11th Annual BET Awards (2011), which was the #1 Awards Show on Cable with over 7.71 million viewers. Hart also premiered his own one-hour comedy special Seriously Funny (2010) on Comedy Central and has hosted BETs revamped version of the classic stand-up comedy series Comic View: One Mic Stand that also helped catapult the careers of renown comedians such as D.L. Hughley and Cedric the Entertainer.\n\nAfter a successful performance during amateur night at a local Philadelphia comedy club, and winning several amateur comedy competitions, Hart left his day job as a shoe salesman and began his career as a full time comedian, capturing audiences at The Boston Comedy Club, Carolines, Stand-Up NY, The Laugh Factory and The Comedy Store. His first appearance at the Montreal Just for Laughs Comedy Festival led to his first role in the feature film Paper Soldiers (featuring an All-Star cast including Jay Z, Beanie Sigal, Memphis Bleek, and Kevin Carroll).\n\nExperience LAUGH AT MY PAIN, the show that quickly became a national phenomenon. Catch the original, never-before-seen Raw and Uncut backstage footage, and travel back to Philly with Kevin Hart where he began his journey to become one of the funniest and most successful comedians of all time.\n\nGet an up-close and personal look at Kevin Hart and get ready to laugh til it hurts.\n\nSpecifications\t\nColor : Yes\nAspect Ratio: 1.85 : 1 \t\nRelease Date: 27 April 2012\nRunning Time: 89 min\nNumber of Discs: 1","torrent":{"xt":"urn:btih:f7d4b359bc2e1f26f7f2cbc2cba371757b51782e","amp;dn":"Kevin+Hart+-+Laugh+at+My+Pain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7d4b359bc2e1f26f7f2cbc2cba371757b51782e","infoHashBuffer":{"type":"Buffer","data":[247,212,179,89,188,46,31,38,247,242,203,194,203,163,113,117,123,81,120,46]},"announce":[],"urlList":[]}}