{"title":"Lance Daly - Kisses (2008)","uid":8061891,"size":1066519618,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8ed668081a5b890d5b91877e80b099909a354af&amp;dn=Lance+Daly+-+Kisses+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"amenic","files":1,"time":1359107505,"description":"Kisses (2008)\nCast: Kelly O'Neill, Shane Curry, Stephen Rea, Paul Roe, Neili Conroy\nDirector: Lance Daly\nRunning Time: 75 min\nCountry: Ireland\n\nSynopsis: \nA pair of young runaways find both beauty and danger in the big city in an evocative drama from writer and director Lance Daly. Dylan (Shane Curry) is an 11-year-old boy growing up with an alcoholic father who often uses his children as punching bags. One day, Dylan decides he can take no more, and he makes plans to run away from home. His close friend Kylie (Kelly O'Neill), a girl of ten living next door, is also the product of an abusive family, and when she learns that Dylan is leaving home, she steals a wad of cash from her family and joins him. Making their way out of town on a barge driven by a sympathetic sailor with a yen for music, Dylan and Kylie end up in Dublin just as the Christmas season is going into full swing. The two friends explore the city, which seems magical even at its shabbiest. But while Dublin seems like a paradise of lights and magic by day, they learn that the city's sinister side comes into focus after the sun goes down. Kisses also stars Stephen Rea and Paul Roe.\n\nFF-Release Link: &lt;a href=&quot;\nhttps://board.freakyflicks.es/showthread.php?tid=1519&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.es/showthread.php?tid=1519&lt;/a&gt;\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.     &lt;a href=&quot;\nhttps://board.freakyflicks.es&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.es&lt;/a&gt;\n\n*****************************FREAKYFLICKS***************************** \t","torrent":{"xt":"urn:btih:f8ed668081a5b890d5b91877e80b099909a354af","amp;dn":"Lance+Daly+-+Kisses+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8ed668081a5b890d5b91877e80b099909a354af","infoHashBuffer":{"type":"Buffer","data":[248,237,102,128,129,165,184,144,213,185,24,119,232,11,9,153,9,163,84,175]},"announce":[],"urlList":[]}}