{"title":"Gerald Gallacher - Gangsters, Killers and Me (Mobi + Epub)","uid":8215742,"size":1008092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb6393740d25d564f50616c74b2d34b51599a485&amp;dn=Gerald+Gallacher+-+Gangsters%2C+Killers+and+Me+%28Mobi+%2B+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kevinkray","files":-1,"time":1362335412,"description":"Gerard Gallacher served as a police officer in Glasgow from the 1980s and three decades onwards. It was the time when drugs seized hold of the city and a new set of ruthless criminals were threatening to take control. There was still the usual violence of the city to deal with, including domestic violence, gang warfare and robbery but it was the huge increase in drug use that defined the times and led to many of the most notorious incidents in the city's criminal past. And Gerard Gallacher was in the thick of the action. As a detective, Gallacher knew and dealt with all the major criminals of the times; including Arthur Thompson and his son Arthur Jnr, Tam McGraw, Paul Ferris, Joe Hanlon and Bobby Glover. He gave evidence at Ferris' murder trial, reveals how he discovered that Arthur Thomson was a Security Services asset and was the first detective on the scene when Hanlon and Glover were murdered. He delivered the police warning to notorious criminal Frank McPhie to tell him that his life was in danger, a warning that went unheeded. Gallacher was also involved in countless other high profile investigations including the notorious drugs feud between former friends Tony McGovern and James Stevenson which ended in assassination. This is compelling account of a police career at the sharp end of the action by a detective who wouldn't toe the line. And as well as giving his forthright views on the less than exemplary conduct of some senior officers, Gallacher now reveals what really happened behind the scenes in some of the country's most high profile cases.","torrent":{"xt":"urn:btih:fb6393740d25d564f50616c74b2d34b51599a485","amp;dn":"Gerald+Gallacher+-+Gangsters%2C+Killers+and+Me+%28Mobi+%2B+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6393740d25d564f50616c74b2d34b51599a485","infoHashBuffer":{"type":"Buffer","data":[251,99,147,116,13,37,213,100,245,6,22,199,75,45,52,181,21,153,164,133]},"announce":[],"urlList":[]}}