{"title":"Dizzy Reece - 2004 Compilation - Mosaic Select #11 (3 CD's)  FLA","uid":8229402,"size":1454124816,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd25a3c4603b659c9f7657f9f46096aa5055d47d&amp;dn=Dizzy+Reece+-+2004+Compilation+-+Mosaic+Select+%2311+%283+CD%27s%29++FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnny39","files":30,"time":1362690304,"description":"July/August 2004 \n\nDizzy Reece\nMosaic Select 11: Dizzy Reece\nMosaic Records\n\n\n By Bill Shoemaker\n\n\n\n\n\nIn the mid-1950s, the likes of Miles Davis and Sonny Rollins put the word out on Dizzy Reece, who then split his time between London and Paris. Subsequently, the Jamaican-born trumpeter was sought out by a who's-who of American jazz greats, including the other Dizzy. In '58, trumpeter Donald Byrd and drummer Art Taylor recorded with Reece in a London session including tenor saxophonist Tubby Hayes and pianist Terry Shannon of the Jazz Couriers, then the premier U.K. hard-bop unit. To avoid the wrath of the powerful British Musicians Union, the resulting album-Blues in Trinity-producer Tony Hall created the hoax that the date was cut in Paris. Though the album survives as a second-tier Blue Note classic (it was among the first two dozen Connoisseurs Series releases), the initial buzz it created was sufficient to bring Reece to the U.S., where he led several sessions for Blue Note in a eight-month span ending in mid-'60. The four resulting albums have been collected in this Mosaic Select set, documenting one of the many rich minor chapters in the label's history.\n \n\nAlready a veteran at 27 when Blues in Trinity was waxed, Reece had a sound that could rip through the ranks of a big band. Subsequently, the trumpeter could fly confidently with Byrd on such Reece originals as &quot;Close-Up,&quot; a well-turned blues line, and the capering &quot;Shepherd's Serenade,&quot; a fine vehicle for Taylor's trademark propulsion. Significantly, these are the only tracks on which Byrd performs, leaving the frontline chores for most of the date to Reece and Hayes, whose prodigious talent is well-represented on such varied tracks as the title tune, a rhythmically flexible blues, and Monk's &quot;'Round About Midnight.&quot; The work of Hayes, the undervalued Shannon and the solid, if unimposing Canadian bassist Lloyd Thompson may have been the exception to the rule that Europeans were a cut below their American counterparts, but it was a glaring one, as Blues in Trinity is as good as Reece's subsequent Blue Notes.\n\nReece's first session at Rudy Van Gelder's yielded Star Bright, seemingly a reference to the lineup, given that there is no tune by that name on this quintet date with tenor saxophonist Hank Mobley, pianist Wynton Kelly, bass player Paul Chambers and Taylor. Reece did not simply rise to the occasion, spooling out choruses that alternate between allusive minor lines and bursts of a distinctive cool swagger. He knew the immense talents of those he was playing with, and the four tunes he brought to the date bear that out. A blues variant with a brisk groove, &quot;The Rebound&quot; is a near-perfect showcase for Mobley's gift for gliding through several choruses while deeply tapping the earthiness of the material. Combined, it's only a few choruses, but Kelly's introduction and solo on the erudite, jauntily swinging &quot;A Variation on Monk&quot; is a precis of the pianist's effortless rhythmic flow, bluesiness and deft touch.\n\nSoundin' Off is a solid quartet outing with pianist Walter Bishop Jr., bass player Doug Watkins and Taylor; but the absence of a flinty frontline partner and a greater reliance on standards (there's only one Reece tune on the date) gives the album a more generic feel than the others. The up side is that Reece airs out his chops on a variety of vehicles, spanning torchy ballads like &quot;Ghost of a Chance&quot; and boppin' romps on the &quot;I Got Rhythm&quot; template &quot;Eb Pob&quot; by Fats Navarro. The album provides a comprehensive picture of Reece's abilities as a trumpeter; the rub is that he was also a fine composer, and the lone original, a straight-up blues, doesn't adequately represent that aspect of his music. \n\nEven though Comin' On! is comprised of two sessions that yielded enough rejected takes to sentence the tapes to the vaults for almost 40 years before their gleaning for CD release, the album makes as good a case for Reece's writing as any of his Blue Notes. Performed by a quintet with tenor saxophonist Stanley Turrentine in the front line and drummer Art Blakey at his fieriest, &quot;The Case of the Frightened Lover&quot; is loaded with phrases that wriggle out of harmonic tight spots, while &quot;Achmet&quot; further confirms Reece's absorbtion of Eastern music. Overhauling the rhythm section for a sextet session that retains Turrentine and adds Musa Kaleem on tenor and flute, Reece shades themes like the slyly Monkish &quot;Sands&quot; with considerable finesse. Unfortunately, Reece's promise as a composer for larger units comes at the end of his most concentrated period of record-making.\n\nInexplicably, Reece made only five albums as a leader subsequent to his Blue Notes, which gives this collection poignancy equal to the joys of his music.\n","torrent":{"xt":"urn:btih:fd25a3c4603b659c9f7657f9f46096aa5055d47d","amp;dn":"Dizzy+Reece+-+2004+Compilation+-+Mosaic+Select+%2311+%283+CD%27s%29++FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd25a3c4603b659c9f7657f9f46096aa5055d47d","infoHashBuffer":{"type":"Buffer","data":[253,37,163,196,96,59,101,156,159,118,87,249,244,96,150,170,80,85,212,125]},"announce":[],"urlList":[]}}