{"title":"MET ART 2009-09-15 SELF IRINA J  MALENA C by OLEG MORENKO","uid":8029123,"size":301418933,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:fd62530c2519a26cba4ce141a80cbeb65f4dfe3f&amp;dn=MET+ART+2009-09-15+SELF+IRINA+J++MALENA+C+by+OLEG+MORENKO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bestec1234","files":-1,"time":1358368315,"description":"\n\n. &lt;a href=&quot;\nhttp://bayimg.com/EAilOaAEK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EAilOaAEK&lt;/a&gt;\n\n.\n\nIrina J\nAge: 21\nEye color: brown\nHair color: brown\nHeight: 173cm\nWeight: 50kg\nBreast size: small\nMeasurements: 79/61/89\nCountry: Russian Federation\nEthnicity: Caucasian\n\nBio: I'm a student at the architectural university. I'm going to be a manager in this area. The most insufferable for me is to be bored and monotonous. This is why I like activities that are concerned with different of impressions: acting, modeling, journalism, TV presenter etc. I prefer a variety of everything such as the way I dress and eat. I like to communicate with various people. I spare my free time for dancing and going to theaters. My favorite time of year is summer because I love the sun, sea and beach. Also, I enjoy horseback riding and going on trips. I lead a healthy life,  I don't smoke, and frequently go to the swimming pool. While working, I usually become thoroughly engrossed in my activity, put out all my strength until my task is completed. In the nearest future, I'm going to graduate from the university and get an interesting job. In modeling I'd like to gain recognition. \n\nMalena C\nAge: 23\nEye color: brown\nHair color: brown\nHeight: 168cm\nWeight: 50kg\nBreast size: medium\nMeasurements: 88/60/90\nCountry: Russian Federation\nEthnicity: Caucasian\n\nBio: I'm cheery, amiable and a bit bitchy. I'm fond of dancing and modeling. Also I like swimming, field-and-track athletics and other sports. In regards to relationships with other people, I appreciate openness and simplicity. I wish for sincere affection and true love and also I hate when people tell a lie. I love animals especially furry cats. As for my hobbies and activities, I like to make great parties with my circle of friends. Maybe this is the reason why I work in a night club as a dancer. I made the costumes for my performances by myself. Now I'm a student at the School of Design to become a stylist. In the long term future I'd like to complete World designers' training in France and Italy. \n\n","torrent":{"xt":"urn:btih:fd62530c2519a26cba4ce141a80cbeb65f4dfe3f","amp;dn":"MET+ART+2009-09-15+SELF+IRINA+J++MALENA+C+by+OLEG+MORENKO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd62530c2519a26cba4ce141a80cbeb65f4dfe3f","infoHashBuffer":{"type":"Buffer","data":[253,98,83,12,37,25,162,108,186,76,225,65,168,12,190,182,95,77,254,63]},"announce":[],"urlList":[]}}