{"title":"Radiohead - Amnesiac [24 bit FLAC] vinyl","uid":8111726,"size":895757844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd7a367d480d81aebf844e232ad6a53fd7f008a4&amp;dn=Radiohead+-+Amnesiac+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"24.96","files":-1,"time":1360202120,"description":"Faced with a deliberately difficult deviation into &quot;experimentation,&quot; Radiohead and their record label promoted Kid A as just that -- a brave experiment, and that the next album, which was just around the corner, really, would be the &quot;real&quot; record, the one to satiate fans looking for the next OK Computer, or at least guitars. At the time, people bought the myth, especially since live favorites like &quot;Knives Out&quot; and &quot;You and Whose Army?&quot; were nowhere to be seen on Kid A. That, however, ignores a salient point -- Amnesiac, as the album came to be known, consists of recordings made during the Kid A sessions, so it essentially sounds the same. Since Radiohead designed Kid A as a self-consciously epochal, genre-shattering record, the songs that didn't make the cut were a little simpler, so it shouldn't be a surprise that Amnesiac plays like a streamlined version of Kid A, complete with blatant electronica moves and production that sacrifices songs for atmosphere. This, inevitably, will disappoint the legions awaiting another guitar-based record (that is, after all, what they were explicitly promised), but what were they expecting? This is an album recorded at the same time and Radiohead have a certain reputation to uphold. It would be easier to accept this if the record was better than it is. Where Kid A had shock on its side, along with an admirably dogged desire to not be conventional, Amnesiac often plays as a hodgepodge. True, it's a hodgepodge with amazing moments: the hypnotic sway of &quot;Pyramid Song&quot; and &quot;You and Whose Army?,&quot; the swirling &quot;I Might Be Wrong,&quot; &quot;Knives Out,&quot; and the spectacular closer &quot;Life in a Glasshouse,&quot; complete with a drunkenly swooning brass band. But, these are not moments that are markedly different than Kid A, which itself lost momentum as it sputtered to a close. And this is the main problem -- though it's nice for an artist to be generous and release two albums, these two records clearly derive from the same source and have the same flaws, which clearly would have been corrected if they had been consolidated into one record. Instead of revealing why the two records were separated, the appearance of Amnesiac makes the separation seem arbitrary -- there's no shift in tone, no shift in approach, and the division only makes the two records seem unfocused, even if the best of both records is quite stunning, proof positive that Radiohead are one of the best bands of their time.","torrent":{"xt":"urn:btih:fd7a367d480d81aebf844e232ad6a53fd7f008a4","amp;dn":"Radiohead+-+Amnesiac+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd7a367d480d81aebf844e232ad6a53fd7f008a4","infoHashBuffer":{"type":"Buffer","data":[253,122,54,125,72,13,129,174,191,132,78,35,42,214,165,63,215,240,8,164]},"announce":[],"urlList":[]}}