{"title":"Dance For Love","uid":8036824,"size":7286358324,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ff93eaa8deb65e169371696a691102fddd6f1519&amp;dn=Dance+For+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoAaT999","files":6,"time":1358534888,"description":"Second in a Series of 4 Programs: &quot;The Dance for Love&quot;Â© The Second 36 Elements of Spiritual Mastery: The Inner Keys to the Lower, Middle &amp; Higher God-Worlds. Recorded in Greece &amp; Cyprus, May 2002.\n\nReviews Dance for Life before moving into &quot;Awakening the God-Force Within&quot; and the 12 Vehicles, the 12 Postures and the 12 Responsibilities of Spiritual Mastery.\n\nIntroduces the Codes of Passage - the Signs, Seals and Scepters (Vehicles, Postures and Master Keys). The God-Seed, the &quot;Inner Earth&quot; and Trion-Meajhe Time Matrices, the Ecka Map of the God-World gates, Star gates-Locks-Cruxansataea and the Halls of Amenti Star Gates.\n\nIntroduction to Radial-Body Creation - Sculpting Intention, the Scepter Rods &amp; Staff, the God-World Codes: ReushA, Eckasha-A, Eckasha-Aah, Reushayana and Rashayana and ManU &quot;Inner Earth Code&quot; and Immanu &quot;Blood Code&quot; Vecas-Lehaia, Reushia, Shahaia, Ur-immanU, ThUn-immanU &amp; Or-immanU.\n\nFocuses on Veca Code techniques for activation of the Phase 2 ImmanU Eckasha Merkaba, the Lehaia &amp; UrimmanU Codes, the Psonn of Khem A Lo HA Tea, Amenti Meditation Voyage Projection, Seurias Bowing Willow, Swaying Reed, Quaking mountain and Master Se'Ur-1, the Dance of Camelot-Returning to Love: the 6 Upper Body Electrical Seuria Wave Run and Rod-Encoding.\n\nMetatronic materials present an expose within the occult teachings of so-called &quot;gods&quot; Osiris, Horus, Thoth, Isis, Enoch, the associated creeds of &quot;YHWH&quot;, the &quot;Tetragrammaton&quot;, &quot;Merlin&quot;, etc. etc. Discover the hidden realities and truths behind Metatron's Cube, and Metatron's Atom within the forbidden context of the Ancient Eyes of the God-Head and the &quot;Eyes&quot; of Brahman, &quot;YHWH&quot;, &quot;Elohim&quot;, &quot;Anubis&quot; and the &quot;Dragon&quot;; their relationship to the ancient polytheistic &quot;gods&quot; of Sumeria, Israel, Egypt, Yucatan, Mongolia, India, Rome &amp; Greece and the hidden intimate association with Christian, Islamic, Hebrew and Eastern religious traditions.\n\nExplore the &quot;Mysteries&quot; of Osirus, Urantia, &quot;Archangel&quot; Michael and the 'Un-Godly' Wesedaks races and the ongoing effects on our Life Field. This presentation reveals PLAN A &amp; PLAN B, and exposes the technologies of the &quot;Turnstiles&quot;, the BeaST, the &quot;Polarization Wave&quot;, the Judgement Day Prophecies of the &quot;Atlantian Script&quot;, Pre-Birth Soul Agreements, the Custodial Land Entrustments shared with Mother Earth Soul and the 3 Paths of Genesis right ahead.\n\n","torrent":{"xt":"urn:btih:ff93eaa8deb65e169371696a691102fddd6f1519","amp;dn":"Dance+For+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff93eaa8deb65e169371696a691102fddd6f1519","infoHashBuffer":{"type":"Buffer","data":[255,147,234,168,222,182,94,22,147,113,105,106,105,17,2,253,221,111,21,25]},"announce":[],"urlList":[]}}